[
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2020/10/scams-starting-social-media-proliferate-early-2020",
  "scraped_at": "2025-11-15T20:48:41.689799",
  "title": "Scams starting on social media proliferate in early 2020",
  "published_date": "2020-10-21",
  "full_text": "Social media can be a great way to connect with friends while the pandemic has you keeping your distance. But reports to FTC’s Consumer Sentinel Network suggest that that social media websites and apps have become popular hangouts for scammers, too. Reports that people lost money to scams that started on social media 1  more than tripled in the past year, with a sharp increase in the second quarter of 2020. Reports about scams that started on social media have been increasing for years. In 2019, total reported losses to these frauds reached $134 million. But reported losses reached record highs, climbing to nearly $117 million in just the first six months of 2020. In that time, the reported scams that started on social media often related to online shopping, romance scams, and supposed economic relief or income opportunities. Reports about ecommerce sites that don’t deliver the goods top the FTC’s list. 2  These reports skyrocketed with the pandemic, and nearly one in four reports to the FTC mentioned a social media hook. 3  People mentioned Facebook or Instagram in 94% of reports that identified a specific platform, 4  many saying they ordered after seeing an ad. These scam ads look real and can be carefully targeted to reach a particular audience. The scammers can delete comments on their ads or posts, so that negative responses don’t show up and alert people to the con. About half of all romance scam reports to the FTC since 2019 involve social media, usually Facebook or Instagram. 5  However, since the pandemic began, more people than ever have reported losing money to romance scams. That includes the scams that start with a social media message or friend request. 6 People are increasingly reporting social media messages that offer grant money and other giveaways, supposedly to help people during the pandemic. These scams offer so-called relief to people in need of cash, but scammers are really after your money, your information, or both. These messages can even come from friends who may have been hacked, or who don’t know the offer is a scam, since scammers often tell people to send their message on to others. As people seek more ways to earn money, reports about multi-level marketing (MLM) companies and pyramid schemes – including blessing circles and other gifting schemes – on social media have increased. The numbers were up a staggering fivefold in the second quarter of 2020. 7  Many of these recruitment offers reportedly came with extravagant claims about likely earnings, which is always a red flag. Some MLM companies are illegal pyramid schemes: they survive on recruiting new participants rather than selling products. Most people who join an MLM make little or no money with it, while people who become involved with a pyramid scheme typically lose everything they invest. The many scams that show up on social media may benefit from scammers’ low-cost access to entire networks of people. The scammer can hide behind a phony profile, pretend to be someone you know, or even take over a real account. By hiding who they are, they can get into a virtual community you trust, leading you to be more likely to trust them. Here are some tips to help you steer clear of scammers on social media: If you spot a scam, report it to the social media site and the FTC at  ftc.gov/complaint .      1 This analysis includes fraud reports directly to the FTC where the method of contact was specifically identified as social network, and reports where the method of contact was not specified, specified as internet, or consumer initiated contact, if the comments field also included mention of Facebook, Instagram, LinkedIn, Pinterest, Reddit, Snapchat, TikTok, Tumblr, Twitter, or YouTube. The analysis excludes reports categorized as complaints about social networking services, internet information services, mobile text messages, and unsolicited email.   2 In Q1 2020 and Q2 2020, 28% of reports of frauds that started on social media were categorized as online shopping fraud where the goods were ordered but not received, followed by romance scams (13%), business imposter scams (6%), family and friend imposters (6%), and government imposter scams (4%).   3 In Q1 and Q2 2020, of the 43,391 reports directly to the FTC about undelivered online shopping orders, 9,832 (23%) indicated the problem started on social media.   4 Of the 9,832 reports (in Endnote 3) about online shopping orders that never arrived, 7,974 reports identified one or more of the social media platforms listed in Endnote 1, including 7,502 that identified Facebook or Instagram.   5 From January 2019 through June 2020, 10,491 (48%) of the 21,941 romance scam reports directly to the FTC were scams that started on social media. Of these, 5,845 identified one or more of the social media platforms listed in Endnote 1, including 5,147 that identified Facebook or Instagram.   6 In Q2 2020, 2,621 people reported a monetary loss on a romance scam directly to the FTC, a 19% increase over the previous quarterly high of 2,208 in Q1 of 2020.   7 These figures are based on reports directly to the FTC categorized as multi-level marketing\\pyramids\\chain letters. In 2020, reports in this category increased from 387 total reports in the first quarter to 824 total reports in the second quarter. Of those that started on social media, the increase was 94 in Q1, compared to 491 in Q2.",
  "summary": "Social media can be a great way to connect with friends while the pandemic has you keeping your distance.",
  "tags": [],
  "image_urls": [],
  "images": [],
  "relevant_data": [
    "Before you buy based on an ad or post, check out the company. Type its name in a search engine with words like or “scam” or “complaint.”",
    "Never send money to a love interest you have not met in person.",
    "If you get a message from a friend about a way to get some financial relief, call them. Did they forward it to you? If not, tell them their account may have been hacked. If so, check it out before you act.",
    "Before paying into an “opportunity” to earn money, check out  ftc.gov/mlm .",
    "Don’t make it easy for scammers to target you – check your social media privacy settings to limit what you share publicly."
  ],
  "sources": [
    {
      "index": 1,
      "text": "Before you buy based on an ad or post, check out the company. Type its name in a search engine with words like or “scam” or “complaint.”",
      "links": []
    },
    {
      "index": 2,
      "text": "Never send money to a love interest you have not met in person.",
      "links": []
    },
    {
      "index": 3,
      "text": "If you get a message from a friend about a way to get some financial relief, call them. Did they forward it to you? If not, tell them their account may have been hacked. If so, check it out before you act.",
      "links": []
    },
    {
      "index": 4,
      "text": "Before paying into an “opportunity” to earn money, check out  ftc.gov/mlm .",
      "links": [
        "https://ftc.gov/mlm"
      ]
    },
    {
      "index": 5,
      "text": "Don’t make it easy for scammers to target you – check your social media privacy settings to limit what you share publicly.",
      "links": []
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2025/08/false-alarm-real-scam-how-scammers-are-stealing-older-adults-life-savings",
  "scraped_at": "2025-11-15T20:48:39.242961",
  "title": "False alarm, real scam: how scammers are stealing older adults’ life savings",
  "published_date": "2025-08-07",
  "full_text": "Reports to the FTC show a growing wave of scams aimed squarely at retirees’ life savings. These scammers pretend to be from known and trusted government agencies and businesses. And, in an ironic twist, recent scams use fake security alerts and other false alarms to prey on older adults’ vigilance about  protecting  their money and identity to steal from them. [1]  Some people 60+ have reported emptying their bank accounts and even clearing out their 401ks. While younger people report losing money to these imposters too, reports of losses in the tens and hundreds of thousands of dollars are much more likely to be filed by older adults, [2]  and those numbers have soared. From 2020 to 2024, the number of reports from older adults who lost $10,000 or more to these scams increased more than fourfold. [3]  When older adults reported losing more than $100,000, the trend was even more striking: during the same period, the number of reports increased nearly sevenfold, and the combined reported losses went up eightfold. These high-loss scams typically start with a (fake) story that gets your attention with one or a combination of these lies: These scammers say the only way out of the (fake) crisis is to follow their instructions – which will include sending money to the scammers. They may say this will keep your money safe, secure your identity, clear your name, or help catch the criminals. There may be layers of complexity to the story, but it’s all a lie aimed at draining your accounts. Reports show that when people think they are fixing a problem rather than sending a stranger money, their losses are often limited only by their available funds. Lots of scams are now carried out online, but these scams still depend on a phone call. Even when they don’t  start  with a call, reports show the goal is to get you on the phone. [4]  A call is still the best way to dial up the fear and the urgency so it’s harder for you to think clearly and check things out. Keeping you on the phone is also designed to keep you from talking to anyone who could help – a friend or family member in a calmer state of mind who might see through the lies. In another layer of irony, these scammers often pretend to be the FTC, the nation’s consumer protection agency, sometimes impersonating real staff. Reports show these scammers have told people to transfer money out of their accounts, deposit cash into Bitcoin ATMs, and even hand off stacks of cash or gold to couriers [5]  – all things the real FTC will  never  do. Scammers also pretend to be other businesses and agencies, including banks, Microsoft, and the Social Security Administration. Often, they tag team you: maybe starting with a pop-up security alert impersonating Microsoft and then transferring you to someone pretending to be from the FTC for “help” with a fake identity theft problem.  The security of your accounts, along with the risk of identity theft, are  real  concerns that real companies might call you about. So how can you stay vigilant  and  steer clear of these scams? Learn more about  imposter scams . To spot and avoid scams – and learn how to recover money if you paid a scammer – visit  ftc.gov/scams . Report scams to the FTC at  ReportFraud.ftc.gov .   [1] A 2023 Gallup poll asked Americans how much they worry about various types of crime. The results showed people most often worried about being a victim of identity theft. Being tricked by a scammer into sending money or providing access to a financial account was the second highest concern. See Gallup.com,  Scams: Relatively Common and Anxiety-Inducing for Americans  (November 2023). [2] In 2024, losses to business imposter and government imposter scams of $10,000 and over were more than twice as likely to be reported by older adults, with losses over $100,000 three times as likely to be reported by older adults. This comparison of older and younger consumers’ reporting rates is normalized based on the population size of each age group using the Census Bureau’s 2019-2023 American Community Survey 5-Year Estimates. This excludes reports that did not include consumer age information. [3] The total number of business imposter and government imposter reports filed by older adults with a loss of $10K or more are as follows: 1,790 (2020), 3,516 (2021), 5,559 (2022), 7,091 (2023), 8,269 (2024). [4] In 2024, 41% of older adults who reported losing $10K or more to a business or government imposter scam indicated a phone call was the initial contact method, 15% indicated the scam started with an online ad or pop-up, and 13% said it started with an email. Reports indicating online ad or pop-up as the contact method typically described pop-up security alerts impersonating Microsoft or Apple with a number to call. [5] In 2024, 33% of older adults who reported losing $10K or more to a business or government imposter scam indicated cryptocurrency was the method of payment, followed by bank transfer (20%), and cash (16%). Most reports that identified cryptocurrency as the payment method mentioned Bitcoin ATMs in the report narrative. Although gold is not a payment method consumers can select, in about 5% of reports with losses of $10K or more (and about 21% of reports with losses over $100K) gold was written in as the payment method and/or mentioned in the complaint narrative. Note that when losses exceeded $100,000, bank transfer was the most frequently reported method at 32% of reports.",
  "summary": "Reports to the FTC show a growing wave of scams aimed squarely at retirees’ life savings. These scammers pretend to be from known and trusted government agencies and businesses.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "deceptive/misleading conduct",
    "Government"
  ],
  "image_urls": [
    "https://www.ftc.gov/system/files/styles/scaled_lg/private/ftc_gov/images/Older-adults-reported-losses.png?itok=g1l88EpQ"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/system/files/styles/scaled_lg/private/ftc_gov/images/Older-adults-reported-losses.png?itok=g1l88EpQ",
      "path": "full/ee8809aeb1f218314b80837c2d7d00b499188793.jpg",
      "checksum": "4233419c98d9fbfacfcbbdd9dd61a24e",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Lie #1: Someone is using your accounts.    This lie might start with someone pretending to be your bank, flagging so-called suspicious activity, or pretending to be Amazon with a message about an unauthorized purchase;",
    "Lie #2: Your information is being used to commit crimes.    This lie may come from a supposed government officer or agent, warning that your Social Security number is linked to a crime like drug smuggling, money laundering, or even child pornography; or",
    "Lie #3: There’s a security problem with your computer.    This lie often starts with a fake on-screen security alert that looks like it’s from Microsoft or Apple with a number to call. If you call, they say your online accounts have been hacked.",
    "Don’t move money to “protect it.”   Never transfer or send money to anyone, no matter who they say they are, in response to an unexpected call or message. Even if they say it’s to “protect it.”",
    "Hang up and verify.   Hang up the phone and call the company or agency directly using a phone number or website you know is real. Don’t trust what an unexpected caller says, and never use the phone number in a computer security pop-up or an unexpected text or email.",
    "Block unwanted calls.   Learn about your  call blocking options  to stop many of these scammers before they reach you.",
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "deceptive/misleading conduct",
    "Government"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Lie #1: Someone is using your accounts.    This lie might start with someone pretending to be your bank, flagging so-called suspicious activity, or pretending to be Amazon with a message about an unauthorized purchase;",
      "links": [],
      "statistics": [
        "1"
      ]
    },
    {
      "index": 2,
      "text": "Lie #2: Your information is being used to commit crimes.    This lie may come from a supposed government officer or agent, warning that your Social Security number is linked to a crime like drug smuggling, money laundering, or even child pornography; or",
      "links": [],
      "statistics": [
        "2"
      ]
    },
    {
      "index": 3,
      "text": "Lie #3: There’s a security problem with your computer.    This lie often starts with a fake on-screen security alert that looks like it’s from Microsoft or Apple with a number to call. If you call, they say your online accounts have been hacked.",
      "links": [],
      "statistics": [
        "3"
      ]
    },
    {
      "index": 4,
      "text": "Don’t move money to “protect it.”   Never transfer or send money to anyone, no matter who they say they are, in response to an unexpected call or message. Even if they say it’s to “protect it.”",
      "links": []
    },
    {
      "index": 5,
      "text": "Hang up and verify.   Hang up the phone and call the company or agency directly using a phone number or website you know is real. Don’t trust what an unexpected caller says, and never use the phone number in a computer security pop-up or an unexpected text or email.",
      "links": []
    },
    {
      "index": 6,
      "text": "Block unwanted calls.   Learn about your  call blocking options  to stop many of these scammers before they reach you.",
      "links": [
        "https://consumer.ftc.gov/articles/how-block-unwanted-calls"
      ]
    },
    {
      "index": 7,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 8,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    },
    {
      "index": 9,
      "text": "Imposter",
      "links": [
        "https://www.ftc.gov/imposter"
      ]
    },
    {
      "index": 10,
      "text": "deceptive/misleading conduct",
      "links": [
        "https://www.ftc.gov/terms/deceptivemisleading-conduct"
      ]
    },
    {
      "index": 11,
      "text": "Government",
      "links": [
        "https://www.ftc.gov/industry/government"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2020/12/income-scams-big-promises-big-losses",
  "scraped_at": "2025-11-15T20:48:43.445151",
  "title": "Income scams: big promises, big losses",
  "published_date": "2020-12-10",
  "full_text": "When the job market is tough, scammers target people who are looking for work or trying to bring in extra income. Economic conditions caused by the COVID-19 pandemic may have created ideal conditions for these scams to proliferate. In fact, the volume of reports to the FTC about income scams reached the highest levels on record in the second quarter of 2020. 1 These income scams take many forms. Looming large are phony job offers involving fake checks. Schemes that promise to teach you insider secrets to start your own business are part of the mix, too, as are investment scams promising high returns. Chain letters and pyramid schemes are also popping up. People have reported losing about $610 million from income scams since 2016, with nearly $150 million reported lost in the first nine months of 2020 alone. Roughly one in three income scam reports is about phony job offers with a fake check as part of the ruse. Sometimes these scams start with an unexpected email about a job. For example, some c ollege students have reported getting messages from someone impersonating their school’s career services office. Other people have reported that the  scam started after they applied for a job or posted a resume online. After a speedy hiring process, people get a supposed paycheck to deposit. But there’s always a plausible explanation for why they can’t keep all the money. Scammers tell people hired as “mystery shoppers” to buy gift cards as they evaluate a retailer (the scammers get the gift card PIN numbers, of course). People hired as “virtual personal assistants” are told to send some of the money to a supposed supplier of home office equipment. Other people have even reported that their so-called boss told them to use some of the funds to buy gift cards for co-workers sick with COVID-19. These scams work because banks have to make funds from deposited checks available within a day or two, but it can take weeks to uncover a fake. When you see the funds in your account, parting with some of the money may feel risk-free. But when the fake check ultimately bounces, the bank will want you to pay back the funds. The median reported loss on fake check job scams is $2,300 2 , and adults in their 20s are more than three times as likely to report a loss on a fake check job scam than other age groups. 3 Another common tactic income scams use is making false claims about likely earnings from starting your own business. Business opportunity scammers promise attractive incomes to trick entrepreneurial people into buying bogus marketing services, training, or coaching programs. But despite testimonials that flaunt lavish lifestyles, their “proven systems” just don’t work. People have reported that some scammers are even invoking the pandemic as part of their pitch in offering work-at-home “opportunities.” But these opportunities frequently add up to huge losses. In fact, the median individual loss people report on business and work-at-home opportunities is $3,000, and for people in their 60s and 70s, the reported median loss is four times higher. 4 Drumming up interest in investments is another lucrative tactic scammers deploy. Many investment seminar cons work by promising to teach people how to earn high returns on things like trading online or investing in real estate. But people report  losing  more on these scams than on any other fraud: the reported median individual loss is over $16,000. People in their 50s and 60s are more likely than other age groups to report losing money on these cons, 5  and their reported median individual losses are nearly $24,000. Some income scams put people to work as unwitting accomplices in another scam, costing people their time and effort. People report being hired on a 30-day probationary period, with titles like “logistics manager.” The scammers tell them their job is to receive and reship packages. What they don’t know is that they’re reshipping items bought with stolen credit cards. And after their probationary period ends, the scammers simply cut off communication without ever paying the person. Another variety is the pyramid scam. That old scam got new life by using novel names, like “blessing looms,” “circle games,” and “sou-sous.” A sou-sou is a collective savings club with historic roots in West Africa and the Caribbean. In a real sou-sou, money is rotated within a family or close-knit group, and everyone gets back what they contribute. Fake sou-sous, on the other hand, are pyramid schemes or chain letters. Like so-called blessing looms, they claim you’ll multiply the money you put in. But unlike a real sou-sou, payouts depend on recruiting new members – like family and friends. People typically lose all the money they invest. While reports of fake sou-sous by any name are still relatively low, they increased sharply starting in the second quarter of 2020 6 ,and nearly 40% of people who reported said they heard about the supposed opportunity on social media. 7 It is clear that income scams take many different forms, but they share some tell-tale signs. Keep these tips in mind to avoid income scams: To learn more, visit  ftc.gov/incomescams . If you spot a scam, report it to the FTC at  ReportFraud.ftc.gov .    1 In Q2 2020, 11,879 income scams were reported, a 70% increase from reports captured in Q2 2019. In total, 29,419 income scams were reported directly to the FTC in 2020 through Q3, compared to 26,719 in all of 2019. These figures do not include the complaints collected by other organizations that contribute to Sentinel. Counting all reports to the FTC or any Sentinel data contributor, there were 44,274 income scam reports in 2020 through Q3 and 52,837 such reports in all of 2019. Income scams are defined in this Spotlight as frauds reported directly to the FTC classified as business and work-at-home opportunities, job scams and employment agencies, pyramids and multi-level marketing, investment seminars and advice, stocks and commodity futures trading, art, gems and rare coin investments, and miscellaneous investments. Additionally, reports about fake check scams that were identified through a keyword analysis as involving a job or other income opportunity are included.    2 The median individual reported dollar loss figures provided in this Spotlight are based on reports directly to the FTC for a robust and recent time period, January 2018 through September 2020.   3 From January 2018 through September 2020, 83% of income scam reports included age information. This age comparison is normalized based on the number of loss reports per million population by age during this period. Population numbers were obtained from the U.S. Census Bureau Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States (June 2020).   4 See endnote 2. The median individual dollar loss on reports classified as business and work-at-home opportunities submitted by consumers ages 60-79 was $12,000.   5 This age comparison is based on the methodology explained in endnote 3.   6 Reports of fake sou sou scams increased from an average of less than one report per quarter from Q1 2017 through Q1 2019 to 47 reports in Q2 2020 and 191 reports in Q3 2020. These scams were identified through keyword analysis of the narratives provided in income scam reports. Reports about multi-level marketing companies (MLMs) and pyramid schemes of all types doubled in the second quarter.   7 Reports in which the consumer heard about the fake sou sou on social media include income scam reports where the method of contact was specifically identified as social network, and reports where the method of contact was not specified, specified as internet, or consumer initiated contact, if the comments field also included mention of Facebook, Instagram, LinkedIn, Pinterest, Reddit, Snapchat, TikTok, Tumblr, Twitter, or YouTube.",
  "summary": "When the job market is tough, scammers target people who are looking for work or trying to bring in extra income.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u50873/income_scams20_spotlight.jpg"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u50873/income_scams20_spotlight.jpg",
      "path": "full/da03b0b92a04837db49b087c8a930093cb20e97c.jpg",
      "checksum": "1990cabb35c48b18d89f5bdbaaba5fa1",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Take your time. Avoid high-pressure sales pitches that require you to get involved now or risk losing out.",
    "Be skeptical about “success stories” and testimonials. Glowing stories could be fake and online reviews may have come from made-up profiles.",
    "Don’t bank on a “cleared” check. If you’re told to send some of the money or buy gift cards, you can bet it’s a fake even if you see the money in your account.",
    "Do your research. Search online for the company’s name plus words like review, scam, or complaint."
  ],
  "sources": [
    {
      "index": 1,
      "text": "Take your time. Avoid high-pressure sales pitches that require you to get involved now or risk losing out.",
      "links": []
    },
    {
      "index": 2,
      "text": "Be skeptical about “success stories” and testimonials. Glowing stories could be fake and online reviews may have come from made-up profiles.",
      "links": []
    },
    {
      "index": 3,
      "text": "Don’t bank on a “cleared” check. If you’re told to send some of the money or buy gift cards, you can bet it’s a fake even if you see the money in your account.",
      "links": []
    },
    {
      "index": 4,
      "text": "Do your research. Search online for the company’s name plus words like review, scam, or complaint.",
      "links": []
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2020/12/gift-cards-top-scammers-wish-lists",
  "scraped_at": "2025-11-15T20:48:43.786918",
  "title": "Gift cards top scammers’ wish lists",
  "published_date": "2020-12-21",
  "full_text": "Gift cards make great holiday gifts. But reports to FTC show that scammers like getting them, too. Scammers don’t ask nicely, though. They use trickery to  insist  on gift cards, and they ask for specific brands.  Scammers  prefer gift cards because they can get quick cash while staying  a nonymous . In fact, giving a scammer the PIN numbers off the back of a gift card is the number one way people report losing money on many of the top frauds reported to the FTC. About one in four people who tell the FTC they lost money to fraud say they paid with a gift card. 1  In fact, gift cards have topped the list of reported fraud payment methods every year since 2018. During that time, people reported losing a total of nearly $245 million, with a median individual loss of $840. 2   Based on reports, certain types of scams seem to favor gift cards as a form of payment. Nearly half of people who reported paying someone posing as a government authority said they paid with a gift card. Nearly 45% of those who reported losing money to someone pretending to be a friend or a family member paid with gift cards. And gift cards were the reported payment method in about a third of tech support and other business impersonation scams. 3 Scammers always have some reason why you need to buy gift cards. They might say you’re in serious trouble with the government and must buy “electronic vouchers” to avoid arrest. Some people say scammers posing as businesses promised special promotional pricing for phone or TV service if they paid for the first three months with a gift card. Others thought they were buying gift cards to evaluate a retailer as a “secret shopper.” Scammers tell people to go to specific stores like Walmart, Target, CVS, and Walgreens to buy the cards. Some people have reported that alert store employees have intervened, but scammers work hard to stop that from happening. They keep people on the phone and tell them not to talk to anyone about why they’re buying the cards. They even tell people what to say if anyone asks questions.  The top gift card brands that scammers demand change over time. Reports to the FTC suggest that eBay is now the gift card of choice for scammers. It replaces Google Play in the decidedly un-coveted top spot, which earlier replaced iTunes as the top card brand people reported. 4   But reports of fraud payments with both these brands declined significantly in 2019, and the brand reported most often in 2020 is eBay. Notably, reports suggest scammers have diversified, and now frequently request a variety of other gift cards in addition to these top brands. 5 Whenever someone demands to be paid with a gift card, that’s a scam.   Gift cards are for gifts, not for payment.  If you paid someone with a gift card by giving them the numbers on the card, keep the card and your receipt, and report it to the card issuer immediately. You’ll find contact information for some major gift cards at  ftc.gov/giftcards . Then report your experience to the FTC at  ReportFraud.ftc.gov . To learn more about spotting and avoiding gift card scams, visit  ftc.gov/giftcards . If you’re a retailer, or state or local law enforcement, and you’re interested in helping people avoid gift card scams, visit  ftc.gov/StopGiftCardScams  to download, print, and share materials in your store and community.   1 This figure is based on reports from January 2018 through September 2020, exluding reports that do not specify a payment method. Figures pertaining to gift card reports throughout this Spotlight are based on the total number of fraud reports that identify a gift or reload card (e.g., MoneyPak) as a method of payment. This analysis excludes fraud reports classified as “online shopping” because of the legitimate use of gift cards among large retailers. To eliminate inconsistencies between data sources, reports provided by Sentinel data contributors and reports that do not specify a method of payment are also excluded from this analysis.   2 These figures are based on gift card reports from January 2018 through September 2020 that indicate a dollar loss of $1 to $999,999.   3 Tech support scams typically involve the impersonation of computer companies like Microsoft, and start with a call or popup warning about a computer virus or other technical issue. Consumers affected by tech support scams pay for “repair” of a nonexistent problem.   4 Card brands are identified through keyword analysis of the narratives provided in gift card reports.   5 In 2020 through Q3, the most reported gift and reload card brands mentioned in fraud reports are eBay, Google Play, Target, iTunes, and Amazon. Together, these five brands make up approximately 39% of the reports where people indicated they paid a scammer with a gift or reload card. Reports provided by data contributors or that are classified as “online shopping” are excluded. Card brands are identified through keyword analysis of the narratives provided in this subset of reports.",
  "summary": "Gift cards make great holiday gifts. But reports to FTC show that scammers like getting them, too. Scammers don’t ask nicely, though.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u97525/top_frauds_paid_for_with_gift_cards_0.png",
    "https://www.ftc.gov/sites/default/files/u50873/gift_card_pic_2_0.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u97525/top_frauds_paid_for_with_gift_cards_0.png",
      "path": "full/cf35aaf1fb6cc150df0391a128b574f7524604c2.jpg",
      "checksum": "83fa688f93e641be4937d943f7bd800e",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/u50873/gift_card_pic_2_0.png",
      "path": "full/85bb263c5c26d9cf5a3895944891e50f84112000.jpg",
      "checksum": "5cb651de818990c885cd74fb8e129922",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Competition Matters \n           \n   \n\n   First Research Published from Physician 6(b) Study \n\n \n    \n\n \n     \n           Tom Koch (Acting DAD, BE Office of Applied Research and Outreach) and Ted Rosenbaum (Acting BE Director) \n       \n \n\n\n \n     \n           June 17, 2025 \n \n       \n \n\n   \n      \n         \n \n  \n  \n   \n    \n              \n\n \n         \n               Technology Blog \n           \n   \n\n   The FTC Is on the Front Lines of Tech Innovation & Regulation \n\n \n    \n\n \n     \n           Stephanie T.",
    "Nguyen, Chief Technologist \n       \n \n\n\n \n     \n           January 17, 2025 \n \n       \n \n\n   \n      \n         \n \n  \n  \n   \n     Press Release \n   FTC Requires Divestiture of Oil Change Shops in Valvoline-Greenbriar Deal \n\n\n \n     \n           November 14, 2025 \n \n       \n \n\n   \n \n  \n  \n   \n\n                   \n           Dec 09 \n         \n             \n        \n   Office Hours for Librarians – December 9, 2025 \n\n \n     \n    \n                                               Tuesday, December 9, 2025 | 2:00PM \n -  3:00PM \n                     \n \n\n       \n       \n \n  \n  \n   \n    \n              \n\n \n         \n               Data Spotlight \n           \n   \n\n   Gift cards top scammers’ wish lists  \n\n \n    \n\n \n             By \n         \n           Emma Fletcher \n       \n \n\n\n \n     \n           December 21, 2020 \n \n       \n \n \n   \n      \n         \n \n  \n  \n   \n    \n              \n\n \n     \n           Gift cards make great holiday gifts.",
    "1  In fact, gift cards have topped the list of reported fraud payment methods every year since 2018.",
    "During that time, people reported losing a total of nearly $245 million, with a median individual loss of $840.",
    "2   \n\n \n\n Based on reports, certain types of scams seem to favor gift cards as a form of payment.",
    "Nearly 45% of those who reported losing money to someone pretending to be a friend or a family member paid with gift cards.",
    "3 \n\n Scammers always have some reason why you need to buy gift cards.",
    "4   But reports of fraud payments with both these brands declined significantly in 2019, and the brand reported most often in 2020 is eBay.",
    "5 \n\n\t Whenever someone demands to be paid with a gift card, that’s a scam.",
    "1 This figure is based on reports from January 2018 through September 2020, exluding reports that do not specify a payment method."
  ],
  "sources": []
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2021/02/romance-scams-take-record-dollars-2020",
  "scraped_at": "2025-11-15T20:48:45.956517",
  "title": "Romance scams take record dollars in 2020",
  "published_date": "2021-02-10",
  "full_text": "They say love hurts. With romance scams that’s doubly true – hearts are broken and wallets are emptied. For three years running, people have reported losing more money on romance scams than on any other fraud type identified in Sentinel. 1  In 2020, reported losses to romance scams reached a record $304 million, up about 50% from 2019. For an individual, that meant a median dollar loss of $2,500. From 2016 to 2020, reported total dollar losses increased more than fourfold, and the number of reports nearly tripled. 2 It is reasonable to wonder: what happened in 2020 to make these dollars losses continue to spike? An obvious reason may be the pandemic limiting our ability to meet in person. But outside the pandemic, the share of people who have ever used an online dating site or app has also been rising. 3  And romance scammers are primed to take advantage. Scammers fabricate attractive online profiles to draw people in, often lifting pictures from the web and using made up names. Some go a step further and assume the identities of real people. Once they make online contact, they make up reasons not to meet in person. The pandemic has both made that easier and inspired new twists to their stories, with many people reporting that their so-called suitor claimed to be unable to travel because of the pandemic. Some scammers have reportedly even canceled first date plans due to a supposed positive COVID-19 test. While many people report losing money on romance scams that start on dating apps, even more say they were targeted on social media. 4  These social media users aren’t always looking for love, and report that the scam often starts with an unexpected friend request or message. Sooner or later, these scammers always ask for money. They might say it’s for a phone card to keep chatting. Or they might claim it’s for a medical emergency, with COVID-19 often sprinkled into their tales of woe. The stories are endless, and can create a sense of urgency that pushes people to send money over and over again. What many of the largest reported dollar losses have in common is that people believe their new partner has actually sent  them  a large sum of money. Scammers claim to have sent money for a cooked-up reason, and then have a detailed story about why the money needs to be sent back to them or on to someone else. People think they’re helping someone they care about, but they may actually be laundering stolen funds. In fact, many reported that the money they received and forwarded on turned out to be stolen unemployment benefits. In 2020, reports of gift cards being used to send money to romance scammers increased by nearly 70%. Gift cards, along with wire transfers, are the most frequently reported payment methods for romance scams. 5  People said they mailed the gift cards or gave the card’s PIN number to the scammer. The median amount people sent romance scammers in 2020 using any method of payment was $2,500, more than ten times the median loss across all other fraud types. 6 Reports of money lost on romance scams increased for every age group in 2020. People ages 20 to 29 saw the most striking increase, with the number of reports more than doubling since 2019. People ages 40 to 69 were once again the most likely to report losing money to romance scams. 7  And people 70 and older reported the highest individual median losses at $9,475. 8 So how can you play it safe while looking for love online? Here are some tips to help you steer clear of scammers: Help stop scammers by reporting suspicious profiles or messages to the dating app or social media platform. Then, tell the FTC at  ReportFraud.ftc.gov .     1 The analysis is based on self-reported data from consumers that is stored in the FTC’s Consumer Sentinel Database. It is not a survey that measures prevalence of this particular scam. This analysis excludes fraud reports classified as “Other misc.”   2 Losses sustained in these scams are reported by consumers but not independently verified. These figures and figures throughout this Spotlight are based on reports to the FTC's Consumer Sentinel Network that were classified as romance scams, excluding reports provided by the Internet Crimes Complaint Center (IC3). IC3 reports submitted prior to 2020 were unavailable at the time of publication, so these reports were excluded to ensure greater consistency in reporting trends over time. .   3 According to the Pew Research Center, the “share of Americans who have used these platforms – as well as the share who have found a spouse or partner through them – has risen over time.” See Monica Anderson, Emily A. Vogels, and Erica Turner, Pew Research Center, The Virtues and Downsides of Online Dating (Feb. 2020, Rev. Jan. 2021), at 3, available at https://www.pewresearch.org/internet/2020/02/06/the-virtues-and-downsides-of-online-dating/.    4 This finding is based on keyword analysis of 2020 Consumer Sentinel Reports classified as a romance scams and indicating a dollar loss. Of these, 2,276 reports mentioned the dating apps Ashley Madison, BLK, Bumble, Chispa, Coffee Meets Bagel, eharmony, EliteSingles, FriendFinder, Grindr, Hinge, Match, OkCupid, OurTime, Plenty of Fish, Seeking Arrangement, SilverSingles, Tinder, WooPlus, or Zoosk. Another 5,924 mentioned Facebook or Instagram. Reports that mentioned one of the specified dating apps and also Facebook or Instagram were excluded from the Facebook or Instagram figure. Because these numbers have not been normalized based on the number of users, they should not be understood as an indication that an individual user of Facebook or Instagram is more likely to encounter a romance scam as compared to users of these dating apps.   5 Wire transfer refers to payments made by wire transfer services such as MoneyGram and Western Union. Gift cards include reload cards (e.g., MoneyPak)..   6 Median loss calculations are based on reports indicating a monetary loss of $1 to $999,999. Reports provided by MoneyGram, Western Union, and Green Dot are excluded for this calculation as these data contributors report each transaction separately, which typically affects calculation of an individual’s median loss. The median individual reported loss for all frauds in 2020, excluding romance scams, was $240.   7 In 2020, 62% of romance scam reports included in this Spotlight included age information. This age comparison is normalized based on the number of loss reports per million population by age during this period. Population numbers were obtained from the U.S. Census Bureau Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States (June 2020).   8 See endnote 6.",
  "summary": "They say love hurts. With romance scams that’s doubly true – hearts are broken and wallets are emptied.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u50873/romance_scam_2020.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u50873/romance_scam_2020.png",
      "path": "full/7288050980d7aeb52bfd0cb3082b2ba96ffde036.jpg",
      "checksum": "243ce5e30318a81f6ed1b62b9acf025a",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Never send money or gifts to someone you haven’t met in person – even if they send you money first.",
    "Talk to someone you trust about this new love interest. It can be easy to miss things that don’t add up. So pay attention if your friends or family are concerned.",
    "Take it slowly. Ask questions and look for inconsistent answers.",
    "Try a reverse-image search of the profile pictures. If they’re associated with another name or with details that don’t match up, it’s a scam.",
    "Learn more at  ftc.gov/romancescams ."
  ],
  "sources": [
    {
      "index": 1,
      "text": "Never send money or gifts to someone you haven’t met in person – even if they send you money first.",
      "links": []
    },
    {
      "index": 2,
      "text": "Talk to someone you trust about this new love interest. It can be easy to miss things that don’t add up. So pay attention if your friends or family are concerned.",
      "links": []
    },
    {
      "index": 3,
      "text": "Take it slowly. Ask questions and look for inconsistent answers.",
      "links": []
    },
    {
      "index": 4,
      "text": "Try a reverse-image search of the profile pictures. If they’re associated with another name or with details that don’t match up, it’s a scam.",
      "links": []
    },
    {
      "index": 5,
      "text": "Learn more at  ftc.gov/romancescams .",
      "links": [
        "https://www.ftc.gov/romancescams"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2021/05/cryptocurrency-buzz-drives-record-investment-scam-losses",
  "scraped_at": "2025-11-15T20:48:47.388238",
  "title": "Cryptocurrency buzz drives record investment scam losses",
  "published_date": "2021-05-17",
  "full_text": "Investing in cryptocurrency means taking on risks, but getting scammed shouldn’t be one of them. Reports to the FTC’s Consumer Sentinel 1  suggest scammers are cashing in on the buzz around cryptocurrency and luring people into bogus investment opportunities in record numbers. Since October 2020, reports have skyrocketed, with nearly 7,000 people reporting losses of more than $80 million on these scams. 2  Their reported median loss? $1,900. Compared to the same period a year earlier, that’s about twelve times the number of reports and nearly 1,000% more in reported losses. 3 Some say there’s a Wild West vibe to the crypto culture, and an element of mystery too. Cryptocurrency enthusiasts congregate online to chat about their shared passion. And with bitcoin’s value soaring in recent months, new investors may be eager  to get in on the action. All of this plays right into the hands of scammers. They blend into the scene with claims that can seem plausible because cryptocurrency is unknown territory for many people. Online, people may appear to be friendly and willing to share their “tips.” But that can also be part of the ruse to get people to invest in their scheme. In fact, some of these schemes are based on referral chains, and work by bringing in people who then recruit new “investors.” Many people have reported being lured to websites that look like opportunities for investing in or mining cryptocurrencies, but are bogus. They often offer several investment tiers – the more you put in, the bigger the supposed return. Sites use fake testimonials and cryptocurrency jargon to appear credible, but promises of enormous, guaranteed returns are simply lies. These websites may even make it look like your investment is growing. But people report that, when they try to withdraw supposed profits, they are told to send even more crypto – and end up getting nothing back. Then, there are “giveaway scams,” supposedly sponsored by celebrities or other known figures in the cryptocurrency space, that promise to immediately multiply the cryptocurrency you send. But, people report that they discovered later that they’d simply sent their crypto directly to a scammer’s wallet. For example, people have reported sending more than $2 million in cryptocurrency to Elon Musk impersonators over just the past six months. Scammers even use online dating to draw people into cryptocurrency investment scams. Many people have reported believing they were in a long-distance relationship when their new love started chatting about a hot cryptocurrency opportunity, which they then acted on. About 20% of the money people reported losing through romance scams since October 2020 was sent in cryptocurrency, and many of these reports were from people who said they thought they were investing. 4 Since October 2020, people ages 20 to 49 were over five times more likely to report losing money on cryptocurrency investment scams than older age groups. 5  The numbers are especially striking for people in their 20s and 30s: this group reported losing far more money on investment scams than on any other type of fraud, 6  and more than half of their reported investment scam losses were in cryptocurrency. 7  In contrast, people 50 and older were far less likely to report losing money on cryptocurrency investment scams. But when this group did lose money on these scams, their reported individual losses were higher, with a median reported loss of $3,250. To be clear, while investment scams top the list as the most lucrative way to obtain cryptocurrency, scammers will use whatever story works to get people to send crypto. That often involves impersonating a government authority or a well-known business. For example, many people have told the FTC they loaded cash into Bitcoin ATM machines to pay imposters claiming to be from the Social Security Administration. Others reported losing money to scammers posing as Coinbase, a well-known cryptocurrency exchange. In fact, 14% of reported losses to imposters of all types are now in cryptocurrency. 8 Here are some things to know to play it safe(er) when it comes to cryptocurrency: To learn more about cryptocurrency scams, visit  ftc.gov/cryptocurrency . If you spot a scam, report it to the FTC at  ReportFraud.ftc.gov .     1 This Spotlight is based on reports from consumers to the FTC or to any Consumer Sentinel Network data contributor.   2 This figure is based on 6,792 cryptocurrency investment scam reports submitted from October 1, 2020 through March 31, 2021. Cryptocurrency investment scam reports here and throughout this Spotlight are defined as reports categorized as investment related fraud that indicate cryptocurrency as the payment method. The investment related fraud category includes the following fraud subcategories: art, gems and rare coin investments, investment seminars and advice, stocks and commodity futures trading, and miscellaneous investments. About 92% of cryptocurrency investment scam reports from October 1, 2020 through March 31, 2021 are classified as miscellaneous investments.   3 From October 1 2019 through March 31, 2020, people submitted 570 cryptocurrency investment scam reports indicating $7.5 million in total losses.   4 This figure is based reports submitted from October 1, 2020 through March 31, 2021 that were classified as romance scams. Reports that did not specify a payment method are excluded. Of these, 1,147 reports totaling $35 million in reported losses indicated cryptocurrency as the payment method. These reports are distinct from reports classified as investment related fraud, with no overlap between the two.   5 About 86% of cryptocurrency investment related fraud reports submitted from October 1, 2020 through March 31, 2021 included age information. This age comparison is normalized based on the number of loss reports per million population by age during this period. Population numbers were obtained from the U.S. Census Bureau Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States (June 2020).   6 This ranking is based on a comparison of Sentinel fraud subcategories. From October 1, 2020 through March 31, 2021, consumers ages 20-39 reported $114 million in total losses on frauds classified as miscellaneous investments. Excluding unspecified reports, the subcategory with second highest reported losses by this age group was online shopping with $64 million in reported losses. These figures are not limited to reports indicating cryptocurrency as the payment method.   7 This figure is based on reports submitted from October 1, 2020 through March 31, 2021 that were categorized as investment related fraud and indicated a consumer age of range of 20 to 39. Reports that did not specify a payment method are excluded. Of these, 3,581 reports totaling $35 million in reported losses indicated cryptocurrency as the payment method.   8 This figure is based on reports from October 1, 2020 through March 31, 2021 that were categorized as imposter scams. Reports that did not specify a payment method are excluded. Of these, 3,494 reports totaling $64 million in reported losses indicated cryptocurrency as the payment method. The imposter scams category includes the following fraud subcategories: business imposters, family and friend imposters, government imposters, romance scams, and tech support scams.",
  "summary": "Investing in cryptocurrency means taking on risks, but getting scammed shouldn’t be one of them.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u52513/cryptocurrency-may-2021.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u52513/cryptocurrency-may-2021.png",
      "path": "full/7acf0c31cf7a7b08526e0a8b56ef8439effe3587.jpg",
      "checksum": "c4252d5dcb5a223824043aa9a6929df4",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Promises of guaranteed huge returns or claims that your cryptocurrency will be multiplied are always scams.",
    "The cryptocurrency itself  is  the investment. You make money if you’re lucky enough to sell it for more than you paid. Period. Don’t trust people who say they know a better way.",
    "If a caller, love interest, organization, or anyone else insists on cryptocurrency, you can bet it’s a scam."
  ],
  "sources": [
    {
      "index": 1,
      "text": "Promises of guaranteed huge returns or claims that your cryptocurrency will be multiplied are always scams.",
      "links": []
    },
    {
      "index": 2,
      "text": "The cryptocurrency itself  is  the investment. You make money if you’re lucky enough to sell it for more than you paid. Period. Don’t trust people who say they know a better way.",
      "links": []
    },
    {
      "index": 3,
      "text": "If a caller, love interest, organization, or anyone else insists on cryptocurrency, you can bet it’s a scam.",
      "links": []
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2021/10/amazon-tops-list-impersonated-businesses",
  "scraped_at": "2025-11-15T20:48:48.881024",
  "title": "Amazon tops list of impersonated businesses",
  "published_date": "2021-10-20",
  "full_text": "Scammers impersonate all sorts of businesses, but reports to the FTC’s Consumer Sentinel point to Amazon as a runaway favorite for scammers. From July 2020 through June 2021, about one in three people who reported a business impersonator said the scammer claimed to be Amazon. Reports about Amazon impersonators increased more than fivefold during this period. 1  About 96,000 people reported being targeted, and nearly 6,000 said they lost money. Reported losses totaled more than $27 million. The reported median individual loss: $1,000. These impersonators get your attention with messages to call about suspicious activity or unauthorized purchases on your Amazon account. When you call the number, a phony Amazon representative tricks you into giving them remote access to your computer or phone to supposedly fix the problem and give you a refund. But then—whoops—a couple of extra zeros are keyed in and too much money is (supposedly) refunded. They tell you to return the difference. In fact, some people have reported that the “representative” even begged for help, saying Amazon would fire them if the money wasn’t returned. To make their lies about refunding that so-called overpayment more believable, scammers have reportedly accessed people’s online banking. They move money from one account to another—say, from savings to checking. Then, when people see a large deposit in their checking account, they think it’s the refund, but it’s all fake. If they send money, as requested, they end up sending their own (very real) money. In another twist, scammers tell people to buy gift cards and send pictures of the numbers on the back. The scammers may call these numbers “blocking codes” or “security codes,” and explain that sharing them can block the hackers who—supposedly—took over the Amazon account in question. But the only thing those numbers are good for is getting (or stealing) the money on the card. After people send pictures of the gift cards, they often report getting texts confirming a supposed account credit in the amount of each gift card purchase. That’s just another trick scammers use to get their targets to buy more cards. Another common hook are text messages that say you’ve won a raffle for a free product from Amazon. People who click the link to claim their free prize then have to enter credit card information to pay for “shipping.” Before long, they see charges they never agreed to. Most people who report these scams say the scammer contacted  them . 2  But some people have reported finding bogus phone numbers when searching online for the number to call Amazon about a  real  issue. Of course, the scammers who answer calls to those phone numbers are happy to “help.” The data suggest that Amazon impersonation scams may be disproportionately harming older adults. Over the past year, people ages 60 and up were over four times more likely than younger people to report losing money to an Amazon impersonator. 3  Older adults also reported losing  more  money—their median reported loss was $1,500, compared to $814 for people under age 60. After Amazon, Apple is the second most frequently reported company, but it’s a distant second. Apple impersonators reportedly tell people their iCloud account has been compromised or that they’ve been chosen to get a free iPad. Sound familiar? Scammers change names but often use the same lies again and again. 4 Here are ways to avoid some common tricks business impersonators use: To learn more about how to spot, avoid, and report scams—and how to recover money if you’ve paid a scammer—visit  ftc.gov/scams . If you spot a scam, report it to the FTC at  ReportFraud.ftc.gov .     1 Amazon impersonator scam reports increased from 1,794 reports in July 2020 to 9,796 in June 2021. Amazon impersonator scams are defined here and throughout this Spotlight as reports from all sources to the FTC’s Consumer Sentinel Network that are categorized as business imposter scams and name Amazon as the impersonated company.   2 About 70% of Amazon impersonator scams reported from July 2020 through June 2021 identified a phone call as the method of contact, followed by text (15%), and email (8%). These percentages exclude reports that did not specify a method of contact.   3 This age comparison is normalized based on the number of loss reports per million population by age during this period. Reports from consumers under age 18 are excluded. Population numbers were obtained from the U.S. Census Bureau Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States (June 2020).   4 Prior to the increase in reports of Amazon impersonators, Social Security Administration impersonation scams were the most frequently reported imposter scam. From July 2020 through June 2021, reports about Social Security Administration impersonators totaled 80,797. The number of reports about Social Security Administration impersonators declined from 7,441 in July 2020 to 4,166 in June 2021. For more information, see the April 2019 Consumer Protection Data Spotlight, “Growing Wave of Social Security imposters Overtakes IRS Scam,” located at  ftc.gov/spotlight .",
  "summary": "Scammers impersonate all sorts of businesses, but reports to the FTC’s Consumer Sentinel point to Amazon as a runaway favorite for scammers.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/system/files/attachments/blog_posts/Amazon%20tops%20list%20of%20impersonated%20businesses/amazon-spotlight.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/system/files/attachments/blog_posts/Amazon%20tops%20list%20of%20impersonated%20businesses/amazon-spotlight.png",
      "path": "full/bf2e6a0bdd5f0271891caa1b48e3d9bc28453274.jpg",
      "checksum": "cae6acff1908c96557d9349beb81a366",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Never call phone numbers given in unexpected calls, texts, emails, or messages on social media. And don’t click any links. Those are scams.",
    "If you’re worried, check it out. Go directly to the company’s website to find out how to reach them. Don’t trust the phone numbers or links that come up in search results.",
    "Never give anyone remote access to your devices unless  you  contacted the company first (using its real number). If someone tells you to give remote access to get a refund, it’s a scam.",
    "Never pay by gift card. Nobody legit will ever require you to. And never send pictures of gift cards. If someone tells you they need the numbers on the back of a gift card, it’s a scam.",
    "Talk about it. If you’re getting these messages, so are people you know. Help them avoid the scam by sharing what you know."
  ],
  "sources": [
    {
      "index": 1,
      "text": "Never call phone numbers given in unexpected calls, texts, emails, or messages on social media. And don’t click any links. Those are scams.",
      "links": []
    },
    {
      "index": 2,
      "text": "If you’re worried, check it out. Go directly to the company’s website to find out how to reach them. Don’t trust the phone numbers or links that come up in search results.",
      "links": []
    },
    {
      "index": 3,
      "text": "Never give anyone remote access to your devices unless  you  contacted the company first (using its real number). If someone tells you to give remote access to get a refund, it’s a scam.",
      "links": []
    },
    {
      "index": 4,
      "text": "Never pay by gift card. Nobody legit will ever require you to. And never send pictures of gift cards. If someone tells you they need the numbers on the back of a gift card, it’s a scam.",
      "links": []
    },
    {
      "index": 5,
      "text": "Talk about it. If you’re getting these messages, so are people you know. Help them avoid the scam by sharing what you know.",
      "links": []
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2021/12/scammers-prefer-gift-cards-not-just-any-card-will-do",
  "scraped_at": "2025-11-15T20:48:49.955658",
  "title": "Scammers prefer gift cards, but not just any card will do",
  "published_date": "2021-12-08",
  "full_text": "Gift cards are an easy way to give. Reports to the FTC’s Consumer Sentinel show they’re also an easy way to take. About one in four people who report losing money to fraud say it happened when a scammer tricked them into giving the numbers on the back of a gift card. 1  Gift cards are far more frequently reported than any other payment method for fraud, 2  and the numbers have reached staggering new highs compared to past years. 3  In the first nine months of 2021 alone, nearly 40,000 people reported $148 million stolen using gift cards. And because the vast majority of frauds are not reported to the government, this reflects only a fraction of the harm these scams cause. 4 Scammers favor gift cards because they are easy for people to find and buy, and they have fewer protections for buyers compared to some other payment options. Scammers can get quick cash, the transaction is largely irreversible, and they can remain anonymous. According to reports received by the FTC, scams demanding gift cards most often start with a phone call from someone impersonating a well-known business or government authority. 5  Many people report that a scammer posing as Amazon or Apple told them to send pictures of the numbers on gift cards to fix a supposed security problem with their account. Sometimes they call those numbers “security codes.” But the only thing the numbers are good for is taking the money on the card. Other people report that a scammer claiming to be the Social Security Administration said their bank accounts would be frozen as part of an investigation. They’re told to buy gift cards to avoid arrest or to secure access to their money. Reports also show that scammers asking for gift cards pretend to be a love interest, employer, sweepstakes or lottery company, or family member in trouble. Whatever the story, reports show that scammers don’t settle for just any card – they tell people the specific gift card brands to buy. In the first nine months of 2021, over twice as much money was reported lost on Target gift cards than any other brand. Google Play gift cards were next, followed by Apple, eBay, and Walmart cards. Scammers also tell people where to buy the gift cards. In the first nine months of 2021, people who reported losing money buying gift cards mentioned Target stores more than other retailers. Reports suggest that Walmart, Best Buy, CVS, and Walgreens stores are also popular with scammers. Scammers use lots of tricks to avoid detection. People often say the scammer sent them to several store locations to make multiple purchases. Scammers tell people to stay on the phone with the scammer the entire time – a trick to make sure they don’t call anyone who might help. Scammers even coach people on what to say if a cashier asks questions; they don’t want anyone to stop the scam, and they know store employees are often the only people who can help. Both the number of reported gift card scams and total losses have increased every year since 2018. 6  Losses are certainly up due to the higher number of reports, but individuals also report that they’re losing a lot more money. In fact, losses of $5,000 or more have increased from about 8% of reports in 2018 to about 14% in the first nine months of 2021. Over the same period, median reported losses increased from $700 to $1,000. Losses also vary by card brand. Target cards, for example, saw a median reported loss of $2,500 in the first nine months of the year, far higher than other frequently reported cards. 7  In addition, 30% of people who paid with a Target card said they lost $5,000 or more. 8 Whenever someone demands to be paid with a gift card, that’s a scam. It’s just that simple. Gift cards are for gifts, not for payments. If someone convinced you to give them the numbers on a gift card or send them a photo, hang onto the card and your receipt, and report it to the card issuer  right away . You’ll find contact information for some major gift cards at  ftc.gov/giftcards . Then report your experience to the FTC at  ReportFraud.ftc.gov . If you’re a retailer, or state or local law enforcement, and you’re interested in helping your customers and neighbors avoid gift card scams, visit  ftc.gov/StopGiftCardScams  to download, print, and share materials in your store and community.   1 From January 2018 through September 2021, 26.6% of consumers who reported losing money to fraud indicated the money was taken using gift cards or reload cards. From January 2021 through September 2021, this figure was 26.1%. Reports that do not indicate a method of payment are excluded. These figures and figures throughout this Spotlight are based on fraud reports directly to the FTC indicating gift card or reload card as the method of payment. Fraud reports classified as “online shopping” are excluded here and throughout this Spotlight because of the legitimate use of gift cards among large retailers.   2 Gift cards were the most frequently reported payment method for fraud in 2018, 2019, 2020, and in the first nine months of 2021. From January 2018 through September 2021, the second most frequently reported payment method was credit cards. From January 2021 through September 2021, the second most frequently reported payment method was cryptocurrency.    3 From January 2021 through September 2021, 39,263 reports indicating $147.8 million in gift card and reload card payments were submitted, compared to 36,682 reports indicating $115.1 million in reported gift card payments in all of 2020. Earlier year figures for comparison purposes are as follows: 35,323 reports with $100 million reported lost (2019), 32,084 reports with $70.6 million reported lost (2018).    4  See  Anderson, K. B.,  To Whom Do Victims of Mass-Market Consumer Fraud Complain?  at 1 (May 2021),  available at   https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3852323  (study showed only 4.8% of people who experienced mass-market consumer fraud complained to a Better Business Bureau (“BBB”) or a government entity).    5 From January 2021 through September 2021, 12,239 people reported losing $35.5 million to business impersonators using gift cards, and 7,844 people reported losing $39.6 million to government impersonators using gift cards. Excluding reports that did not indicate a contact method, a phone call was the method of contact in 37% of reports indicating gift cards as the method of payment, followed by email (18%) and social media (16%).   6 See footnote 3.   7 The median individual reported losses from January 1, 2021 through September 30, 2021 by gift card brand are as follows: Target ($2,500), Walmart ($1,380), Apple ($800), eBay ($600), and Google Play ($500). Median individual losses are based on the total loss reported by the consumer, which often includes more than one gift card purchase.    8 The percentage of reports from January 1, 2021 through September 30, 2021 indicating a loss of $5,000 or more by gift card brand are as follows: Target (30%), Apple (13%), Walmart (12%), Google Play (6%), and eBay (3%). Of the $148 million reported lost to gift card scams during this period, $111 million were losses reported by people who reported a loss of $5,000 or more.",
  "summary": "Gift cards are an easy way to give. Reports to the FTC’s Consumer Sentinel show they’re also an easy way to take.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u251195/gc_spotlight_scammer_process_300.jpg",
    "https://www.ftc.gov/sites/default/files/u251195/gc_spotlight_brand_losses_300.jpg",
    "https://www.ftc.gov/sites/default/files/u251195/gc_spotlight_reports_600.jpg"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u251195/gc_spotlight_scammer_process_300.jpg",
      "path": "full/e69def565480c767d8088d7d7b8c8d2bda329348.jpg",
      "checksum": "9f66759d05d63fc340ef54eebcab92a8",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/u251195/gc_spotlight_brand_losses_300.jpg",
      "path": "full/c1cb155d821d0ae7e592b27466fdacc44fabc8e5.jpg",
      "checksum": "f71321125ee486eb460b6c083e70b088",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/u251195/gc_spotlight_reports_600.jpg",
      "path": "full/7c676010dd0f5b30b5c2ec96768922766e6e17f3.jpg",
      "checksum": "898b3aa57f41d23521a138fde45ba0f2",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Competition Matters \n           \n   \n\n   First Research Published from Physician 6(b) Study \n\n \n    \n\n \n     \n           Tom Koch (Acting DAD, BE Office of Applied Research and Outreach) and Ted Rosenbaum (Acting BE Director) \n       \n \n\n\n \n     \n           June 17, 2025 \n \n       \n \n\n   \n      \n         \n \n  \n  \n   \n    \n              \n\n \n         \n               Technology Blog \n           \n   \n\n   The FTC Is on the Front Lines of Tech Innovation & Regulation \n\n \n    \n\n \n     \n           Stephanie T.",
    "Nguyen, Chief Technologist \n       \n \n\n\n \n     \n           January 17, 2025 \n \n       \n \n\n   \n      \n         \n \n  \n  \n   \n     Press Release \n   FTC Requires Divestiture of Oil Change Shops in Valvoline-Greenbriar Deal \n\n\n \n     \n           November 14, 2025 \n \n       \n \n\n   \n \n  \n  \n   \n\n                   \n           Dec 09 \n         \n             \n        \n   Office Hours for Librarians – December 9, 2025 \n\n \n     \n    \n                                               Tuesday, December 9, 2025 | 2:00PM \n -  3:00PM \n                     \n \n\n       \n       \n \n  \n  \n   \n    \n              \n\n \n         \n               Data Spotlight \n           \n   \n\n   Scammers prefer gift cards, but not just any card will do \n\n \n    \n\n \n             By \n         \n           Emma Fletcher \n       \n \n\n\n \n     \n           December 8, 2021 \n \n       \n \n \n   \n      \n         \n \n  \n  \n   \n    \n              \n\n \n     \n           Gift cards are an easy way to give.",
    "1  Gift cards are far more frequently reported than any other payment method for fraud, 2  and the numbers have reached staggering new highs compared to past years.",
    "3  In the first nine months of 2021 alone, nearly 40,000 people reported $148 million stolen using gift cards.",
    "4 \n\n Scammers favor gift cards because they are easy for people to find and buy, and they have fewer protections for buyers compared to some other payment options.",
    "5  Many people report that a scammer posing as Amazon or Apple told them to send pictures of the numbers on gift cards to fix a supposed security problem with their account.",
    "In the first nine months of 2021, over twice as much money was reported lost on Target gift cards than any other brand.",
    "In the first nine months of 2021, people who reported losing money buying gift cards mentioned Target stores more than other retailers.",
    "Both the number of reported gift card scams and total losses have increased every year since 2018.",
    "6  Losses are certainly up due to the higher number of reports, but individuals also report that they’re losing a lot more money."
  ],
  "sources": []
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2018/10/scammers-increasingly-demand-payment-gift-card",
  "scraped_at": "2025-11-15T20:48:52.100596",
  "title": "Scammers increasingly demand payment by gift card",
  "published_date": "2018-10-16",
  "full_text": "Through Consumer Sentinel we hear from people across the country about frauds they encounter in the marketplace. One thing we learn from these reports is how scammers want to be paid. People are telling us that they’re increasingly being told to pay with gift cards – specifically, by giving someone the PIN number off the back of a gift card. Often people are specifically asked for certain brands, like iTunes and Google Play cards. To understand this issue better, we looked at fraud reported directly to the FTC. To avoid skewing the results, we excluded reports about shop-at-home purchases – this Spotlight is not about the use of gift cards to purchase retail goods, but rather their use as a payment vehicle for scams. We found that from January through September of this year, gift cards and reload cards (like MoneyPak) were reported as a payment method in 26% of the fraud reports in which people told us how they paid, up from just 7% in 2015 – a 270% increase. Con artists favor these cards because they can get quick cash, the transaction is largely irreversible, and they can remain anonymous. People report that con artists direct them to buy gift or reload cards at well-known stores like Walmart, Target, Walgreens, and CVS. According to these reports, they demand some specific card brands. While these change over time, iTunes cards have been the top card brand by a wide margin since 2016. By contrast, Google Play cards were not reported in significant numbers until this year. 2018 Most Reported Gift and Reload Card Brands* \n * Percentages are based on the total number of fraud reports that identify a gift or reload card as a method of payment. Reports provided by data contributors, reports that do not specify a method of payment, and reports classified as “shop-at-home/catalog sales” are excluded. Card brands are identified through keyword analysis of the narratives provided in this subset of reports. Stepping back to look at all fraud reports available to the FTC from all sources, we found that losses where people reported using gift or reload cards reached $40 million in 2017, up from $20 million in 2015 and $27 million in 2016 ( Source: FTC Consumer Sentinel Network Data Book, 2016 and 2017).  Through September of this year, that number is already $53 million. And while individual fraud losses using these cards have held steady at a $500 median loss per incident, people report losing a lot more to some types of scams. ( Median loss calculations are based on all fraud reports in FTC’s Consumer Sentinel Network database that identify gift or reload card as a method of payment and include a dollar loss value of $1 to $999,999. )  Tech support scams  are a notable example. When people report paying for fraudulent tech support services with a gift or reload card, the median dollar loss is now $959, up nearly 60% from $600 in 2017. It’s not just tech support scams. When people report paying a fraudster with a gift or reload card, about four times out of five the fraud they report is an imposter scam – in fact, gift cards and reload cards are now the number one reported method of payment for imposter scams. These scammers pose as well-known businesses, family members, friends, or government agencies. They deploy various tactics to compel people to pay. They may pretend to be the IRS and tell people they cannot use other payment methods because of their delinquent tax status. They may even call iTunes cards “payment vouchers.” To avoid alerting store personnel, they often direct people to buy cards from several different stores, and they tell people not to talk to anyone about why they are buying the cards. Familiarity with these tactics and awareness of the prevalence of gift cards and reload cards as a method of payment for fraud may help people to recognize and avoid a wide range of scams. When someone demands to be paid with a gift card, that’s a scam. Payments to a fraudster made by gift card or reload card should be reported immediately to the card issuer. It may not be possible to stop funds from being withdrawn from the card, but it is important to alert companies to card fraud. Consumers should also report details of the incident to the FTC at  FTC.gov/complaint . To learn more, visit  FTC.gov/giftcards .",
  "summary": "Through Consumer Sentinel we hear from people across the country about frauds they encounter in the marketplace. One thing we learn from these reports is how scammers want to be paid. People are telling us that they’re increasingly being told to pay with gift cards – specifically, by giving someone the PIN number off the back of a gift card. Often people are specifically asked for certain brands, like iTunes and Google Play cards.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Money Transfers",
    "deceptive/misleading conduct",
    "Payments and Billing"
  ],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u46943/data-spotlight-stats-oct2018-update.png",
    "https://www.ftc.gov/sites/default/files/u269/graphic_top_5.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u46943/data-spotlight-stats-oct2018-update.png",
      "path": "full/3de679602dd47b64b83cba53ab8cce1638e6c1d9.jpg",
      "checksum": "3271f57d334f7301572ed0873bef807b",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/u269/graphic_top_5.png",
      "path": "full/c1c547e5df121397fb2a4af704670d98aabb9e8b.jpg",
      "checksum": "47a64d856667c3a96ee25c416d57ff41",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Money Transfers",
    "deceptive/misleading conduct",
    "Payments and Billing"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 2,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    },
    {
      "index": 3,
      "text": "Imposter",
      "links": [
        "https://www.ftc.gov/imposter"
      ]
    },
    {
      "index": 4,
      "text": "Money Transfers",
      "links": [
        "https://www.ftc.gov/money-transfers"
      ]
    },
    {
      "index": 5,
      "text": "deceptive/misleading conduct",
      "links": [
        "https://www.ftc.gov/terms/deceptivemisleading-conduct"
      ]
    },
    {
      "index": 6,
      "text": "Payments and Billing",
      "links": [
        "https://www.ftc.gov/business-guidance/credit-finance/payments-billing"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2018/12/new-twist-grandparent-scam-mail-cash",
  "scraped_at": "2025-11-15T20:48:52.965558",
  "title": "New twist to grandparent scam: mail cash",
  "published_date": "2018-12-03",
  "full_text": "In 2018, the Consumer Sentinel Network has seen a striking increase in the median dollar amount that people 70 and over are saying they lost to fraud. Digging into the data, we found some common stories with an unusual twist: people 70 and older report mailing huge amounts of cash to people who pretended to be their grandchildren. People 70 and over rarely report to the FTC that they paid a scammer with cash. But for one particular type of fraud – family and friend imposters – fully 25% of people 70 and over who reported to the FTC how they paid money told us they sent cash. 1   We call these family and friend imposter scams, but you may know them as the “grandparent scam” and with good reason. People 70 and over report that the scammer posed as a grandchild, usually a grandson, about 70% of the time. 2 People from all age groups reported median individual losses of about $2,000 to family and friend imposters – far higher than the median loss of $462 reported to us this year for all fraud types. 3  But the story is much worse for people 70 and over who sent cash – they reported median individual losses of $9,000. 4 When we looked at fraud reports from all age groups, and from all Sentinel data contributors, 5  we found that aggregate losses to family and friend imposters have increased. Losses over the past year reached $41 million, as compared to $26 million in the previous year. 6 Like many scams, these start with a phone call 7  using some common ploys. In about half of the reports of cash payments, people said the caller claimed to be in jail or other legal trouble. 8  About a third of these reports mentioned a so-called car accident (some mentioning texting or drinking while driving). 9  In both cases, the callers play on people’s emotions and sense of loyalty: they may be told they’re the only person trusted enough to call for help, and they’re often told not to tell anyone. These scammers are experts at impersonating people they’ve never even met. Car accident injuries, often broken noses, or uncontrolled sobbing explain away a voice that might not sound quite right. Scammers use personal details from social media sites to make their stories more believable. Or they may simply wait for their target to use a name – “Steve, is that you?” – and take the cue. According to reports, callers often give very specific instructions about how to send cash. Many people said they were told to divide the bills into envelopes and place them between the pages of a magazine. Then, according to reports, they were told to send them using various carriers, including UPS, FedEx, and the U.S. Postal Service. What can you do about these scams? Talk about them. Many people have gotten these calls, so help others know what to do to spot and avoid the scam: If you’ve mailed cash, report it right away to the Postal Service or whichever shipping company you used. Some people have been able to stop delivery by acting quickly and giving a tracking number. Also tell the FTC at  FTC.gov/complaint . Learn more about this and other imposter scams at  FTC.gov/imposters .  To explore Sentinel data, visit  FTC.gov/data .   Download in PDF format  (460.43 KB) 1 This figure is based on 2018 fraud reports submitted directly to the FTC that indicated a monetary loss and excludes reports that do not indicate a payment method. For comparison, in 2017 one in fourteen people 70 and over who reported to the FTC how they paid money told us they sent cash.  2 This figure was determined through keyword analysis of the narratives provided in the specified subset of reports. 3 This figure is based on reports submitted directly to the FTC in 2018 that indicated a monetary loss of $1 to $999,999. 4 This figure is based on reports submitted directly to the FTC in 2018 that indicated a monetary loss of $1 to $999,999 and excludes reports that do not indicate age. 5 The Consumer Sentinel Network includes reports filed directly with the FTC and with 42 Sentinel data contributors, including other government agencies, nonprofit organizations, and companies. 6 These figures are based on the 12-month periods ending October 31, 2018 and October 31, 2017. 7 Telephone is the method of contact specified in 58% of reports indicating a monetary loss submitted directly to the FTC classified as “imposter: family/friend” and 84% of the subset of these reports with a payment method of cash. These figures exclude reports that do not indicate a contact method. 8 This figure was determined through keyword analysis of the narratives provided in the specified subset of reports. 9 Ibid.",
  "summary": "In 2018, the Consumer Sentinel Network has seen a striking increase in the median dollar amount that people 70 and over are saying they lost to fraud.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Money Transfers"
  ],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u46943/graphic-nov-900.png",
    "https://www.ftc.gov/sites/default/files/u46943/graphic-nov-2018fraud-700.png",
    "https://www.ftc.gov/sites/all/themes/ftc/images/icons/application-pdf.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u46943/graphic-nov-900.png",
      "path": "full/f5f8cc61a7f1bb2bb901fef54bacf266865716f7.jpg",
      "checksum": "743f4e166f157fa0aae79cc0d757440e",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/u46943/graphic-nov-2018fraud-700.png",
      "path": "full/5968452a3f72a839cf7234c7492be4a3c02ff9ad.jpg",
      "checksum": "9d771a400bf17ceb7bd4c7f4c4f05beb",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/all/themes/ftc/images/icons/application-pdf.png",
      "path": "full/14de66e04365112f2cb25dc52242995b7e8f883d.jpg",
      "checksum": "25559cd537fc2937241213273bc70bf0",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Don’t act right away, no matter how dramatic the story is.",
    "Call that family member or friend, and make sure you use a phone number that you know is right. Or check it out with someone else in your circle, even if the caller told you to keep it a secret.",
    "Be careful about what you post on social media. If your personal details are public, someone can use them to defraud you  and  people who care about you.",
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Money Transfers"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Don’t act right away, no matter how dramatic the story is.",
      "links": []
    },
    {
      "index": 2,
      "text": "Call that family member or friend, and make sure you use a phone number that you know is right. Or check it out with someone else in your circle, even if the caller told you to keep it a secret.",
      "links": []
    },
    {
      "index": 3,
      "text": "Be careful about what you post on social media. If your personal details are public, someone can use them to defraud you  and  people who care about you.",
      "links": []
    },
    {
      "index": 4,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 5,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    },
    {
      "index": 6,
      "text": "Imposter",
      "links": [
        "https://www.ftc.gov/imposter"
      ]
    },
    {
      "index": 7,
      "text": "Money Transfers",
      "links": [
        "https://www.ftc.gov/money-transfers"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2019/02/romance-scams-rank-number-one-total-reported-losses",
  "scraped_at": "2025-11-15T20:49:11.130441",
  "title": "Romance scams rank number one on total reported losses",
  "published_date": "2019-02-12",
  "full_text": "People looking for romance are hoping to be swept off their feet, not caught up in a scam. But tens of thousands of reports in Consumer Sentinel show that a scam is what many people find. In 2018, Sentinel had more than 21,000 reports about romance scams, and people reported losing a total of $143 million – that’s more than any other consumer fraud type identified in Sentinel. 1  These reports are rising steadily. In 2015, by comparison, people filed 8,500 Sentinel reports with dollar losses of $33 million. Romance scammers lure people with phony online profiles, often lifting photos from the web to create attractive and convincing personas. They might make up names or assume the identities of real people. Reports indicate the scammers are active on dating apps, but also on social media sites that aren’t generally used for dating. For example, many people say the scam started with a Facebook message.  Once these fraudsters have people by the heartstrings, they say they need money, often for a medical emergency or some other misfortune. They often claim to be in the military and stationed abroad, which explains why they can’t meet in person. Pretending to need help with travel costs for a long-awaited visit is another common ruse. Scammers can reap large rewards for time spent courting their targets. The median individual loss to a romance scam reported in 2018 was $2,600, about seven times higher than the median loss across all other fraud types. 2  People often reported sending money repeatedly for one supposed crisis after another. People who said they were ages 40 to 69 reported losing money to romance scams at the highest rates – more than twice the rate of people in their 20s. 3  At the same time, people 70 and over reported the highest individual median losses at $10,000. 4 Among people who told us how they paid the scammer, the majority said they wired money. The next largest group said they sent money using gift and reload cards (like Moneypak), and reports of this type of payment increased in 2018. People said they mailed the cards or gave the PIN number on the back to the scammer. Con artists favor these payment methods because they can get quick cash, the transaction is largely irreversible, and they can remain anonymous. So what can singles do to play it safe while dating online? Here are some tips to help spot bogus suitors: Help stop these scammers by reporting suspicious profiles or messages to the dating or social media site. Then, tell the FTC at  FTC.gov/complaint .     1 Figures based on 21,368 reports submitted directly to FTC and by all Sentinel data contributors in 2018 that were classified as romance scams.     2 Median loss calculations are based on reports submitted in 2018 that indicated a monetary loss of $1 to $999,999. Reports provided by MoneyGram, Western Union, and Green Dot are excluded for this calculation as these data contributors report each transaction separately, which typically affects calculation of an individual’s median loss.     3 Reporting rates per million population by age calculated using population numbers obtained from the U.S. Census Bureau.  U.S. Census Bureau, Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States, States, Counties and Puerto Rico Commonwealth and Municipios  (June 2018).     4 Median loss calculations are based on reports submitted in 2018 that indicated a monetary loss of $1 to $999,999. Reports provided by MoneyGram, Western Union, and Green Dot are excluded as these data contributors report each transaction separately, which may affect the median loss.",
  "summary": "People looking for romance are hoping to be swept off their feet, not caught up in a scam. But tens of thousands of reports in Consumer Sentinel show that a scam is what many people find.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Online Dating"
  ],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u46943/data-spotlight-scam-feb2019.png",
    "https://www.ftc.gov/sites/default/files/u46943/data-spotlight-romance.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u46943/data-spotlight-scam-feb2019.png",
      "path": "full/c36130d47572f0c1d3e701b883fc9558c6fc5c1e.jpg",
      "checksum": "ef4dfae98ecde07aa25ae5dcd2abf439",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/u46943/data-spotlight-romance.png",
      "path": "full/b56ade18256ffa0605249b27c16e76cf63b02a1d.jpg",
      "checksum": "fcbeac1c628f41e333b040b7e4cd1000",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Never send money or gifts to a sweetheart you haven’t met in person.",
    "Talk to someone you trust about this new love interest. In the excitement about what feels like a new relationship, we can be blinded to things that don’t add up. Pay attention if your friends or family are concerned.",
    "Take it slowly. Ask questions and look for inconsistent answers. Try a reverse-image search of the profile pictures. If they’re associated with another name or with details that don’t match up, it’s a scam.",
    "Learn more at  ftc.gov/imposters .",
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Online Dating"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Never send money or gifts to a sweetheart you haven’t met in person.",
      "links": []
    },
    {
      "index": 2,
      "text": "Talk to someone you trust about this new love interest. In the excitement about what feels like a new relationship, we can be blinded to things that don’t add up. Pay attention if your friends or family are concerned.",
      "links": []
    },
    {
      "index": 3,
      "text": "Take it slowly. Ask questions and look for inconsistent answers. Try a reverse-image search of the profile pictures. If they’re associated with another name or with details that don’t match up, it’s a scam.",
      "links": []
    },
    {
      "index": 4,
      "text": "Learn more at  ftc.gov/imposters .",
      "links": [
        "https://www.ftc.gov/imposters"
      ]
    },
    {
      "index": 5,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 6,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    },
    {
      "index": 7,
      "text": "Imposter",
      "links": [
        "https://www.ftc.gov/imposter"
      ]
    },
    {
      "index": 8,
      "text": "Online Dating",
      "links": [
        "https://www.ftc.gov/online-dating"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2022/01/social-media-gold-mine-scammers-2021",
  "scraped_at": "2025-11-15T20:49:21.039106",
  "title": "Social media a gold mine for scammers in 2021",
  "published_date": "2022-01-25",
  "full_text": "Social media permeates the lives of many people – we use it to stay in touch, make new friends, shop, and have fun. But reports to the FTC show that social media is also increasingly where scammers go to con us. More than one in four people who reported losing money to fraud in 2021 said it started on social media with an ad, a post, or a message. [1]  In fact, the data suggest that social media was far more profitable to scammers in 2021 than  any other method  of reaching people. [2] More than 95,000 people reported about $770 million in losses to fraud initiated on social media platforms in 2021. [3]  Those losses account for about 25% of all reported losses to fraud in 2021 and represent a stunning eighteenfold increase over 2017 reported losses. Reports are up for every age group, but people 18 to 39 were more than twice as likely as older adults to report losing money to these scams in 2021. [4] For scammers, there’s a lot to like about social media. It’s a low-cost way to reach billions of people from anywhere in the world. It’s easy to manufacture a fake persona, or scammers can hack into an existing profile to get “friends” to con. There’s the ability to fine-tune their approach by studying the personal details people share on social media. In fact, scammers could easily use the tools available to advertisers on social media platforms to systematically target people with bogus ads based on personal details such as their age, interests, or past purchases. Reports make clear that social media is a tool for scammers in investment scams, particularly those involving bogus cryptocurrency investments — an area that has seen a massive surge in reports. [5]   More than half of people who reported losses to investment scams in 2021 said the scam started on social media. [6]  Reports to the FTC show scammers use social media platforms to promote bogus investment opportunities, and even to connect with people directly as supposed friends to encourage them to invest. People send money, often cryptocurrency, on promises of huge returns, but end up empty handed. [7] After investment scams, FTC data point to romance scams as the second most profitable fraud on social media. Losses to romance scams have climbed to record highs in recent years. More than a third of people who said they lost money to an online romance scam in 2021 said it began on Facebook or Instagram. [8]  These scams often start with a seemingly innocent friend request from a stranger, followed by sweet talk, and then, inevitably, a request for money. [9] While investment and romance scams top the list on dollars lost, the largest number of reports came from people who said they were scammed trying to buy something they saw marketed on social media.  [10]  In fact, 45% of reports of money lost to social media scams in 2021 were about online shopping. In nearly 70% of these reports, people said they placed an order, usually after seeing an ad, but never got the merchandise. Some reports even described ads that impersonated real online retailers that drove people to lookalike websites. When people identified a specific social media platform in their reports of undelivered goods, nearly 9 out of 10 named Facebook or Instagram. [11] Together, investment scams, romance scams, and online shopping fraud accounted for over 70% of reported losses to social media scams in 2021. But there are many other frauds on social media too, and new ones popping up all the time. Here are some ways to help you and your family stay safe on social media: To learn more about how to spot, avoid, and report scams—and how to recover money if you’ve paid a scammer—visit  ftc.gov/scams . If you spot a scam, report it to the FTC at  ReportFraud.ftc.gov .     [1] Excluding reports that did not specify a method of contact, 27% (94,541) of 349,177 2021 fraud reports to the FTC’s Consumer Sentinel Network indicating a dollar loss identified social media as the contact method. Reports provided by data contributors are excluded here and throughout this Spotlight because of differences in the collection of contact method information. This method of identifying reports indicating social media as the contact method differs from the method used in an October 2020 Data Spotlight titled “Scams Starting on Social Media Proliferate in Early 2020” because of enhancements to FTC’s collection of contact method information beginning in October 2020. Both methods show a significant increase in reports about fraud initiated on social media. [2] Excluding reports that did not indicate a contact method, the total amount reported lost to frauds indicating social media as the contact method in 2021 was $770 million (26%), followed by website or app at $554 million (19%), and phone call at $546 million (18%). Note that the 2021 median individual reported losses were highest on phone fraud at $1,110 compared to $468 on frauds indicating social media as the contact method. [3] Because the vast majority of frauds are not reported to the government, these numbers reflect just a small fraction of the public harm caused by frauds originating on social media.  See  Anderson, K. B.,  To Whom Do Victims of Mass-Market Consumer Fraud Complain?  at 1 (May 2021),  available at   https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3852323  (study showed only 4.8% of people who experienced mass-market consumer fraud complained to a Better Business Bureau or a government entity). [4] In 2021, adults ages 18-39 submitted fraud loss reports indicating social media as the contact method at a rate 2.4 times higher than adults 40 and over. About 92% (87,048 reports) of 2021 fraud loss reports indicating social media as the contact method included age information. This age comparison is normalized based on the number of loss reports per million population by age during this period. Population numbers were obtained from the U.S. Census Bureau Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States (June 2020). [5]  See  FTC Consumer Protection Data Spotlight,  Cryptocurrency buzz drives record investment scam losses  (May 17, 2021),  available at  https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2021/05/cryptocurrency-buzz-drives-record-investment-scam-losses . [6] Excluding reports that did not indicate a contact method, 54% of 2021 loss reports to fraud categorized as investment related identified social media as the contact method. The top platforms identified in these reports were Instagram (36%), Facebook (28%), WhatsApp (9%), and Telegram (7%). Reports that did not indicate a platform are excluded from these calculations. The median individual reported loss on investment related fraud originating on social media was $1,800 in 2021. [7]Excluding reports that did not indicate a payment method, cryptocurrency was indicated as the method of payment in 64% of 2021 investment related fraud reports that indicated social media as the method of contact, followed by payment app or service (13%), and bank transfer or payment at (9%). [8] This figure is based on 2021 loss reports directly to the FTC categorized as romance scams and where the consumer identified an online platform. Of these, the top platforms identified as the starting point for the scam were Facebook (23%) and Instagram (13%). [9] Excluding reports that did not indicate a payment method, the most frequently reported payment method for 2021 romance scam reports indicating social media as the method of contact were as follows: gift card or reload card (30%), cryptocurrency (18%), and payment app or service (15%). The 2021 median individual reported loss on romance scam reports indicating social media as the method of contact was $2,000. [10] Excluding reports that did not indicate a payment method, the most frequently reported payment methods for 2021 online shopping reports indicating social media as the method of contact were as follows: payment app or service (29%), debit card (28%), and credit card (24%). The 2021 median individual reported loss on online shopping reports indicating social media as the method of contact was $115. [11] Facebook was identified as the social media platform in 59% of these reports, and Instagram was identified in 27%.",
  "summary": "Social media permeates the lives of many people – we use it to stay in touch, make new friends, shop, and have fun.",
  "tags": [],
  "image_urls": [],
  "images": [],
  "relevant_data": [
    "Limit who can see your posts and information on social media. All platforms collect information about you from your activities on social media, but visit  your privacy settings  to set some restrictions.",
    "Check if you can opt out of targeted advertising. Some platforms let you do that.",
    "If you get a message from a friend about an opportunity or an urgent need for money, call them. Their account may have been hacked – especially if they ask you to pay by cryptocurrency, gift card, or wire transfer. That’s how scammers ask you to pay.",
    "If someone appears on your social media and rushes you to start a friendship or romance, slow down. Read about  romance scams . And never send money to someone you haven’t met in person.",
    "Before you buy,  check out the company . Search online for its name plus “scam” or “complaint.”"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Limit who can see your posts and information on social media. All platforms collect information about you from your activities on social media, but visit  your privacy settings  to set some restrictions.",
      "links": [
        "https://www.consumer.ftc.gov/articles/how-protect-your-privacy-apps"
      ]
    },
    {
      "index": 2,
      "text": "Check if you can opt out of targeted advertising. Some platforms let you do that.",
      "links": []
    },
    {
      "index": 3,
      "text": "If you get a message from a friend about an opportunity or an urgent need for money, call them. Their account may have been hacked – especially if they ask you to pay by cryptocurrency, gift card, or wire transfer. That’s how scammers ask you to pay.",
      "links": []
    },
    {
      "index": 4,
      "text": "If someone appears on your social media and rushes you to start a friendship or romance, slow down. Read about  romance scams . And never send money to someone you haven’t met in person.",
      "links": [
        "https://www.consumer.ftc.gov/articles/what-you-need-know-about-romance-scams"
      ]
    },
    {
      "index": 5,
      "text": "Before you buy,  check out the company . Search online for its name plus “scam” or “complaint.”",
      "links": [
        "https://www.consumer.ftc.gov/articles/0020-shopping-online"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2019/03/older-adults-hardest-hit-tech-support-scams",
  "scraped_at": "2025-11-15T20:49:12.158435",
  "title": "Older adults hardest hit by tech support scams",
  "published_date": "2019-03-07",
  "full_text": "If the mere thought of your computer being hacked frightens you, you’re not alone. And tech support scammers know how to exploit that fear to their own advantage. They work to scare you into believing your computer is compromised and then offer to “fix” the problem – for a fee. The FTC’s Consumer Sentinel Network got nearly 143,000 reports about tech support scams in 2018. 1 These scams usually start with a phone call or a pop-up warning of a computer problem that gives a number to call. People tell us the scammers often claim to be Microsoft or Apple – they may even spoof caller ID to make it look like one of these companies really is calling. In another twist, they get people who actually do need computer help to call them by posting phony customer support numbers for well-known companies online. These scammers convince people to hand over remote access to their computer and then make a big show of “troubleshooting.” They may open system folders or run scans that seem to show evidence of a problem. Then they ask for money for supposed repairs and things like bogus service contracts. In 2018, people reported losing $55 million to these scams. And while many people did not lose any money, those who did reported losing hundreds: the median individual reported loss was $400. Credit cards were the top method of payment people said they used, and that’s good news – credit card companies can reverse fraudulent charges. But many others said the scammer convinced them to pay by giving the PIN numbers on the back of gift cards, often iTunes or Google Play cards. For most in this group, the money is simply gone. Tech support scams stand out for the disproportionate harm they may be causing older adults. While Sentinel data tells us that people 60 and older are both great at reporting fraud and  less likely  than younger people to report losing money to many types of fraud, 2  they are far  more likely   to report a loss to tech support scams. In 2018, people 60 and over were about five times more likely to report losing money to these scams than younger people. 3  In fact, over the past four years, older adults filed more reports of a loss on tech support scams than they did in any other Sentinel fraud category. 4  The reported median individual loss to tech support scams for older adults was $500 last year – 25% higher than the median individual loss reported by younger people. 5 But money isn’t the only thing people lose on this scam. By allowing scammers remote access to their computer, people hand over control. Scammers can then readily steal sensitive information or install spyware – a form of malware that lets them quietly gather information. People have even been persuaded to log into their bank accounts, often on the pretext of depositing a refund, allowing the scammer to move funds remotely. Here are some things you can do to avoid these scams: If you’ve been scammed, change any passwords you shared and scan your computer for malware. If you gave your credit card number, tell the credit card company. Check your statement and contact your credit card company to reverse the charges for bogus services. If you later get a call about a supposed refund, you can bet that’s part two of the same scam – hang up. Report tech support scams to the FTC at  ftc.gov/complaint . To learn more, visit  ftc.gov/techsupportscams .   1 Figure based on 142,904 reports to Sentinel in 2018 that were classified as tech support scams. 105,676 of these reports were provided by Microsoft Corporation’s Cybercrime Center. 2 For age comparisons of other Sentinel fraud types, see Figure 4 of  Protecting Older Consumers 2017 - 2018. A Report of the Federal Trade Commission . 3 Figures based on the number of 2018 tech support scam reports that indicated a monetary loss ($1 - $999,999) per million population by age. People who said they were 20 – 59 filed loss reports at a rate of 21.5 reports per million people in this age group, while people who said they were 60 and over filed 104.2 loss reports per million people in this age group. Population numbers obtained from the U.S. Census Bureau:  U.S. Census Bureau, Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States, States, Counties and Puerto Rico Commonwealth and Municipios (June 2018) . In 2018, 31,043 tech support scam reports to Sentinel included usable age information. 4 This statement is based on fraud reports filed from 2015 to 2018 by people who indicated an age of 60 and over and who indicated a monetary loss. 5 Median loss calculations are based on reports submitted in 2018 that indicated a monetary loss by people who said they were 60 and over as compared to people who said they were 20 to 59. Not all reports to Sentinel indicate age.",
  "summary": "If the mere thought of your computer being hacked frightens you, you’re not alone. And tech support scammers know how to exploit that fear to their own advantage.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Technology"
  ],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u46943/tech-support-01.png",
    "https://www.ftc.gov/sites/default/files/u46943/tech-support-02.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u46943/tech-support-01.png",
      "path": "full/bf2d5617f30d0bf5548b2507859ebfb51d79813d.jpg",
      "checksum": "8dbccd5e7d388f1dde35b4a58d7b9905",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/u46943/tech-support-02.png",
      "path": "full/d0bf4428a689d32cb90a42aa491652658354c2a7.jpg",
      "checksum": "6e53e1c457fd5c9db23be29b7c3d9b51",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Do not click any links or call a number that pops up on your screen warning of a computer problem.",
    "Hang up on unexpected calls from anyone who claims to be tech support.",
    "Don’t believe your caller ID – it can be easily spoofed.",
    "Never give control of your computer or share passwords with anyone who contacts you.",
    "Keep your security software up to date.",
    "If you need help, contact a computer technician that you trust. Don’t just rely on an online search.",
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Technology"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Do not click any links or call a number that pops up on your screen warning of a computer problem.",
      "links": []
    },
    {
      "index": 2,
      "text": "Hang up on unexpected calls from anyone who claims to be tech support.",
      "links": []
    },
    {
      "index": 3,
      "text": "Don’t believe your caller ID – it can be easily spoofed.",
      "links": []
    },
    {
      "index": 4,
      "text": "Never give control of your computer or share passwords with anyone who contacts you.",
      "links": []
    },
    {
      "index": 5,
      "text": "Keep your security software up to date.",
      "links": []
    },
    {
      "index": 6,
      "text": "If you need help, contact a computer technician that you trust. Don’t just rely on an online search.",
      "links": []
    },
    {
      "index": 7,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 8,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    },
    {
      "index": 9,
      "text": "Imposter",
      "links": [
        "https://www.ftc.gov/imposter"
      ]
    },
    {
      "index": 10,
      "text": "Technology",
      "links": [
        "https://www.ftc.gov/industry/technology"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2019/04/growing-wave-social-security-imposters-overtakes-irs-scam",
  "scraped_at": "2025-11-15T20:49:13.834347",
  "title": "Growing wave of Social Security imposters overtakes IRS scam",
  "published_date": "2019-04-12",
  "full_text": "Claiming to be a government authority is a tried and true way that scammers trick people into sending money. Among the most common government imposters have been scammers pretending to be the IRS – until now. In the past few months, the FTC’s Consumer Sentinel Network database has seen Social Security Administration (SSA) imposter reports skyrocket while reports of IRS imposters have declined sharply. In the shady world of government imposters, the SSA scam may be the new IRS scam. SSA imposters tell you your Social Security number has been suspended because of suspicious activity, or because it’s been involved in a crime. They ask you to confirm your Social Security number, or they may say you need to withdraw money from the bank and to store it on gift cards or in other unusual ways for “safekeeping.” You may be told your accounts will be seized or frozen if you don’t act quickly. These scammers often use robocalls to reach people, and the message can be hard to ignore. You may be told to “press 1” to speak to a government “support representative” for help reactivating your Social Security number. They also use caller ID spoofing to make it look like the Social Security Administration really is calling. With such trickery, these scammers are good at convincing people to give up their Social Security numbers and other personal information. As the graphic shows, people reported the IRS scam (in blue) in huge numbers for many years, but the new SSA scam (in orange) is trending in the same direction – with a vengeance. People filed over 76,000 reports about Social Security imposters in the past 12 months, with reported losses of $19 million. 1  Compare that to the $17 million in reported losses to the IRS scam in its peak year. 2  About 36,000 reports and $6.7 million in reported losses are from the past two months alone. Just 3.4% of people who report the Social Security scam tell us they lost money. 3  Most people we hear from are just worried because they believe a scammer has their Social Security number. But when people do lose money, they lose a lot: the median individual reported loss last year was $1,500, four times higher than the median individual loss for all frauds. 4  All age groups are reporting this scam in high numbers, with older and younger adults filing loss reports at similar rates. 5 People report sending money in unconventional ways. Most often, people say they gave the scammer the PIN numbers on the back of gift cards. Virtual currencies like Bitcoin come in a distant second to gift cards: people say they withdrew money and fed cash into Bitcoin ATMs. With both methods, the scammer gets quick cash while staying anonymous, and the money people thought they were keeping safe is simply gone. Here are some tips to deal with these imposters: Report government imposter scams to the FTC at  FTC.gov/complaint . To learn more, visit  ftc.gov/imposters .   1 FTC was unable to collect reports directly from the public during the government shutdown. Reports collected during that period were provided by Sentinel data contributors.   2 From October 1, 2015 to September 30, 2016, about 140,000 reports of IRS imposter scams were filed and collectively indicated $17 million of loss.   3 For comparison, 2.8% of IRS scam reports filed from January 2014 through March 2019 indicated a loss. In 2018, 25% of all fraud reports indicated a loss.   4 Median loss calculations are based on reports submitted in 2018 that indicated a monetary loss ($1 - $999,999). The median reported individual loss to all frauds was $371 in 2018.   5 Age comparison based on the number of Social Security imposter reports that indicated a monetary loss per million population by age. People who said they were 20 – 59 filed loss reports at a rate of 8.9 reports per million people in this age group, while people who said they were 60 and over filed 10.0 loss reports per million people in this age group. Population numbers obtained from the U.S. Census Bureau:  U.S. Census Bureau, Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States, States, Counties and Puerto Rico Commonwealth and Municipios (June 2018) . Not all reports include usable age information.",
  "summary": "Claiming to be a government authority is a tried and true way that scammers trick people into sending money.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter"
  ],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u46943/visual-ssa-scam-click2open.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u46943/visual-ssa-scam-click2open.png",
      "path": "full/063e4e7b839ee2d8d3c2d41af4b3bf06a5f4d19e.jpg",
      "checksum": "3b1bd6436a63ccb40a95430f17803439",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Do not trust caller ID.  Scam calls may show up on caller ID as the Social Security Administration and look like the agency’s real number.",
    "Don’t give the caller your Social Security number or other personal information.  If you already did, visit  IdentityTheft.gov/SSA  to find out what steps you can take to protect your credit and your identity.",
    "Check with the real Social Security Administration.  The SSA will not contact you out of the blue. But you can call them directly at 1-800-772-1213 to find out if SSA is really trying to reach you and why.",
    "Talk about it.  People recognize the IRS scam, but many are getting caught off guard by these new imposters. You can help by telling people that the SSA scam is a new version of the IRS scam.",
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Do not trust caller ID.  Scam calls may show up on caller ID as the Social Security Administration and look like the agency’s real number.",
      "links": []
    },
    {
      "index": 2,
      "text": "Don’t give the caller your Social Security number or other personal information.  If you already did, visit  IdentityTheft.gov/SSA  to find out what steps you can take to protect your credit and your identity.",
      "links": [
        "https://www.IdentityTheft.gov/SSA"
      ]
    },
    {
      "index": 3,
      "text": "Check with the real Social Security Administration.  The SSA will not contact you out of the blue. But you can call them directly at 1-800-772-1213 to find out if SSA is really trying to reach you and why.",
      "links": [],
      "statistics": [
        "1213",
        "800",
        "1",
        "772"
      ]
    },
    {
      "index": 4,
      "text": "Talk about it.  People recognize the IRS scam, but many are getting caught off guard by these new imposters. You can help by telling people that the SSA scam is a new version of the IRS scam.",
      "links": []
    },
    {
      "index": 5,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 6,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    },
    {
      "index": 7,
      "text": "Imposter",
      "links": [
        "https://www.ftc.gov/imposter"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2019/07/government-imposter-scams-top-list-reported-frauds",
  "scraped_at": "2025-11-15T20:49:14.769421",
  "title": "Government imposter scams top the list of reported frauds",
  "published_date": "2019-07-01",
  "full_text": "Pretending to be someone people trust is what scammers do. They may claim to be a well-known company or a beloved family member, but data from the FTC’s Consumer Sentinel Network suggest that pretending to be the government may be scammers’ favorite ruse. Since 2014, the FTC has gotten nearly 1.3 million reports about government imposters. That’s far more than any other type of fraud reported in the same timeframe. This spring, monthly reports of government imposter scams reached the highest levels we have on record. 1 The vast majority of people who report this type of scam say it started with a phone call, 2  and these callers have their mind games down pat. Government impersonators can create a sense of urgent fear, telling you to send money right away or provide your social security number to avoid arrest or some other trouble. Or they can play the good guy, promising to help you get some free benefit like a grant or prize, or even a back brace. Scammers like to make the situation so immediate that you can’t stop to check it out. These scams can be extremely lucrative. Reported losses to government imposter scams add up to more than $450 million since 2014. Only 6% of people who report government imposters say they lost money. 3  But when people do lose money, it’s a lot: the median individual reported loss is $960. 4  People ages 20 to 59 report losing money to these scams at higher rates than people 60 and over, but median individual reported losses increase with age. People 80 and over report a median loss of $2,700. 5 Gift cards are now the payment method of choice for these scammers. Most people who tell us they lost money to a government imposter say they gave the scammer the PIN number on the back of gift cards like Google Play or iTunes cards. 6  Wire transfers come in a distant second to gift cards as a payment method. But with both methods, the scammer gets quick cash while staying anonymous, and the money is simply gone. The top government imposters reported so far in 2019 have both familiar and new faces. The FTC reported recently about the dramatic surge in Social Security imposters, but IRS imposters are still hanging on in the top five. Scammers use “bureau” or “administration” in their name to make their government grant offers sound official, and use generic names like “sheriff’s office” to suggest a hefty law enforcement presence. Government imposters will adapt quickly to find new ways to get your money. Lots of government agencies have been impersonated, including the FTC. The scammer’s pitch is even more convincing when they fake the number on your caller ID so it shows the name or phone number of a real government agency. It’s illegal to fake the number on caller ID, but scammers know it helps convince people that the caller really is with the government. So what can you do to protect yourself against imposters when their stories keep changing? Report government imposter scams to the FTC at  FTC.gov/complaint . To learn more, visit  ftc.gov/imposters . Want to explore the data? Visit the new  interactive infographic  on government imposters.   1 People reported about 41,400, 39,600, and 46,600 government imposter scams to Sentinel in March, April, and May 2019 respectively. Prior to March 2019, the highest monthly reporting levels for government imposter scams on record were in September 2016 with about 38,400 reports filed.   2 From January 2018 through May 2019, 96% of people who reported a government imposter scam and specified a contact method said they were contacted by telephone.   3 Figure based on reports to Sentinel from January 2018 through May 2019 that were classified as government imposter scams.   4 Median loss calculations are based on government imposter reports submitted to Sentinel from January 2018 through May 2019 that indicated a monetary loss ($1 - $999,999).   5 Age comparison and median loss figure based on government imposter reports in from January 2014 through May 2019 that indicated a monetary loss. People who said they were 20 – 59 filed loss reports at a rate of 269 reports per million people in this age group, while people who said they were 60 and over filed 211 loss reports per million people in this age group. Population numbers obtained from the U.S. Census Bureau: U.S. Census Bureau, Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States, States, Counties and Puerto Rico Commonwealth and Municipios (June 2018). Not all reports include usable age information.   6 Gift\\reload cards were identified as the payment method for 58% of government imposter reports to Sentinel from January 2018 through May 2019 that indicated a payment method. Wire transfers were identified as the payment method for 13% of these reports.",
  "summary": "Pretending to be someone people trust is what scammers do.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter"
  ],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u52513/gov-imposter-scams-stories.png",
    "https://www.ftc.gov/sites/default/files/u52513/bar-chart-top-gov-imposter-scams.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u52513/gov-imposter-scams-stories.png",
      "path": "full/6b64e7bafd786f581f4766516bea43335796aee3.jpg",
      "checksum": "ed7be9ad8c9421912b54ed441d428332",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/u52513/bar-chart-top-gov-imposter-scams.png",
      "path": "full/a56405160f39406438376f66bf59ac8b2b891744.jpg",
      "checksum": "8577ea9bc1b0e1da85d182aa4ad69186",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Be suspicious of any call from a government agency asking for money or information.  Government agencies don’t call you with threats, or promises of – or demands for – money. Scammers do.",
    "Don’t trust caller ID – it can be faked . Even if it might look like a real call, don’t trust it.",
    "Never pay with a gift card or wire transfer.  If someone tells you to pay this way, it’s a scam.",
    "Check with the real agency.  Look up their number. Call them to find out if they’re trying to reach you – and why.",
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Be suspicious of any call from a government agency asking for money or information.  Government agencies don’t call you with threats, or promises of – or demands for – money. Scammers do.",
      "links": []
    },
    {
      "index": 2,
      "text": "Don’t trust caller ID – it can be faked . Even if it might look like a real call, don’t trust it.",
      "links": []
    },
    {
      "index": 3,
      "text": "Never pay with a gift card or wire transfer.  If someone tells you to pay this way, it’s a scam.",
      "links": []
    },
    {
      "index": 4,
      "text": "Check with the real agency.  Look up their number. Call them to find out if they’re trying to reach you – and why.",
      "links": []
    },
    {
      "index": 5,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 6,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    },
    {
      "index": 7,
      "text": "Imposter",
      "links": [
        "https://www.ftc.gov/imposter"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2019/10/not-what-you-think-millennials-fraud",
  "scraped_at": "2025-11-15T20:49:16.050897",
  "title": "Not what you think: Millennials and fraud",
  "published_date": "2019-10-01",
  "full_text": "People sometimes think scams mostly affect older adults, but reports to Consumer Sentinel tell a different story. People in their 20s and 30s, a cohort that roughly tracks the so-called Millennial generation, are 25%  more likely  to report losing money to fraud than people 40 and over generally, 1  and  much more likely  to report a loss on certain types of fraud. The top five frauds to which Millennials report losing money are online shopping frauds, business imposters, government imposters, fake check scams, and romance scams. People 40+ report those same scams, too, but the data suggest that, with the exception of romance scams, Millennials may be less likely to avoid them or may encounter them more often. For example, Millennials are twice as likely as people 40+ to report losing money while shopping online. Frequently, shopping-related reports to the FTC are about items that are never delivered or aren’t as advertised. Millennials are also more likely than their older counterparts to report fraud losses on scams that promise to fix debt-related problems or that promise money through jobs, investments, or business opportunities. 2  Millennials are 93% more likely than people 40+ to report losing money to fake check scams, which also often look like a way to earn money. 3 The likelihood of losing money is just part of the story— how much  people lose is also important. The median individual amount Millennials report losing to fraud is $400, much lower than what people 40+ report. 4  But those individual losses add up: Millennials have reported losing nearly $450 million to fraud in just the past two years. 5  Of that, online shopping accounted for $71 million in reported losses, and government imposter scams were close behind, with $61 million in reported losses. The likelihood of reporting a loss varies by how people are first contacted by a scammer, and there are age differences here, too. While phone calls are the top contact method reported for people of all ages, Millennials report losing money to phone scams at slightly lower rates than people 40+. But Millennials are  more likely  to report losing money to frauds that start in other ways 6  —most notably, Millennials are 77% more likely than their older counterparts to say they lost money to a scam that started with an email. The most important takeaway: fraud affects  every  generation. If someone has contacted you to demand money or your personal information – stop. Talk to someone you trust. And check out the request. Here are some resources to help you navigate some of the scams hitting Millennials the hardest: If you spot a scam, report it to the FTC at  ftc.gov/complaint .   1 From September 2017 through August 2019, people 20–39 filed fraud reports indicating that they lost money (“loss reports”) at a rate 25% higher than than people 40 and over. 47% of Sentinel fraud reports included usable age information during this period. The age comparison is normalized, based on the number of loss reports per million population by age. Population numbers used in this Spotlight were obtained from the U.S. Census Bureau  Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States, States, Counties and Puerto Rico Commonwealth and Municipios  (June 2019).   2 Based on a comparison of reporting rates by people 20–39 and people 40 and over on the following fraud types from September 2017 through August 2019 (percent difference in loss reporting rates as compared to people 40 and over noted in parentheses): advance-fee loans\\credit arrangers (+34%), credit repair (+85%), debt management\\credit counseling (+86%), business opportunities\\work-at-home-plans (+42%), employment agencies\\job counseling\\overseas work (+380%), investment (+48%), and multi-level marketing\\pyramids\\chain letters (+90%). Age comparisons based on loss reports per million population by age   3 People are often told to deposit a check and keep some of the money as payment for a phony offer to earn income. Using various ruses, scammers then direct people to send some of the money back to them. For example, people may believe they are buying equipment or supplies for an internship or sales job. Many people have reported using some of the money to send wire transfers or buy gift cards at a store they believed they were evaluating as a secret shopper. Once the bank identifies the check as a fake, the consumer may be responsible for any funds sent. These scams take advantage of unfamiliarity with how banks process checks and the terminology used. Banks are required to make check deposit funds available quickly, and consumer may even be told the check has “cleared.” However, it can take weeks for banks to identify a check as fraudulent.   4 Median individual reported losses increase with age as follows: $500 for people 40-59, $640 for people 60-79. and $1,700 for people 80 and older. Median loss calculations are based on reports from September 2017 through August 2019 that indicated a monetary loss ($1 - $999,999).   5 Figure is based on reports to Sentinel from September 2017 through August 2019 from people 20–39.   6 The rank order of contact methods by loss reports filed by Millennials from September 2017 through August 2019 is as follows (percent difference in loss reporting rates as compared to people 40 and over noted in parentheses): phone (-5%), online (+14%), e-mail (+77%), consumer initiated contact (+23%), mail (+12%). Age comparisons are normalized, based on loss reports per million population by age.",
  "summary": "People sometimes think scams mostly affect older adults, but reports to Consumer Sentinel tell a different story. People in their 20s and 30s, a cohort that roughly tracks the so-called Millennial generation, are 25% more likely to report losing money to fraud than people 40 and over generally, and much more likely to report a loss on certain types of fraud.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u52513/spotlight-millennials-percentage-fraud.jpg",
    "https://www.ftc.gov/sites/default/files/u52513/spotlight-millennials-top-10-frauds.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u52513/spotlight-millennials-percentage-fraud.jpg",
      "path": "full/6065ea45d08578f4ed6c827c60b0c114f770eccf.jpg",
      "checksum": "80298a0ebaa8b4d6665942ef0929b690",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/u52513/spotlight-millennials-top-10-frauds.png",
      "path": "full/034dc090697e29ff7e8977f7a4ed4aaba9a84ffc.jpg",
      "checksum": "d2520f80fb4d37780952ba0eee8f75e9",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Tips for online shopping:  ftc.gov/onlineshopping",
    "Watch out for bogus income offers:  ftc.gov/jobs",
    "Protect yourself from debt and credit scams:  ftc.gov/debt"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Tips for online shopping:  ftc.gov/onlineshopping",
      "links": [
        "https://www.ftc.gov/onlineshopping"
      ]
    },
    {
      "index": 2,
      "text": "Watch out for bogus income offers:  ftc.gov/jobs",
      "links": [
        "https://www.ftc.gov/jobs"
      ]
    },
    {
      "index": 3,
      "text": "Protect yourself from debt and credit scams:  ftc.gov/debt",
      "links": [
        "https://www.ftc.gov/debt"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2020/02/dont-bank-cleared-check",
  "scraped_at": "2025-11-15T20:49:17.241856",
  "title": "Don’t bank on a “cleared” check",
  "published_date": "2020-02-10",
  "full_text": "Fake check scams take advantage of what we don’t know about how banks handle check deposits. Scammers  do  know, and they trick people into sending them money before the bank spots the fake. The FTC’s Consumer Sentinel Network database shows that people reported more than 27,000 fake check scams in 2019, with reported losses topping $28 million dollars. 1  And the data suggest that fake check scams disproportionately harm young adults – especially people in their twenties. Scammers have various fake check storylines, and job and income opportunities top the list. Last year, about 50% of people who reported a fake check scam to the FTC said they were offered a job or some other way to earn money. 2  Nearly half of those were fake mystery shopping jobs, and many others were phony  car - wrap advertising opportunities.  In another 18% of the reports, people said they got a fake check as payment for something they were selling online. Fake check scams have two telltale elements – a check to deposit and a plausible explanation for why you can’t keep all the money. The checks come in many varieties: a business or personal check, a cashier’s check, money order, or even a check delivered electronically. The ploys to get you to send back some of the money also vary. Potential mystery shoppers are told to use some of the money to “evaluate” a retailer by buying gift cards or money orders, or by wiring money through MoneyGram or Western Union. (The scammers make sure to get the gift card PIN number from you, or delay you from canceling the money order.) People who apply online and are hired as “personal assistants” are told to use the money to buy gift cards for the new boss (and, again, to give up those PIN numbers). People interested in car wrap advertising are told to send money to supposed decal installers – who never materialize. People buying something from you online “accidently” send a check for too much and ask you to refund the balance. These scams work because, once you deposit a check, you quickly see the funds in your account. Parting with some of that money then feels risk-free. But scammers know that while the law says banks have to make funds from deposited checks available within a day or two, it can take weeks to uncover a fake. Some scammers even tell you to wait for the check to “clear” before sending money. When it ultimately bounces, the bank can take back the amount of the fake check, leaving you on the hook for the money. The number of reports made directly to the FTC about fake checks are on the rise – they’re up by about 65% over 2015 levels. 3  What’s more, no other fraud among last year’s top ten most frequently reported scams came close to the individual losses people reported on fake check scam last year. 4  The median individual loss reported on fake checks was $1,988, compared to $320 on all fraud types combined. And people reported that the scammers often asked to be paid by gift card or wire transfer. Con artists favor these payment methods because once the money is sent, it is almost impossible to trace or reverse. Younger people are hit especially hard. Last year, people in their twenties were more than twice as likely as people 30 and older to report losing money on a fake check scam. 5  Many college students have reported that the scam started with a message sent to their student email address. Scammers make these emails seem official – they may even impersonate the school’s career services office. To avoid these scams, here are a few things to know: To learn more about what to do if you have already sent money to a scammer, visit ftc.gov/fakechecks. If you paid a scammer with a gift card, visit  ftc.gov/giftcards . If you spot a scam, report it to the FTC at  ftc.gov/complaint .   1 These figures are based on fraud reports classified as “counterfeit check scams” submitted in 2019 by any person or data contributor and stored in the Consumer Sentinel Network database.     2 Figures pertaining to the nature of the scammers’ stories are based on keyword analysis of the narratives provided in 2019 reports classified as “counterfeit check scams.”    3 This figure is based on 14,017 reports about fake check scams submitted directly to the FTC in 2015 as compared to 23,064 such reports in 2019. In 2016, 2017, and 2018 respectively, 15,840, 17,870 , and 18,463 such reports were submitted. These figures exclude data contributors to ensure the data reflects consistency in complaint capture over time.    4 Of the nearly 60 Sentinel fraud subcategories, fake check scams ranked ninth based on the total number of fraud reports submitted in 2019. Of the ten most frequently reported frauds, government imposter scams had the second highest reported median individual loss of $1,100. Reports classified as unspecified are excluded.   5 In 2019, 77% of fake check reports included usable age information. This age comparison is normalized based on the number of loss reports per million population by age. Population numbers were obtained from the U.S. Census Bureau Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States, States, Counties and Puerto Rico Commonwealth and Municipios (June 2019).",
  "summary": "Fake check scams take advantage of what we don’t know about how banks handle check deposits. Scammers do know, and they trick people into sending them money before the bank spots the fake. The FTC’s Consumer Sentinel Network database shows that people reported more than 27,000 fake check scams in 2019, with reported losses topping $28 million dollars. And the data suggest that fake check scams disproportionately harm young adults – especially people in their twenties.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u251195/fake_check_stories.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u251195/fake_check_stories.png",
      "path": "full/f5cfbed228572d96d64b4fde96c71986ae6b6663.jpg",
      "checksum": "c2126c34016716fdfa5fdb183f54d10b",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "If someone sends you a check and tells you to send money – whether by wiring money or buying gift cards – you can bet it’s a scam.",
    "Even if you see the money in your account, the bank can still take it back if the check later bounces. If you don’t know the person who wrote the check, don’t send money. Period.",
    "If you’re selling online, never accept a check for more than your asking price."
  ],
  "sources": [
    {
      "index": 1,
      "text": "If someone sends you a check and tells you to send money – whether by wiring money or buying gift cards – you can bet it’s a scam.",
      "links": []
    },
    {
      "index": 2,
      "text": "Even if you see the money in your account, the bank can still take it back if the check later bounces. If you don’t know the person who wrote the check, don’t send money. Period.",
      "links": []
    },
    {
      "index": 3,
      "text": "If you’re selling online, never accept a check for more than your asking price.",
      "links": []
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2020/05/identity-theft-causing-outsized-harm-our-troops",
  "scraped_at": "2025-11-15T20:49:18.843410",
  "title": "Identity theft causing outsized harm to our troops",
  "published_date": "2020-05-21",
  "full_text": "Our men and women in uniform take on unique hardships when they choose to serve. Identity theft shouldn’t be one of them. But the FTC’s Consumer Sentinel Network database shows that active duty servicemembers file reports about many forms of identity theft – and related problems with debt collection and credit reporting – at much higher rates than non-military consumers. Five years of identity theft data reported to the FTC on IdentityTheft.gov show that active duty servicemembers are 76% more likely than other adults to report that an identity thief misused an existing account, such as a bank account or credit card. 1  Most notably, they are nearly  three times  as likely to report that someone used a debit card or some other electronic means to take money directly from their bank account. 2  This finding suggests that servicemembers are experiencing highly disproportionate instances of theft from their financial accounts compared to the general population. That’s not all. They also are 22% more likely to report that their stolen information was misused to open a  new  account, 3  especially new credit card accounts. Recovering from identity theft can be a challenge in the best of circumstances, and it can take months or even years to untangle the mess when not caught quickly. But keeping a close eye on credit reports, which can help someone spot early warning signs, can be difficult for active duty troops. They report that creditors often send notices to old addresses, which may delay their ability to act on warning signs, such as bills from unknown creditors or unexpected credit card charges. 4  In fact, one-fifth of active duty servicemember reports indicate that they have already experienced two or more types of identity theft. However, many active duty servicemembers report that they have taken protective steps. Nearly half tell us they have reviewed their credit reports and 40% say they have a fraud alert in place when they report identity theft. What the data doesn’t tell us is how many took these steps before learning of a problem. Securing personal information may also present special challenges for active duty troops. Nearly 14% of their reports indicate that a family member or someone they know stole their identity, compared to just 7% of other adults who report. Reports suggest that this often happens when people have access to important documents or financial records left behind during military assignments. When identity theft happens, credit problems and collection calls often follow. Based on data provided by the Consumer Financial Protection Bureau, active duty servicemembers report problems with debt collectors and credit bureaus at more than twice the rate of other adults. 5  More than 40% of the debt collection reports indicate that the debt was caused by identity theft, and more than 40% of the reports about credit bureaus indicate that information on a credit report belongs to someone else. 6  And many say they worry that these problems could put their security clearances and their military careers at risk. Frequent moves and overseas service are also associated with other kinds of credit reporting complaints. Military personnel have protections that can allow them to cancel housing contracts, vehicle leases, and some other accounts before they ship out, but reports show this doesn’t always go smoothly. Often, people learn of a problem only when they spot a ding (or worse) on their credit reports. MilitaryConsumer.gov  is a resource for servicemembers, veterans, and their families to avoid scams and manage money. Here are a few things you can do now to protect yourself: Go to  IdentityTheft.gov  to report and get a plan to recover from identity theft.   1 This and other identity theft figures are based on 2015-2019 identity theft reports to the FTC classified as the following theft subtypes: checking\\savings account – existing, credit card – existing, debit cards, electronic funds transfer, or ACH, ITAC - account takeover, landline telephone – existing accounts, mobile telephone – existing accounts, utilities – existing accounts. The comparison of active duty servicemembers with other adults is normalized based on the number of reports per million population. The population figure for other adults was obtained from the U.S. Census Bureau 2018 American Community Survey 1-year demographic and housing estimates. The population figure for active duty servicemembers was obtained from the Defense Manpower Data Center December 31, 2019 file titled Number of Military and DoD Appropriated Fund (APF) Civilian Personnel Permanently Assigned. The FTC received 13,467 identity theft reports from 2015 through 2019 that indicated the consumer was an active duty servicemember.   2 This figure is based on 2015-2019 identity theft reports to the FTC classified as debit cards, electronic funds transfer, or ACH. The comparison of active duty servicemembers to other adults is normalized based on the number of reports per million population as described in endnote 1.   3 This figure is based on 2015-2019 identity theft reports to the FTC classified as the following theft subtypes: checking\\savings account - new, credit card – new, ITAC – new account, landline telephone – new accounts, mobile telephone – new accounts, utilities – new accounts. The comparison of active duty servicemembers to other adults is normalized based on the number of reports per million population as described in endnote 1.   4 About 12% of the 1,842 2018 and 2019 debt collection complaints from active duty servicemembers in Sentinel that were contributed by the Consumer Financial Protection Bureau (CFPB) cited problems receiving proper written notification of a debt, often due to relocation.   5 This figure is based on 2018 and 2019 reports in Sentinel contributed by the CFPB and classified as credit bureaus, creditor debt collection, and third party debt collection. The comparison of active duty servicemembers to other adults is normalized based on the number of reports per million population as described in endnote 1.   6 This figure is based on 2018 and 2019 reports in Sentinel contributed by the CFPB and classified as creditor debt collection, third party debt collection, and credit bureaus. Nearly 43% of the 1,842 reports from active duty service members about debt collection indicate the debt is the result of identity theft, and nearly 43% of the 3,301 reports about credit bureaus indicate the information belongs to someone else.",
  "summary": "Our men and women in uniform take on unique hardships when they choose to serve. Identity theft shouldn’t be one of them.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u269/military_may2020.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u269/military_may2020.png",
      "path": "full/34b3d614a948a219fbe15086e9475d091b1b1030.jpg",
      "checksum": "78ce7d9db00c38f7f79205a5eee9fa59",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Check your bank account regularly. Report a lost or stolen debit card or unauthorized transactions immediately. Your bank may have a service to alert you to every transaction or transactions over a certain amount.",
    "To prevent someone from misusing your debit or credit cards, many banks will let you temporarily lock or freeze your card online or through their mobile app. You can quickly and easily unlock the card at any time the same way.",
    "Don’t give out authentication information – including PIN numbers or verification codes – to anyone who calls, emails, or texts you. If you didn’t initiate the contact, you can bet it’s a scam.",
    "Sign up for  free credit monitoring , available to active duty servicemembers, to get notifications of activity on your credit reports.",
    "Put an  active duty alert  on your credit reports if you’re deploying. Alerts last a year (you can renew) and require creditors to take steps to verify your identity before granting credit in your name.",
    "Even if you’re not deploying, consider placing a fraud alert if you suspect identity theft. Consider a credit freeze if you want a bit more protection and if it fits your situation.",
    "Know your rights under the Servicemembers Civil Relief Act. Talk with a  Personal Financial Manager or your military legal assistance office  to learn more."
  ],
  "sources": [
    {
      "index": 1,
      "text": "Check your bank account regularly. Report a lost or stolen debit card or unauthorized transactions immediately. Your bank may have a service to alert you to every transaction or transactions over a certain amount.",
      "links": []
    },
    {
      "index": 2,
      "text": "To prevent someone from misusing your debit or credit cards, many banks will let you temporarily lock or freeze your card online or through their mobile app. You can quickly and easily unlock the card at any time the same way.",
      "links": []
    },
    {
      "index": 3,
      "text": "Don’t give out authentication information – including PIN numbers or verification codes – to anyone who calls, emails, or texts you. If you didn’t initiate the contact, you can bet it’s a scam.",
      "links": []
    },
    {
      "index": 4,
      "text": "Sign up for  free credit monitoring , available to active duty servicemembers, to get notifications of activity on your credit reports.",
      "links": [
        "https://www.consumer.ftc.gov/blog/2019/10/free-electronic-credit-monitoring-coming-soon-military"
      ]
    },
    {
      "index": 5,
      "text": "Put an  active duty alert  on your credit reports if you’re deploying. Alerts last a year (you can renew) and require creditors to take steps to verify your identity before granting credit in your name.",
      "links": [
        "https://www.consumer.ftc.gov/articles/0273-active-duty-alerts"
      ]
    },
    {
      "index": 6,
      "text": "Even if you’re not deploying, consider placing a fraud alert if you suspect identity theft. Consider a credit freeze if you want a bit more protection and if it fits your situation.",
      "links": []
    },
    {
      "index": 7,
      "text": "Know your rights under the Servicemembers Civil Relief Act. Talk with a  Personal Financial Manager or your military legal assistance office  to learn more.",
      "links": [
        "https://www.militaryconsumer.gov/spend/getting-started/personal-financial-managers-pfms-other-financial-counselors-and-legal-help"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2020/07/pandemic-purchases-lead-record-reports-unreceived-goods",
  "scraped_at": "2025-11-15T20:49:19.932878",
  "title": "Pandemic purchases lead to record reports of unreceived goods",
  "published_date": "2020-07-01",
  "full_text": "Online shopping has been a lifeline for many people hunkering down to help reduce the spread of COVID-19. But as online orders have increased, so too have reports to the FTC’s Consumer Sentinel Network about sellers failing to deliver on promises — or just failing to deliver, period. During April and May of 2020, more people reported problems with online shopping than in any other months on record. More than half said they never got the items they ordered. 1 With COVID-19, scammers quickly launched opportunistic websites. People reported online shops claiming to sell the things they desperately needed but could not get. By the week of April 5, reports of unreceived merchandise were almost on par with previous peak numbers from the December 2019 holiday shopping season. 2  In the following weeks, as people scoured the internet for scarce items, reports of unreceived orders continued to climb. Reports in May were nearly double the December 2019 numbers. 3  Of course, many sellers have had legitimate supply chain problems, but these reports are about no-show orders, not just shipping delays. People reported unreceived orders of facemasks in April and May far more often than any other item, and undelivered sanitizer, toilet paper, thermometers, and gloves were also reported. 4  But that’s not the whole story. Reports show that scammers shirked their promises to shoppers on everything from clothes to electronics – and even puppies, which people had bought online. Scammers often used pandemic-related pretexts for supposed shipping delays, sometimes – in the puppy scam – even charging extra fees for COVID-related “regulations.” Then they just stopped responding. This stalled people who might otherwise have posted negative reviews. Reports show that scammers have honed their ability to put up remarkably polished looking websites in recent years. They’ve learned to work social media and online advertising to their advantage, and to peel off negative reviews by simply disappearing and popping back up under a new name. This is a global problem, since the web gives scammers cheap access to consumers worldwide. 5 While pandemic purchases have fueled record numbers, reports about online shopping were common even before the pandemic. People reported losing nearly $420 million dollars since 2015, 6  and the numbers have been on the rise for years. The FTC took in more than 86,000 online shopping reports in 2019, which is a 38% increase over 2018, and the largest annual increase in recent years. 7  Most troubling is the rise in the number of people who report that they simply did not get the items they ordered. That number increased more than fourfold from 2015 to 2019. 8 There is some good news. Credit cards are the top way people reported paying for their online shopping, including unreceived orders. What’s good about this is that people can dispute credit card charges if they don’t get what they paid for. Here are some tips to avoid being left empty-handed when you shop online: To learn more about Coronavirus-related scams, visit  ftc.gov/coronavirus/scams . For more about online shopping, including how to dispute credit card charges, go to  ftc.gov/onlineshopping . And if you spot a scam, report it to the FTC at  ftc.gov/complaint .   1 This monthly comparison is based on online shopping reports directly to the FTC from January 2015 through May 2020. Consumers submitted 15,492 such reports in April 2020 with 7,545 indicating that items were not received, and 18,946 such reports in May 2020 with 10,827 indicating that items were not received.   2 This comparison is based on 1,519 online shopping reports about unreceived merchandise directly to the FTC the week of December 15, 2019 and 1,486 such reports the week of April 5, 2020.   3 This comparison is based on 5,487 online shopping reports about unreceived merchandise directly to the FTC in December 2019 and 10,827 such reports in May 2020.   4 This finding is based on keyword analysis of the narratives provided in online shopping reports directly to the FTC in April and May of 2020 indicating that items were not received. Of the 18,370 such reports, 1,328 mentioned facemasks.   5 Online shopping is the top category reported to econsumer.gov, a partnership of more than 35 consumer protection agencies around the world. Many of these reports are from consumers located outside the United States. Consumers filed 56,040 online reports with eConsumer from January 2015 through May 2020.   6 This figure is based on online shopping reports directly to the FTC from January 2015 through May 2020.   7 This increase is calculated based on 86,472 and 62,606 online shopping reports directly to the FTC in 2019 and 2018 respectively. In earlier years, 34,249 (2015), 40,319 (2016), and 53,373 (2017) such reports were made.   8 This increase is calculated based on 9,435 and 38,701 online shopping reports directly to the FTC in 2015 and 2019 respectively indicating items were not received. In the intervening years 12,080 (2016), 18,852 (2017), and 26,710 (2018) such reports were made.",
  "summary": "Online shopping has been a lifeline for many people hunkering down to help reduce the spread of COVID-19.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/u52513/reports-unreceived-weekly-online-shopping-orders.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/u52513/reports-unreceived-weekly-online-shopping-orders.png",
      "path": "full/961e9d8bf2ea98281bdf39dc821789753761db94.jpg",
      "checksum": "497cc8fe0c5b57b1fb9a3f0da5cf658c",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Check out the company by typing its name in a search engine with words like or “scam” or “complaint.”",
    "Confirm the seller’s physical address and phone number.",
    "Watch out for unfamiliar sites selling products that are in short supply or name brand goods at steep discounts.",
    "Pay with a credit card, and contact your credit card company to dispute the charges if a seller doesn’t deliver your goods or they are not as promised."
  ],
  "sources": [
    {
      "index": 1,
      "text": "Check out the company by typing its name in a search engine with words like or “scam” or “complaint.”",
      "links": []
    },
    {
      "index": 2,
      "text": "Confirm the seller’s physical address and phone number.",
      "links": []
    },
    {
      "index": 3,
      "text": "Watch out for unfamiliar sites selling products that are in short supply or name brand goods at steep discounts.",
      "links": []
    },
    {
      "index": 4,
      "text": "Pay with a credit card, and contact your credit card company to dispute the charges if a seller doesn’t deliver your goods or they are not as promised.",
      "links": []
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2022/12/who-experiences-scams-story-all-ages",
  "scraped_at": "2025-11-15T20:49:35.237600",
  "title": "Who experiences scams? A story for all ages",
  "published_date": "2022-12-08",
  "full_text": "Many people think scams mostly affect older adults. But reports to the FTC’s Consumer Sentinel tell a different story: anyone can be scammed. In fact, reports suggest that many scams are harming younger people  more  than older adults. While there’s more to the story, the broad theme is that scams affect every age group, but differently. In 2021, Gen Xers, Millennials, and Gen Z young adults (ages 18-59) were 34% more likely than older adults (ages 60 and over) to report losing money to fraud, [1]  and some types of fraud stood out. Younger adults reported losses to  online shopping fraud  – which often started with an ad on social media –  far  more often than any other fraud type, and most said they simply did not get the items they ordered. [2]  Younger adults were over four times more likely than older adults to report a loss on an investment scam. [3]  Most of these were  bogus cryptocurrency investment opportunities . [4]  And this age group reported losing money on  job scams  at more than five times the rate of older adults. Many college students reported that they were scammed after getting a message at their student email address about a so-called job opportunity. [5]  The median individual reported fraud loss by people 18-59 was $500 in 2021. While older adults were less likely to report losing money to fraud, those 70 and over reported much higher median individual losses. The median reported loss was $800 for people 70-79, and a whopping $1,500 for those 80 and over. [6]  But older adults were also much more likely to report fraud they had spotted or encountered – but avoided losing any money to – than people 18-59. [7]  And for older adults, different types of scams stood out. In 2021, they were about five times more likely to report losing money on  tech support scams  than younger adults. Tech support scammers impersonate companies like Apple and Microsoft to trick you into sending money to fix an “urgent” security problem that doesn’t exist. Older adults were also more than twice as likely to report losing money on a  prize, sweepstakes, or lottery scam . Prize, sweepstakes, and lottery scams often impersonate a well-known business to trick people into sending money to claim nonexistent winnings. Reports point to these scams as especially costly to people 80 and over – about one out of every three dollars reported lost to fraud by this age group in 2021 was lost to a prize, sweepstakes, and lottery scam. [8] Reports also point to generational differences in how scammers reach people. On social media, the differences are striking: in 2021, 31% of people 18-59 who reported losing money on a scam said it started on a social media platform; compare that to 15% of people 60 and older. For Gen Z young adults and younger Millennials (ages 18-29), reports suggest social media plays an even larger role – nearly 40% of 2021 fraud loss reports by this age group were to frauds originating on social media. Scams that start with a phone call also show big age differences: in 2021, 24% of older adults who reported losing money to a scam said it started with a phone call, compared to just 10% of younger consumers. The numbers are higher still for people 80 and over – more than 40% of their 2021 loss reports identified a phone call as the contact method. [9] The lesson is clear: no matter your age, learning about scams is important for  everyone . By sharing what you know, you can help protect others in your community from scams. To learn more, visit  ftc.gov/PassitOn . And for a deeper dive into the FTC’s data on scams and age, read the FTC’s  Protecting Older Consumers Report . [1] This comparison of older adults and younger adults is normalized against the population size of each age group. The analysis is based on U.S. Census Bureau data for population by age. See U.S. Census Bureau, Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States (June 2020), available at  https://www.census.gov/data/tables/time-series/demo/popest/2010s-national-detail.html . Data provided by the Internet Crimes Complaint Center (IC3) are excluded here and throughout this Spotlight due to differences in the age ranges collected from consumers and differences in report categorization. About 46% of fraud reports filed in 2021 included consumer age information. [2] In 2021, 59% of online shopping loss reports by people 18-59 indicated that the order was never received. Excluding reports that did not specify a contact method, 38% of these consumers indicated that the fraud started with an ad, a post, or a message on social media.  [3] Investment scams refer to fraud reports classified as investment seminars and advice, stocks and commodity futures trading, art, gems and rare coin investments, and miscellaneous investments. [4] In 2021, 62% of investment scams loss reports by people 18-59 indicated cryptocurrency as the payment method, compared to 37% of investment scam loss reports by people 60 and older. These figures exclude reports that did not indicate a payment method.  [5] Job scams often use  fake checks  to trick people into sending money. People 18-59 were nearly twice as likely as older adults to report a loss on a fake check scam in 2021, and many of these reports were also classified as job scams. [6] People 60-69 reported a median individual loss of $520 in 2021.  [7] In 2021, controlling for population size (see footnote 1), people 60 and older were 68% more likely than people 18-59 to file a fraud report indicating no money was lost. The largest share of 2021 no-loss reports by older adults were about phone scams, and these were most often calls from scammers impersonating businesses and government agencies. [8] In 2021, $47 million of the $151 million reported lost to fraud by people 80 and over was lost to prize, sweepstakes, and lottery scams, more than any other age group. [9] In 2021, excluding reports that did not indicate a contact method, 41% of loss reports by people 80 and over indicated phone as the contact method, compared to 22% of loss reports by people 60-79. Excluding reports that did not indicate a contact method, 53% of 2021 aggregate reported loss by adults 80 and over were on scams that started with a phone call, compared to 26% of aggregate reported losses by people 60-79.",
  "summary": "Many people think scams mostly affect older adults. But reports to the FTC’s Consumer Sentinel tell a different story: anyone can be scammed.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/ftc_gov/images/fraud-types-visual.png",
    "https://www.ftc.gov/sites/default/files/ftc_gov/images/Contact-Methods-visual.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/ftc_gov/images/fraud-types-visual.png",
      "path": "full/82195db85c726fdae7c8c407574646672b1b36ce.jpg",
      "checksum": "6019219527809aeaca76ffd2370633fa",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/ftc_gov/images/Contact-Methods-visual.png",
      "path": "full/11cdfdf0924ddec77de0922494812ce069177143.jpg",
      "checksum": "5b6f6aa168f9ddb07897530a4052c403",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Competition Matters \n           \n   \n\n   First Research Published from Physician 6(b) Study \n\n \n    \n\n \n     \n           Tom Koch (Acting DAD, BE Office of Applied Research and Outreach) and Ted Rosenbaum (Acting BE Director) \n       \n \n\n\n \n     \n           June 17, 2025 \n \n       \n \n\n   \n      \n         \n \n  \n  \n   \n    \n              \n\n \n         \n               Technology Blog \n           \n   \n\n   The FTC Is on the Front Lines of Tech Innovation & Regulation \n\n \n    \n\n \n     \n           Stephanie T.",
    "Nguyen, Chief Technologist \n       \n \n\n\n \n     \n           January 17, 2025 \n \n       \n \n\n   \n      \n         \n \n  \n  \n   \n     Press Release \n   FTC Requires Divestiture of Oil Change Shops in Valvoline-Greenbriar Deal \n\n\n \n     \n           November 14, 2025 \n \n       \n \n\n   \n \n  \n  \n   \n\n                   \n           Dec 09 \n         \n             \n        \n   Office Hours for Librarians – December 9, 2025 \n\n \n     \n    \n                                               Tuesday, December 9, 2025 | 2:00PM \n -  3:00PM \n                     \n \n\n       \n       \n \n  \n  \n   \n    \n              \n\n \n         \n               Data Spotlight \n           \n   \n\n   Who experiences scams?",
    "A story for all ages \n\n \n    \n\n \n     \n           December 8, 2022 \n \n       \n \n \n   \n      \n         \n \n  \n  \n   \n    \n              \n\n \n     \n           Many people think scams mostly affect older adults.",
    "In 2021, Gen Xers, Millennials, and Gen Z young adults (ages 18-59) were 34% more likely than older adults (ages 60 and over) to report losing money to fraud, [1]  and some types of fraud stood out.",
    "[2]  Younger adults were over four times more likely than older adults to report a loss on an investment scam.",
    "[3]  Most of these were  bogus cryptocurrency investment opportunities .",
    "[4]  And this age group reported losing money on  job scams  at more than five times the rate of older adults.",
    "[5]  The median individual reported fraud loss by people 18-59 was $500 in 2021.",
    "While older adults were less likely to report losing money to fraud, those 70 and over reported much higher median individual losses.",
    "The median reported loss was $800 for people 70-79, and a whopping $1,500 for those 80 and over."
  ],
  "sources": []
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2022/02/reports-romance-scams-hit-record-highs-2021",
  "scraped_at": "2025-11-15T20:49:35.451558",
  "title": "Reports of romance scams hit record highs in 2021",
  "published_date": "2022-02-10",
  "full_text": "Online dating can be a great way to find lasting love – or even your next fling. But reports to the FTC suggest it also creates opportunities for scammers. In the past five years, people have reported losing a staggering $1.3 billion to romance scams, [1] [2]  more than any other FTC fraud category. The numbers have skyrocketed in recent years, and 2021 was no exception – reported losses hit a record $547 million for the year. That’s more than six times the reported losses in 2017 and a nearly 80% increase compared to 2020. The median individual reported loss in 2021 was $2,400. [3] Reports show that romance scammers are masters of disguise. They create fake online profiles with attractive photos swiped from the web. Sometimes they even assume the identities of real people. They may study information people share online and then pretend to have common interests. And the details they share about themselves will always include built-in excuses for not meeting in person. For example, many reportedly claim to be serving overseas in the military or working on an offshore oil rig. Many people who’ve experienced scams report being contacted on dating apps. But you don’t have to be looking for love to be courted by a romance scammer. Reports of unexpected private messages on social media platforms are common. More than a third of people who said they lost money to an online romance scam in 2021 said it began on Facebook or Instagram. [4] Romance scammers weave all sorts of believable stories to con people, but their old standby involves pleas for help while claiming one financial or health crisis after another. The scammers’ stories might involve a sick child or a temporary inability to get to their money for a whole range of reasons. People who lost money to a romance scammer often report sending money repeatedly: they believe they’re helping someone they care about. But it’s all a lie. In another common twist on the romance scam, people agree to help transfer money as a favor to their supposed sweetheart. The scammer often claims to need help getting their inheritance money or moving funds for an important business deal. Stories like this often set people up to become “money mules” – they may think they’re just helping, but they’re really laundering stolen funds. These stories are also used to trick people into sending their  own  money. People have reported paying all sorts of bogus fees to accept money that never turns up. Others say they deposited a check from their sweetie and sent some of the money as instructed, only to find out later that the check was fake – leaving them without the money they sent. Still others report sending money based on promises – later proven to be false – that they would be repaid. A growing trend in 2021 was scammers using romance as a hook to lure people into bogus investments, especially cryptocurrency. People are led to believe their new online companion is a successful investor who, before long, casually offers investment advice. These so-called investment opportunities often involve foreign exchange (forex) trading or cryptocurrency. And when people follow this investment “advice,” they wind up losing all the money they “invest.” In fact, the largest reported losses to romance scams were paid in cryptocurrency: $139 million last year alone. [5]  That’s a remarkable growth in cryptocurrency payments to romance scammers: 2021 numbers are nearly five times those reported in 2020, and more than 25 times those reported in 2019. In 2021, the median individual reported loss using cryptocurrency was a staggering $9,770. While cryptocurrency losses were the most costly, it was not the most common payment method for romance scams. In 2021, more people reported paying romance scammers with gift cards than with any other payment method. In fact, about one in four people said they paid a romance scammer with a gift card, and they reported losing $36 million last year. [6] Reports about romance scams increased for every age group in 2021. The increase was most striking for people ages 18 to 29. For this age group, the number of reports increased more than tenfold from 2017 to 2021. But the reported median loss increased with age: people 70 and older reported the highest individual median losses at $9,000, compared to $750 for the 18 to 29 age group. [7] So how can you spot scammers if you’re looking for love online? Help stop scammers by reporting suspicious profiles or messages to the dating app or social media platform. Then, tell the FTC at  ReportFraud.ftc.gov . Learn more at  ftc.gov/romancescams . [1]  This figure and figures throughout this Spotlight are based on reports to the FTC's Consumer Sentinel Network that were classified as romance scams, excluding reports provided by the Internet Crimes Complaint Center (IC3). IC3 reports submitted prior to 2019 are not included in Sentinel, so these reports were excluded to ensure greater consistency in reporting trends over time. [2]  Because the vast majority of frauds are not reported to the government, this figure reflects just a small fraction of the public harm caused by romance scams.  See  Anderson, K. B.,  To Whom Do Victims of Mass-Market Consumer Fraud Complain?  at 1 (May 2021),  available at   https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3852323  (study showed only 4.8% of people who experienced mass-market consumer fraud complained to a Better Business Bureau or a government entity). [3]  Reports provided by MoneyGram and Western Union are excluded for this calculation as these data contributors report each transaction separately, which typically affects calculation of an individual’s median loss. [4]  This figure is based on 2021 loss reports directly to the FTC categorized as romance scams and where the consumer identified an online platform. Of these, the top platforms identified as the starting point for the scam were Facebook (23%) and Instagram (13%). [5]  Ranked by reported dollar losses the top payment methods on romance scams reported in 2021 are as follows: cryptocurrency ($139M), bank transfer or payment ($121M), wire transfer ($93M), and gift card or reload card ($36M). [6]  About 28% of people who reported losing money on a romance scam in 2021 said they paid with a gift card or reload card, followed by cryptocurrency (18%), payment app or service (14%), bank transfer or payment (13%), and wire transfer (12%). These figures exclude MoneyGram and Western Union as these data contributors report each transaction separately, which affects the number of reports.   [7]  In 2021, the median individual  reported losses to romance scams by age were as follows: $750 (18-29), $2,000 (30-39), $3,000 (40-49), $4,000 (50-59), $6,000 (60-69), and $9,000 (70 and over).  Reports provided by MoneyGram and Western Union are excluded for these calculations as these data contributors report each transaction separately, which typically affects calculation of an individual’s median loss.  About 70% (38,886 reports) of 2021 romance scam reports included age information.",
  "summary": "Online dating can be a great way to find lasting love – or even your next fling. But reports to the FTC suggest it also creates opportunities for scammers.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/styles/scaled_sm/public/ftc_gov/images/romance_scams_data_spotlight.png?itok=GgCkNOGM"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/styles/scaled_sm/public/ftc_gov/images/romance_scams_data_spotlight.png?itok=GgCkNOGM",
      "path": "full/9e178aeb82683f3d38b97c52628ac153d361e5e1.jpg",
      "checksum": "491f791b880603a7425364b59eff24c8",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Nobody legit will ever ask you to help by sending cryptocurrency, giving the numbers on a gift card, or by wiring money. Anyone who does is a scammer.",
    "Never send or forward money for someone you haven’t met in person, and don’t act on their investment advice.",
    "Talk to friends or family about a new love interest and pay attention if they’re concerned.",
    "Try a reverse-image search of profile pictures. If the details don’t match up, it’s a scam."
  ],
  "sources": [
    {
      "index": 1,
      "text": "Nobody legit will ever ask you to help by sending cryptocurrency, giving the numbers on a gift card, or by wiring money. Anyone who does is a scammer.",
      "links": []
    },
    {
      "index": 2,
      "text": "Never send or forward money for someone you haven’t met in person, and don’t act on their investment advice.",
      "links": []
    },
    {
      "index": 3,
      "text": "Talk to friends or family about a new love interest and pay attention if they’re concerned.",
      "links": []
    },
    {
      "index": 4,
      "text": "Try a reverse-image search of profile pictures. If the details don’t match up, it’s a scam.",
      "links": []
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2023/02/romance-scammers-favorite-lies-exposed",
  "scraped_at": "2025-11-15T20:49:36.518066",
  "title": "Romance scammers’ favorite lies exposed",
  "published_date": "2023-02-09",
  "full_text": "Romance scammers tell all sorts of lies to steal your heart and money, and reports to the FTC show those lies are working. Last year’s romance scam numbers looked a lot like 2021 all over again, and it’s not a pretty picture. In 2022, nearly 70,000 people reported a romance scam, and reported losses hit a staggering $1.3 billion. [1]  The median reported loss: $4,400. [2] These scammers pay close attention to the information you share, and don’t miss a beat becoming your perfect match. You like a thing, so that’s their thing, too. You’re looking to settle down. They’re ready too. But there is one exception – you want to meet in real life, and they can’t. Reports show their excuse is often baked right into their fake identity. Claiming to be on a faraway military base is the most popular excuse, but “offshore oil rig worker” is another common (and fake) occupation. In short, there’s no end to the lies romance scammers will tell to get your money. Reports show romance scammers often use dating apps to target people looking for love. But reports of romance scams that start with unexpected private messages on social media platforms are even more common. In fact, 40% of people who said they lost money to a romance scam last year said the contact started on social media; 19% said it started on a website or app. [3]  Many people reported that the scammer then quickly moved the sweet talk to WhatsApp, Google Chat, or Telegram. [4] You may have heard about romance scammers who tell you they’re sick, hurt, or in jail – or give you another fake reason to send them money. But did you know that many romance scammers operate by offering to do  you  a favor? They may claim to be a successful cryptocurrency investor who’ll teach you how it’s done. But any money you “invest” goes straight into their wallet. In another twist, they might say they’ve shipped you a valuable package (not true), which requires you to send money for “customs” or some other made-up fee. It’s all a lie. You send the money, and the package never turns up. Reports also show that scammers who convince you to share explicit photos will then threaten to share them with your social media contacts. It’s called sextortion, and these reports have increased more than eightfold since 2019. [5]   People aged 18-29 were over six times as likely to report sextortion than people 30 and over. [6]  About 58% of 2022 sextortion reports identified social media as the contact method,  [7]  with Instagram and Snapchat topping the list. [8] The way romance scammers take your money is another important piece of the story. People reported sending more money to romance scammers using cryptocurrency and bank wires than any other method: together, they accounted for more than 60% of reported losses to romance scams in 2022. [9]  While not the costliest payment method, [10]  gift cards were the most frequently reported – 24% of people who reported losing money to a romance scam in 2022 said it was taken using gift cards. [11] So how can you spot a romance scammer in the act? Help stop scammers by reporting suspicious profiles or messages to the dating app or social media platform. Then, tell the FTC at  ReportFraud.ftc.gov . If someone is trying to extort you,  report it to the FBI . Learn more at  ftc.gov/romancescams . [1]This figure and figures throughout this Spotlight are based on reports to the FTC's Consumer Sentinel Network (Sentinel) that were classified as romance scams. Reports filed with the Internet Crimes Complaint Center (IC3) prior to 2019 are not included in Sentinel. To ensure greater consistency in reporting trends over time, IC3 reports were excluded from earlier Spotlights about romance scams, but now are included in this Spotlight to focus on the scope and nature of the losses. Reported romance scam losses from all Sentinel sources by year are as follows: $493M (2019), $730M (2020), $1.3B (2021) $1.3B (2022). Because the vast majority of frauds are not reported to the government, these figures reflect just a small fraction of the public harm. See Anderson, K. B., To Whom Do Victims of Mass-Market Consumer Fraud Complain? at 1 (May 2021), available at  https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3852323  (study showed only 4.8% of people who experienced mass-market consumer fraud complained to a Better Business Bureau or a government entity). [2]Reports provided by MoneyGram and Western Union are excluded for this median loss calculation as these data contributors report each loss transaction separately, which typically affects calculation of an individual’s median loss. As noted in footnote 1, reports provided by IC3 were excluded from earlier Spotlights about romance scams, but are included in this Spotlight. For this reason, this median loss figure should not be compared to previous Spotlights. [3]These figures exclude reports that did not identify a contact method. Of 2022 loss reports that identified social media as the contact method and named a specific platform, 29% named Instagram and 28% named Facebook. [4] About 40% of 2022 romance scam loss reports with detailed narratives mentioned WhatsApp, Google Chat, or Telegram. Detailed narratives are defined here as narratives of at least 2,000 characters in length [5] This figure excludes reports contributed by IC3 as not all IC3 reports about sextortion are included in Sentinel. Romance scam reports involving sextortion were identified using keyword analysis of the narratives provided in reports. [6] This age comparison is normalized against the population size of each age group. The analysis is based on U.S. Census Bureau data for population by age. See U.S. Census Bureau, Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States (June 2020), available at  https://www.census.gov/data/tables/time-series/demo/popest/2010s-national-detail.html . This excludes reports contributed by IC3 as not all IC3 reports about sextortion are included in Sentinel. [7] This figure excludes reports that did not identify a contact method. [8] Of 2022 sextortion reports that identified social media as the contact method and named a specific platform, 41% named Instagram and 31% named Snapchat.   [9] Figures pertaining to payment methods exclude reports that did not identify a method of payment and reports provided by Western Union and MoneyGram. Figures pertaining to bank wires are based on reports indicating “bank transfer or payment” as the payment method. [10] In 2022, the median individual reported loss was $700 when gift cards were identified as the payment method on romance scams. For comparison, the median individual reported losses on other top payment methods were as follows: $10,079 (cryptocurrency), $10,000 (bank transfer or payment), and $650 (payment app or service). The gift card payment method includes cards that hold a specific cash value that can be used for purchases and reload cards such as MoneyPak that are used to add value to these cards. [11] This figure excludes reports that did not indicate a payment method.",
  "summary": "Romance scammers tell all sorts of lies to steal your heart and money, and reports to the FTC show those lies are working.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Online Dating",
    "Consumer Sentinel Network"
  ],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/ftc_gov/images/romance-lies.png",
    "https://www.ftc.gov/sites/default/files/ftc_gov/images/romance-payment-methods.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/ftc_gov/images/romance-lies.png",
      "path": "full/e5be92c682f9ea7ad8cadb85ff9c7b6f110c9dd4.jpg",
      "checksum": "a0b2dfafca53be5dca600f1fa3d569ff",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/ftc_gov/images/romance-payment-methods.png",
      "path": "full/4196ba5d67064aaa41b62ef478787504bb41b17a.jpg",
      "checksum": "cd9424a5d807d7640979fdc7b338b115",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Nobody legit will ever ask you to help—or insist that you invest— by sending cryptocurrency, giving the numbers on a gift card, or by wiring money. Anyone who does is a scammer.",
    "If someone tells you to send money to receive a package, you can bet it’s a scam.",
    "Talk to friends or family about a new love interest and pay attention if they’re concerned.",
    "Try a reverse image search of profile pictures. If the details don’t match up, it’s a scam.",
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Online Dating",
    "Consumer Sentinel Network"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Nobody legit will ever ask you to help—or insist that you invest— by sending cryptocurrency, giving the numbers on a gift card, or by wiring money. Anyone who does is a scammer.",
      "links": []
    },
    {
      "index": 2,
      "text": "If someone tells you to send money to receive a package, you can bet it’s a scam.",
      "links": []
    },
    {
      "index": 3,
      "text": "Talk to friends or family about a new love interest and pay attention if they’re concerned.",
      "links": []
    },
    {
      "index": 4,
      "text": "Try a reverse image search of profile pictures. If the details don’t match up, it’s a scam.",
      "links": []
    },
    {
      "index": 5,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 6,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    },
    {
      "index": 7,
      "text": "Imposter",
      "links": [
        "https://www.ftc.gov/imposter"
      ]
    },
    {
      "index": 8,
      "text": "Online Dating",
      "links": [
        "https://www.ftc.gov/online-dating"
      ]
    },
    {
      "index": 9,
      "text": "Consumer Sentinel Network",
      "links": [
        "https://www.ftc.gov/terms/consumer-sentinel-network"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2022/06/reports-show-scammers-cashing-crypto-craze",
  "scraped_at": "2025-11-15T20:49:36.738353",
  "title": "Reports show scammers cashing in on crypto craze",
  "published_date": "2022-06-03",
  "full_text": "From Super Bowl ads to Bitcoin ATMs, cryptocurrency seems to be everywhere lately. Although it’s yet to become a mainstream payment method, reports to the FTC show it’s an alarmingly common method for scammers to get peoples’ money. Since the start of 2021, more than 46,000 people have reported losing over $1 billion in crypto to scams [1]  – that’s about one out of every four dollars reported lost, [2]  more than  any  other payment method. The median individual reported loss? A whopping $2,600. The top cryptocurrencies people said they used to pay scammers were Bitcoin (70%), Tether (10%), and Ether (9%). [3]    Crypto has several features that are attractive to scammers, which may help to explain why the reported losses in 2021 were nearly  sixty times  what they were in 2018. There’s no bank or other centralized authority to flag suspicious transactions and attempt to stop fraud before it happens. Crypto transfers can’t be reversed – once the money’s gone, there’s no getting it back. And most people are still unfamiliar with how crypto works. These considerations are not unique to crypto transactions, but they all play into the hands of scammers. Reports point to social media and crypto as a combustible combination for fraud. Nearly half the people who reported losing crypto to a scam since 2021 said it started with an ad, post, or message on a social media platform. [4] During this period, nearly four out of every ten dollars reported lost to a fraud originating on social media was lost in crypto, far more than any other payment method. [5]  The top platforms identified in these reports were Instagram (32%), Facebook (26%), WhatsApp (9%), and Telegram (7%). [6] Of the reported crypto fraud losses that began on social media, most are  investment scams . [7]  Indeed, since 2021, $575 million of all crypto fraud losses reported to the FTC were about bogus investment opportunities, far more than any other fraud type. The stories people share about these scams describe a perfect storm: false promises of easy money paired with people’s limited crypto understanding and experience. Investment scammers claim they can quickly and easily get huge returns for investors. But those crypto “investments” go straight to a scammer’s wallet. People report that investment websites and apps let them track the growth of their crypto, but it’s all fake. Some people report making a small “test” withdrawal – just enough to convince them it’s safe to go all in. When they really try to cash out, they’re told to send  more  crypto for (fake) fees, and they don’t get any of their money back. Romance scams  are a distant second to investment scams, with $185 million in reported cryptocurrency losses since 2021 – that’s nearly one in every three dollars reported lost to a romance scam during this period. [8]  And many have an investment twist too. These keyboard Casanovas reportedly dazzle people with their supposed wealth and sophistication. Before long, they casually offer tips on getting started with crypto investing and help with making investments. People who take them up on the offer report that what they really got was a tutorial on sending crypto to a scammer. The median individual reported crypto loss to romance scammers is an astounding $10,000.   Business and government impersonation scams  are next with $133 million in reported crypto losses since 2021. These scams can start with a text about a supposedly unauthorized Amazon purchase, or an alarming online pop-up made to look like a security alert from Microsoft. From there, people are reportedly told the fraud is extensive and their money is at risk. The scammers may even get the “bank” on the line to back up the story. (Pro tip: it’s not the bank.) In another twist, scammers impersonating border patrol agents have reportedly told people their accounts will be frozen as part of a drug trafficking investigation. These scammers tell people the only way to protect their money is to put it in crypto: people report that these “agents” direct them to take out cash and feed it into a crypto ATM. The “agent” then sends a QR code and says to hold it up to the ATM camera. But that QR code is embedded with the scammer’s wallet address. Once the machine scans it, their cash is gone. People ages 20 to 49 were more than  three times  as likely as older age groups to have reported losing cryptocurrency to a scammer. [9]  Reports point to people in their 30s as the hardest hit – 35% of their reported fraud losses since 2021 were in cryptocurrency. [10]  But median individual reported losses have tended to increase with age, topping out at $11,708 for people in their 70s. [11] Here are some things to know to steer clear of a crypto con: To learn more about cryptocurrency scams – and how to spot and avoid scams generally – visit  ftc.gov/cryptocurrency  and  ftc.gov/scams . Report scams to the FTC at  ReportFraud.ftc.gov .   [1]These figures and figures throughout this Spotlight, unless otherwise noted, are based on fraud reports made directly to the FTC in the Consumer Sentinel Network database from January 1, 2021 through March 31, 2022 that indicated cryptocurrency as the payment method. Reports provided by Sentinel data contributors are excluded because of inconsistencies among contributors in capturing payment information. Because the vast majority of frauds are not reported, these figures reflect just a small fraction of the public harm.  See  Anderson, K. B.,  To Whom Do Victims of Mass-Market Consumer Fraud Complain?  at 1 (May 2021),  available at   https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3852323  (study showed only 4.8% of people who experienced mass-market consumer fraud complained to a Better Business Bureau or a government entity). [2] From January 1, 2021 through March 31, 2022, cryptocurrency was identified as the payment method for 24% of reported dollar losses in fraud reports to the FTC. [3]These figures exclude reports that did not specify the type of cryptocurrency. [4] From January 1, 2021 through March 31, 2022, 49% of fraud reports to the FTC indicating cryptocurrency as the payment method specified that the scam started on social media, compared to 37% in 2020, 18% in 2019, and 11% in 2018. [5] From January 1, 2021 through March 31, 2022, $1.1 billion was reported to the FTC as lost to fraud originating on social media. Of that number, 39% was reported as paid using cryptocurrency, followed by bank transfer or payment (20%), and wire transfer (9%). 8% did not indicate a payment method. [6] These figures exclude reports that did not specify a social media platform. [7] From January 1, 2021 through March 31, 2022, people reported to the FTC that $417 million in cryptocurrency was lost to fraud originating on social media. $273 million of these losses were to fraud categorized as investment related, followed by romance scams ($69 million), and business imposters ($35 million). [8] From January 1, 2021 through March 31, 2022, cryptocurrency was identified as the payment method for 29% of reported dollar losses to romance scams. [9] From January 1, 2021 through March 31, 2022, people ages 20 to 49 submitted fraud loss reports to the FTC indicating social media as the contact method at a rate 3.4 times greater than people 50 and over. About 91% of fraud reports indicating cryptocurrency as the payment method during this period included age information. This age comparison is normalized based on the number of loss reports per million population by age during this period. Population numbers were obtained from the U.S. Census Bureau Annual Estimates of the Resident Population for Selected Age Groups by Sex for the United States (June 2020). [10] From January 1, 2021 through March 31, 2022, the percentage of total reported fraud losses that were lost in cryptocurrency by age were as follows: 12% (18-19), 23% (20-29), 35% (30-39), 33% (40-49), 28% (50-59), 19% (60-69), 10% (70-79), and 2% (80 and over). These figures exclude reports that did not indicate age. [11] From January 1, 2021 through March 31, 2022, the median individual reported cryptocurrency losses to fraud by age were as follows: $1,000 (18-19), $1,600 (20-29), $2,500 (30-39), $3,200 (40-49), $5,000 (50-59), $8,500 (60-69), $11,708 (70-79), and $8,100 (80 and over).",
  "summary": "From Super Bowl ads to Bitcoin ATMs, cryptocurrency seems to be everywhere lately.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/sites/default/files/styles/scaled_sm/public/ftc_gov/images/trend-viz.png?itok=IaZSNuP2",
    "https://www.ftc.gov/sites/default/files/ftc_gov/images/PSC-viz-crypto.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/sites/default/files/styles/scaled_sm/public/ftc_gov/images/trend-viz.png?itok=IaZSNuP2",
      "path": "full/7f27f18a99e869ab98e6dcbfc5eb0b9891706c47.jpg",
      "checksum": "ce72c032881f2f1721c3cd7db0ed2607",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/ftc_gov/images/PSC-viz-crypto.png",
      "path": "full/7c24e26879b36a0da4b3773fb580458549711e10.jpg",
      "checksum": "27bddce31941899572b7b0a4aa7c6c18",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Only scammers will guarantee profits or big returns.  No cryptocurrency investment is ever guaranteed to make money, let alone big money.",
    "Nobody legit will require you to buy cryptocurrency.  Not to sort out a problem, not to protect your money. That’s a scam.",
    "Never mix online dating and investment advice . If a new love interest wants to show you how to invest in crypto, or asks you to send them crypto, that’s a scam."
  ],
  "sources": [
    {
      "index": 1,
      "text": "Only scammers will guarantee profits or big returns.  No cryptocurrency investment is ever guaranteed to make money, let alone big money.",
      "links": []
    },
    {
      "index": 2,
      "text": "Nobody legit will require you to buy cryptocurrency.  Not to sort out a problem, not to protect your money. That’s a scam.",
      "links": []
    },
    {
      "index": 3,
      "text": "Never mix online dating and investment advice . If a new love interest wants to show you how to invest in crypto, or asks you to send them crypto, that’s a scam.",
      "links": []
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2023/06/iykyk-top-text-scams-2022",
  "scraped_at": "2025-11-15T20:49:39.429770",
  "title": "IYKYK: The top text scams of 2022",
  "published_date": "2023-06-08",
  "full_text": "Texting is cheap and easy, and scammers are counting on the ding of an incoming text being hard to ignore. [1]  In 2022, they were right to the tune of $330 million in losses to text scams, as reported to the FTC’s Consumer Sentinel Network, with a median reported loss of $1,000. That’s more than double the 2021 reported losses and nearly five times what people reported in 2019. [2]  In fact, reports about text scams spiked in the first six months of the COVID-19 pandemic and have never returned to pre-pandemic levels. [3] But why do they work? Scammers use the speed of text communication to their advantage: they hope you won’t slow down and think over what’s in the message. Some messages promise a good thing  –  a gift, a package, or even a job. Others try to make you panic, thinking someone’s in your accounts. These are all lies and ways to take your money and personal information. While there are countless varieties of text scams, the top five described below account for over 40% of randomly sampled text frauds reported in 2022. [4]  All five have one thing in common – they often work by impersonating well-known businesses. [5] Reports about texts impersonating banks are up nearly twentyfold since 2019. [6]  You might get a fake number to call about supposed suspicious activity. Or they might say to reply “yes or no” to verify a large transaction (that you didn’t make). If you reply, you’ll get a call from the (fake) fraud department. People say they thought the bank was helping them get their money back. Instead, money was transferred  out  of their account. This scam’s median reported loss was a whopping $3,000 last year. Worse still, many people report giving their Social Security number and other personal information to scammers, leading to possible identity theft. A text about a free gift, reward, or prize may look like it came from a company you know – say, your cell phone company or a big retailer. But everything about this is fake. If you click the link and pay a small “shipping fee,” you just gave your credit card number to a scammer. Reports tell us fraudulent charges soon follow. Expecting a package? There’s a text scam for you. Texts pretending to be from the U.S. Postal Service, FedEx, and UPS say there’s a problem with a delivery. [7]  They link to a website that looks real – but isn’t. If you paid a small “redelivery fee,” which many people reported, that was a trick to get your credit card number. People also reported giving these scammers their personal information, including Social Security numbers. Promises of easy money for mystery shopping at well-known stores like Whole Foods and Walmart are an old scammer favorite. Reports about bogus offers to make money driving around with your car wrapped in ads are also common. Reports show job scammers also target people who post their resumes to employment websites like Indeed. In most of these reports, scammers use  checks that seem to “clear”  but turn out to be fake to trick people into sending them money. [8] Like fake bank texts, texts from someone who says they’re “Amazon” look like automated fraud prevention messages. Often, they ask you to verify a big-ticket order you didn’t make. If you call the number in the text, you get a phony Amazon rep who offers to “fix” your account. People often report giving the rep remote access to their phone so they can get things fixed and get their refund. [9]  But then the rep says a couple of zeros were accidently added to the refund, so they need you to return that money to them – often by buying gift cards and giving the cards’ PIN numbers. In all of these cases, reporting can help stop scam text messages: How can you avoid text scams? To learn more about how to spot and avoid scams – and how to recover money if you’ve paid a scammer – visit  ftc.gov/scams . Learn more about text scams at  ftc.gov/textscams . [1]  Text message open rates are estimated to be as high as 98%, and response rates as high as 45%, as compared to email open and response rates of 20% and 6% respectively. More than half of consumers text daily, making texting more common than any other communication method, including voice or email. See FCC, Consumer Advisory Committee,  Report on the State of Text Messaging  at 5 (August 2022),  available at   https://files.fcc.gov/ecfs/download/20970528-9c2e-400d-951b-1024118e50fb?orig=true&pk=cb77b2ec-1a58-dbc6-139b-ad192cfd5d9b . [2]  Aggregate  reported losses to text fraud by year are as follows: $67M (2019), $86M (2020), $131M (2021), $330M (2022). Text fraud is defined here and throughout this Spotlight as fraud reports indicating text as the contact method. Because the vast majority of frauds are not reported to the government, these figures reflect just a small fraction of the public harm. See Anderson, K. B.,  To Whom Do Victims of Mass-Market Consumer Fraud Complain?  at 1 (May 2021),  available at   https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3852323  (study showed only 4.8% of people who experienced mass-market consumer fraud complained to a Better Business Bureau or a government entity). [3]  The number of text  fraud reports by year are as follows: 137K (2019), 332K (2020), 378K (2021), 330K (2022). The number of reports spiked in Q3 2020, with 125K reports in that quarter alone. [4]  The top scam types were identified by hand-coding a random sample of 1,000 2022 text fraud reports containing a narrative description. For each scam type, the margin of error for the share of complaints in that type is +/-3.1%, given a 95% confidence level. The scam types identified here do not replace the subcategories the FTC publishes on  www.ftc.gov/exploredata , but rather provide more detail. The subcategories published on  www.ftc.gov/exploredata  primarily reflect topics consumers self-select on  www.reportfraud.ftc.gov  or report to the FTC call center or Sentinel data contributors. Reports on  www.ftc.gov/exploredata  may be tagged with multiple subcategories. [5]  In 2022, 51% of reports about text fraud were categorized in Sentinel as business imposters. This excludes reports categorized as unspecified.    [6]  The number of fraud reports about text messages claiming to be from banks by year are as follows: 1,355 (2019), 2,231 (2020), 13,677 (2021), 25,725 (2022). The top companies identified in 2022 reports about bank impersonation text scams were Bank of America (14%), Wells Fargo (12%), Chase (12%), and Citibank (9%). These figures exclude reports that did not include a company name. [7]  Many U.S. Postal Service delivery reports are categorized as government imposters on  www.ftc.gov/exploredata . [8]  By law, banks must make deposited funds available quickly. The bank may say the check has “cleared” when funds are made available, but it can take weeks for the bank to uncover a fake check. The bank can take back the amount of the check once it is detected as fake. Reports show fake checks are often used to trick people into, for example, sending money to fake car wrap installers or buying gift cards at retailers as supposed mystery shoppers. [9]  See the  June 2021 Data Spotlight  for more information about Amazon impersonation scams.",
  "summary": "Texting is cheap and easy, and scammers are counting on the ding of an incoming text being hard to ignore.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/system/files/ftc_gov/images/Wells-Fargo-Bank-Fraud-Alert.png",
    "https://www.ftc.gov/system/files/ftc_gov/images/Amazon-Text-Scam.png",
    "https://www.ftc.gov/system/files/ftc_gov/images/ATT-Free-Msg.png",
    "https://www.ftc.gov/system/files/ftc_gov/images/USPS-Mssg.png",
    "https://www.ftc.gov/system/files/ftc_gov/images/Whole-Foods-Market.png",
    "https://www.ftc.gov/system/files/ftc_gov/images/Transaction-Update.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/system/files/ftc_gov/images/Wells-Fargo-Bank-Fraud-Alert.png",
      "path": "full/7ea91062223b6fa94c43dc24db7f05b198bcdc7a.jpg",
      "checksum": "f14f514cbacc19c5072b2eaf65079a8d",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/system/files/ftc_gov/images/Amazon-Text-Scam.png",
      "path": "full/a8742c4b482dd72c9dd6b8b123d14504db89e6d2.jpg",
      "checksum": "e2a405539808e5495ee08b626fa55e0f",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/system/files/ftc_gov/images/ATT-Free-Msg.png",
      "path": "full/7efc3a3395f2932631478f71f0220971909367dd.jpg",
      "checksum": "8a86014951ecf958223fdb8075d51757",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/system/files/ftc_gov/images/USPS-Mssg.png",
      "path": "full/69c682c2211d41981b6b4b7666c2d9b4c9e62ee0.jpg",
      "checksum": "9a7a9216c50e153f387f99d71594dbec",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/system/files/ftc_gov/images/Whole-Foods-Market.png",
      "path": "full/73a5b17ef0a488fd04b8b578c8999a30e513469b.jpg",
      "checksum": "44dbe679d6360d5530fc5ae28f503ccd",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/system/files/ftc_gov/images/Transaction-Update.png",
      "path": "full/29577f1a99ff9da3c5207009e460bec672d4fc78.jpg",
      "checksum": "8227eec55bd0a1ccc51137a6314767a8",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Forward it to  7726 (SPAM) . This helps your wireless provider spot and block similar messages.",
    "Report it on either the  Apple iMessages app  or  Google’s Messages app  for Android users.",
    "Report it to the FTC at  ReportFraud.ftc.gov .",
    "Never click on links or respond to unexpected texts.  If you think it might be legit, contact the company using a phone number or website you know is real. Don’t use the information in the text message.",
    "Filter unwanted texts before they reach you.  There are a few ways to  block unwanted texts ."
  ],
  "sources": [
    {
      "index": 1,
      "text": "Forward it to  7726 (SPAM) . This helps your wireless provider spot and block similar messages.",
      "links": [
        "https://www.ctia.org/consumer-resources/protecting-yourself-from-spam-text-messages"
      ],
      "statistics": [
        "7726"
      ]
    },
    {
      "index": 2,
      "text": "Report it on either the  Apple iMessages app  or  Google’s Messages app  for Android users.",
      "links": [
        "https://support.apple.com/en-us/HT201229",
        "https://support.google.com/messages/answer/9061432?hl=en&co=GENIE.Platform%3DAndroid&oco=1"
      ]
    },
    {
      "index": 3,
      "text": "Report it to the FTC at  ReportFraud.ftc.gov .",
      "links": [
        "https://reportfraud.ftc.gov/"
      ]
    },
    {
      "index": 4,
      "text": "Never click on links or respond to unexpected texts.  If you think it might be legit, contact the company using a phone number or website you know is real. Don’t use the information in the text message.",
      "links": []
    },
    {
      "index": 5,
      "text": "Filter unwanted texts before they reach you.  There are a few ways to  block unwanted texts .",
      "links": [
        "https://consumer.ftc.gov/articles/how-recognize-and-report-spam-text-messages#what_to_do"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2023/10/social-media-golden-goose-scammers",
  "scraped_at": "2025-11-15T20:49:40.569849",
  "title": "Social media: a golden goose for scammers",
  "published_date": "2023-10-06",
  "full_text": "Scammers are hiding in plain sight on social media platforms and reports to the FTC’s Consumer Sentinel Network point to huge profits. One in four people who reported losing money to fraud since 2021 said it started on social media. [1]  Reported losses to scams on social media during the same period hit a staggering $2.7 billion, far higher than any other method of contact. And because the vast majority of frauds are not reported, this figure reflects just a small fraction of the public harm. [2] Social media gives scammers an edge in several ways. They can easily manufacture a fake persona, or hack into your profile, pretend to be you, and con your friends. They can learn to tailor their approach from what you share on social media. And scammers who place ads can even use tools available to advertisers to methodically target you based on personal details, such as your age, interests, or past purchases. All of this costs them next to nothing to reach billions of people from anywhere in the world. Reports show that scams on social media are a problem for people of all ages, but the numbers are most striking for younger people. In the first six months of 2023, in reports of money lost to fraud by people 20-29, social media was the contact method more than 38% of the time.  For people 18-19, that figure was 47%. [3]  The numbers decrease with age, consistent with generational differences in social media use. [4] The most frequently reported fraud loss in the first half of 2023 was from people who tried to buy something marketed on social media, coming in at a whopping 44% of all social media fraud loss reports. Most of these reports are about undelivered goods, with no-show clothing and electronics topping the list. [5] According to reports, these scams most often start with an ad on Facebook or Instagram. [6] \n  While online shopping scams have the highest number of reports, the largest share of dollar losses are to scams that use social media to promote fake investment opportunities. [7]  In the first six months of 2023, more than half the money reported lost to fraud on social media went to investment scammers. To draw people in, these scammers promote their own supposed investment success, often trying  to lure people to investment websites and apps that turn out to be bogus. They make promises of huge returns, and even make it look like an “investment” is growing. But if people invest, and reports say it’s usually in cryptocurrency, [8]  they end up empty handed. After investment scams, reports point to romance scams as having the second highest losses on social media. In the first six months of 2023, half of people who said they lost money to an online romance scam said it began on Facebook, Instagram, or Snapchat. [9]  These scams often start with a seemingly innocent friend request from a stranger followed by love bombing and the inevitable request for money.  Here are some ways to steer clear of scams on social media: [1] This figure excludes reports that did not specify a contact method. Including reports directly to the FTC and reports provided by Sentinel data contributors, 257,945 reports about money lost to fraud originating on social media were filed from January 2021 through June 2023. [2] See Anderson, K. B.,  To Whom Do Victims of Mass-Market Consumer Fraud Complain?  at 1 (May 2021),  available at  https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3852323  (study showed only 4.8% of people who experienced mass-market consumer fraud complained to a Better Business Bureau or a government entity). [3] These figures exclude reports that did not specify a contact method and reports that did not include age information. [4] See Pew Research Center,  Social Media Use in 2021  (April 2021),  available at  https://www.pewresearch.org/internet/2021/04/07/social-media-use-in-2021/  (study showed people ages 18-29 reported the highest social media use at 84%, followed by ages 30-49 at 81%, ages 50-64 at 73% and 65 and over at 45%). In the first 6 months of 2023, the share of loss reports indicating social media as the contact method by age was as follows: 47% (18-19), 38% (20-29), 32% (30-39), 28% (40-49), 26% (50-59), 21% (60-69), 15% (70-79), 9% (80 and over). Social media was the top contact method ranked by fraud loss reports for all age groups under age 70, while phone call was the top contact method for the 70-79 and 80 and over age groups. [5] The top undelivered items were identified by hand-coding a random sample of 400 reports that contained a narrative description identifying the items ordered. [6] In the first 6 months of 2023, people reported undelivered merchandise in 61% of loss reports about online shopping fraud originating on social media. Facebook was identified as the social media platform in 60% of these reports, and Instagram was identified in 24%. This excludes reports that did not identify a platform. [7] The top platforms identified in these reports were Instagram (30%), Facebook (26%), WhatsApp (13%), and Telegram (9%). Reports that did not indicate a platform are excluded from these calculations. [8] In the first 6 months of 2023, cryptocurrency was identified as the payment method in 53% of investment-related fraud reports that indicated social media as the method of contact. This excludes reports that did not specify a payment method. [9] Facebook and Instagram were each identified in 21% of these reports, followed by Snapchat at 8%. This excludes reports that did not specify the platform, website, or app.",
  "summary": "Scammers are hiding in plain sight on social media platforms and reports to the FTC’s Consumer Sentinel Network point to huge profits.",
  "tags": [],
  "image_urls": [
    "https://www.ftc.gov/system/files/styles/scaled_lg/private/ftc_gov/images/Reported-fraud-losses-by-contact-method.jpg?itok=s6MI9xyB"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/system/files/styles/scaled_lg/private/ftc_gov/images/Reported-fraud-losses-by-contact-method.jpg?itok=s6MI9xyB",
      "path": "full/c92c74e77f5919cec3830ea3d8cd4c0ca8755c5c.jpg",
      "checksum": "f48f1a9dd1bd2944d289bf9ba59ccbc9",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Limit who can see your posts and information on social media. All platforms collect information about you from your activities on social media, but visit  your privacy settings  to set some restrictions.",
    "If you get a message from a friend about an opportunity or an urgent need for money, call them. Their account may have been hacked—especially if they ask you to pay by cryptocurrency, gift card, or wire transfer. That’s how scammers ask you to pay.",
    "If someone appears on your social media and rushes you to start a friendship or romance, slow down. Read about  romance scams . And never send money to someone you haven’t met in person.",
    "Before you buy,  check out the company . Search online for its name plus “scam” or “complaint.”"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Limit who can see your posts and information on social media. All platforms collect information about you from your activities on social media, but visit  your privacy settings  to set some restrictions.",
      "links": [
        "https://www.consumer.ftc.gov/articles/how-protect-your-privacy-apps"
      ]
    },
    {
      "index": 2,
      "text": "If you get a message from a friend about an opportunity or an urgent need for money, call them. Their account may have been hacked—especially if they ask you to pay by cryptocurrency, gift card, or wire transfer. That’s how scammers ask you to pay.",
      "links": []
    },
    {
      "index": 3,
      "text": "If someone appears on your social media and rushes you to start a friendship or romance, slow down. Read about  romance scams . And never send money to someone you haven’t met in person.",
      "links": [
        "https://www.consumer.ftc.gov/articles/what-you-need-know-about-romance-scams"
      ]
    },
    {
      "index": 4,
      "text": "Before you buy,  check out the company . Search online for its name plus “scam” or “complaint.”",
      "links": [
        "https://www.consumer.ftc.gov/articles/0020-shopping-online"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2024/05/whos-who-scams-spring-roundup",
  "scraped_at": "2025-11-15T20:49:41.155932",
  "title": "Who’s who in scams: a spring roundup",
  "published_date": "2024-05-24",
  "full_text": "Scammers are all about spinning lies, but they still operate in the real world. Many scammers pretend to be well-known businesses to gain trust and make their stories seem more believable. [1] , [2] And scammers use real-world methods to contact people and to get paid. Reports to the FTC’s Consumer Sentinel Network point to some of their favorites. Let’s start with the most-impersonated companies. According to 2023 reports, Best Buy’s Geek Squad, Amazon, and PayPal top that list. But reported losses tell a different story: losses were highest when scammers impersonated Microsoft and Publishers Clearing House. [3]  The scammers impersonating these businesses work in very different ways. For example, phony Geek Squad emails tell you that a computer service you never signed up for is about to renew – to the tune of several hundred dollars. Microsoft impersonation scams start with a fake security pop-up warning on your computer with a number to call for “help.” [4]  And calls from the fake Publishers Clearing House say you’ll have to pay fees to collect your (fake) sweepstakes winnings.   Reports about all types of fraud also tell us how scammers contacted their targets. Last year, people told us that scammers were most often reaching out by email and phone calls. But people also told us that they lost the most money on scams that started on social media. [5] People most frequently named Facebook and Instagram in these reports, [6]  and most often reported online shopping scams that started with ads on social media. However, the largest reported losses to scams starting on social media platforms were to investment scams. How scammers get their money varies by the type of scam, too. For example, people who report investment scams most often say they “invested” with cryptocurrency or via bank transfer. [7]  Reported payments to scammers by these two methods added up to the highest losses in 2023, both per person and in total. [8]  And many people reported using payment apps and services, most often in connection with online shopping scams. [9]  Most people who reported using a payment app or service named the company they used, with PayPal, Cash App, Zelle, Venmo, and Apple Pay most often reported in 2023. Gift cards were the top reported payment method on several types of scams in 2023, including romance scams, tech support scams, government impersonation scams, and scams that impersonate people you know, like your boss or a grandchild. Reports show that scammers specify what gift card brand to buy, which most people named in their reports. In 2023, Apple cards were far and away the most reported gift card brand, followed by Target, eBay, Walmart and Amazon gift cards. [10] So, how can you spot and avoid these and other scams? And what can businesses do? At minimum, make it easier for customers to reach you to find out what communications are legit. Of course, shifting responsibility onto your customers isn’t the answer, so look to your workforce’s ingenuity to deploy solutions that protect your loyal customers and your good name. To spot and avoid scams – and learn how to recover money if you paid a scammer – visit  ftc.gov/scams . Visit  business.ftc.gov  to get resources and advice for businesses. Report scams to the FTC at  ReportFraud.ftc.gov   [1] In 2023, about 332,000 people reported a business impersonation scam, far more than any other fraud type, and reported losses totaled over $660 million. These figures, and figures throughout this Spotlight, exclude reports provided by data contributors. Because the vast majority of frauds are not reported to the government, these figures reflect just a small fraction of the public harm. See Anderson, K. B., To Whom Do Victims of Mass-Market Consumer Fraud Complain? at 1 (May 2021), available at  https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3852323  (study showed only 4.8% of people who experienced mass-market consumer fraud complained to a Better Business Bureau or a government entity).   [2] Government agencies, including the FTC, are often impersonated as well. For more information about government impersonation reporting data, including the most reported agencies, see FTC’s interactive  Tableau Public infographic .   [3] Microsoft impersonation reports are generally classified as tech support scams and Publishers Clearing House impersonation reports are generally classified as prizes, sweepstakes, and lotteries. These two Sentinel fraud types were included in this analysis in addition to the business imposter fraud type as they generally include reports about impersonated companies.   [4] See FTC Consumer Alert, New tech support scammers want your life savings (March 2024) available at  https://consumer.ftc.gov/consumer-alerts/2024/03/new-tech-support-scammers-want-your-life-savings   [5] Reported losses to fraud that started on social media by year are as follows: $237M (2020), $729M (2021), $1.1B (2022), $1.4B (2023). More money was reported lost to fraud starting on social media than any other contact method in 2021, 2022, and 2023. For more information about contact method and payment method reporting data, see FTC’s interactive  Tableau Public dashboard .   [6] In 2023, 51% of reports about fraud starting on social media identified Facebook as the social media platform, and 22% identified Instagram. This excludes reports that did not identify a social media platform.   [7] Of the $1.8 billion reported lost to investment-related fraud in 2023, $707 million was lost using cryptocurrency and $689 million was lost using bank transfers.   [8] In 2023, compared to all other payment methods, total reported losses were highest on bank transfers ($1.7B) followed by cryptocurrency ($1.2B), and median individual reported losses were highest on cryptocurrency ($5,000) followed by bank transfers ($4,581).     [9]Credit cards, debit cards, and payment apps and services were the top three most reported payment methods, though people tended to report losing less money to the scammer. In 2023, the median individual reported losses for these payment methods were as follows: payment app or service ($380), credit card ($136), and debit card ($110).   [10] For earlier Sentinel data about gift card brands, see FTC Data Spotlight, Scammers prefer gift cards, but not just any card will do (December 2021) available at  https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2021/12/scammers-prefer-gift-cards-not-just-any-card-will-do .",
  "summary": "Scammers are all about spinning lies, but they still operate in the real world.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection"
  ],
  "image_urls": [
    "https://www.ftc.gov/system/files/styles/scaled_lg/private/ftc_gov/images/Data-Spotlight-Scammers-Impersonate-Some-Companies-More-Than-Others-v2.png?itok=LVWz0Elf",
    "https://www.ftc.gov/system/files/styles/scaled_lg/private/ftc_gov/images/Data-Spotlightv2.png?itok=kTdQ-Fau"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/system/files/styles/scaled_lg/private/ftc_gov/images/Data-Spotlight-Scammers-Impersonate-Some-Companies-More-Than-Others-v2.png?itok=LVWz0Elf",
      "path": "full/7f17f2098acabb8304a2801b608414e484bbbeb1.jpg",
      "checksum": "9e88a677df4cd5152884375b9f5183d7",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/system/files/styles/scaled_lg/private/ftc_gov/images/Data-Spotlightv2.png?itok=kTdQ-Fau",
      "path": "full/056dafe695d7af62688f32479098defa650f27a3.jpg",
      "checksum": "50456d33df348b449b9bba493f7ed3d2",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Stop and check it out. Before you do anything else, talk with someone you trust. Anyone who’s rushing you into sending money, buying gift cards, or investing in cryptocurrency is almost certainly a scammer.",
    "Never click on links or respond to unexpected messages, and never trust caller ID. If you think a story might be legit, contact the company or agency using a phone number or website you know is real.",
    "Don’t pay anyone who demands that you pay by gift card, cryptocurrency, money transfer, or payment app. Only scammers say there’s only one way to pay.",
    "Consumer Protection",
    "Bureau of Consumer Protection"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Stop and check it out. Before you do anything else, talk with someone you trust. Anyone who’s rushing you into sending money, buying gift cards, or investing in cryptocurrency is almost certainly a scammer.",
      "links": []
    },
    {
      "index": 2,
      "text": "Never click on links or respond to unexpected messages, and never trust caller ID. If you think a story might be legit, contact the company or agency using a phone number or website you know is real.",
      "links": []
    },
    {
      "index": 3,
      "text": "Don’t pay anyone who demands that you pay by gift card, cryptocurrency, money transfer, or payment app. Only scammers say there’s only one way to pay.",
      "links": []
    },
    {
      "index": 4,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 5,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2024/04/impersonation-scams-not-what-they-used-be",
  "scraped_at": "2025-11-15T20:49:41.872570",
  "title": "Impersonation scams: not what they used to be",
  "published_date": "2024-04-01",
  "full_text": "Scams that impersonate well-known businesses and government agencies are consistently among the top frauds reported to the FTC’s Consumer Sentinel Network. [1]  In 2023, data from the FTC alone show more than 330,000 reports of business impersonation scams and nearly 160,000 reports of government impersonation scams. [2]  That amounts to nearly half the frauds reported directly to the agency. [3]  Combined, reported losses to these impersonation scams topped $1.1 billion for the year, more than three times what consumers reported in 2020. [4] While these types of scams aren’t new, reports tell us scammers have switched things up. Comparing 2020 to 2023, for example, reports of scams starting with a phone call have plummeted, while reports of scams starting with a text or email have increased. In that same period, people reported skyrocketing losses through bank transfer [5]  and cryptocurrency. And reports show an increasingly blurred line between business and government impersonation scams: many scammers impersonate more than one organization in a single scam – for example, a fake Amazon employee might transfer you to a fake bank or even a fake FBI or FTC employee for fake help. [6] While these scams come in many different forms, the top five described below account for nearly half of 2023 reports. [7] 1. Copycat account security alerts Topping the list are messages about supposed suspicious activity or unauthorized charges. The message might say it’s from Amazon, alerting you that someone’s ordered a big-ticket item using your account. Or it might look like it’s your bank, asking you to verify a charge. These messages often include a phone number to call or ask you to text back YES or NO. Though scammers are convincing, it’s not really Amazon or your bank. It’s a scammer who says they can help fix the problem, which is also fake. What they tell you to do is really designed to steal your money. Often, this means transferring funds or loading cash into a Bitcoin ATM to “protect” it.    2. Phony subscription renewals Up next are scams that look like routine email notices that an account you never opened is about to auto-renew to the tune of hundreds of dollars. Often, they say it’s an account with Geek Squad. [8]  Of course, it’s not really Geek Squad; it’s a scammer. If you call to sort it out, they’ll say they have to connect to your computer to process your “refund.” Once in, they make it look like too much money was refunded. They demand that you return the difference, often by buying gift cards and giving them the numbers on the back. 3. Fake giveaways, discounts, or money to claim A message about a giveaway, discount, or free money may seem to come from a company you know – say, discounts from your internet provider, a giveaway from a big retailer, or sweepstakes winnings from Publishers Clearing House. Sometimes the so-called offer is about government money you can supposedly claim. These stories are all just another set-up to steal your money. The story ends with you buying gift cards or sending money to claim the deal, gift, or sweepstakes. And that’s always a sign of a scam. 4. Bogus problems with the law Scammers pretending to be government agents say your identity has been used to commit a serious crime – often, they claim, money laundering or drug smuggling. They then offer to help you fix the supposed problem, which always involves them telling you to move money or put it on gift cards. For example, many people reported being told to load cash into Bitcoin ATMs to supposedly protect their funds during a so-called investigation. The scammers even called these ATMs “safety lockers.” But this is another scam, and every part of the story is a lie. Money you move is money they steal. 5. Made - up package delivery problems Messages pretending to be from the U.S. Postal Service, UPS, or FedEx say there’s a problem with a delivery. They include a link to a website that looks real – but isn’t. Some ask for your bank account details. Others ask you to pay a small “redelivery fee,” but if you do, the scammer now has your credit card information. And, reports tell us, these scammers quickly start racking up fraudulent charges. All these scams have tactics that scammers hope give them an advantage. First, their messages look a lot like the messages real companies send: emails or texts about special deals and security alerts on your accounts. Second, they play on your emotions: if you’re worried about a problem or excited about a free gift, it can be harder to spot signs of a scam. Finally, they reframe their demands for money to avoid setting off alarm bells: people who’d never send money to a stranger have emptied their accounts, believing they were “protecting” their funds. So how can you spot and avoid these scams? Learn more about  impersonator scams . To spot and avoid scams – and learn how to recover money if you paid a scammer – visit  ftc.gov/scams . Report scams to the FTC at  ReportFraud.ftc.gov . [1] In 2023, business imposter scams were the most reported fraud subcategory, and government imposter scams were the third most reported. These fraud subcategories also ranked among the top three most reported frauds in 2020, 2021, and 2022. This excludes reports categorized as unspecified. [2] This figure and figures throughout this Spotlight are based on reports directly to the FTC. The combined number of business imposter and government imposter reports by year are as follows: 316K (2020), 529K (2021), 458K (2022), 487K (2023). Some reports are classified as both business imposter and government imposter. Because the vast majority of frauds are not reported to the government, these figures reflect just a small fraction of the public harm. See Anderson, K. B., To Whom Do Victims of Mass-Market Consumer Fraud Complain? at 1 (May 2021), available at https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3852323 (study showed only 4.8% of people who experienced mass-market consumer fraud complained to a Better Business Bureau or a government entity). [3] Excluding reports classified as unspecified, 48% of reports directly to the FTC in 2023 were classified as business imposter or government imposter or both. [4] The combined reported losses to business imposter and government imposter reports by year are as follows: $310M (2020), $673M (2021), $961M (2022), $1.1B (2023). [5] \"Bank transfer\" refers to a payment category in Sentinel that includes bank wire transfers and ACH payments. Some consumers also select this option for Zelle payments. [6] Reports about FTC impersonation have increased about five-fold since 2020. See FTC Consumer Alert, The FTC won’t demand money, threaten you, or promise you a prize (July 2023) available at   https://consumer.ftc.gov/consumer-alerts/2023/07/ftc-wont-demand-money-threaten-you-or-promise-you-prize [7] The top scam types were identified by hand-coding a random sample of 850 reports filed in 2023 classified as business imposter or government imposter that included a narrative describing the consumer’s experience. [8] More people reported impersonation of Geek Squad in 2023 than any other impersonated company. The number of reports about Geek Squad impersonation increased over 100-fold from 2020 to 2023. These scams have contributed heavily to the rise of email as the most reported fraud contact method in 2023. See FTC Consumer Alert, How to recognize a fake Geek Squad renewal scam (October 2022) available at  https://consumer.ftc.gov/consumer-alerts/2022/10/how-recognize-fake-geek-squad-renewal-scam .",
  "summary": "Scams that impersonate well-known businesses and government agencies are consistently among the top frauds reported to the FTC’s Consumer Sentinel Network.[1] I",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "deceptive/misleading conduct"
  ],
  "image_urls": [
    "https://www.ftc.gov/system/files/styles/ftc_scaled_medium_800_/private/ftc_gov/images/contact_methods.png?itok=MRqoaZ-I",
    "https://www.ftc.gov/system/files/styles/ftc_scaled_medium_800_/private/ftc_gov/images/payment_methods.png?itok=qTjP2Czj"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/system/files/styles/ftc_scaled_medium_800_/private/ftc_gov/images/contact_methods.png?itok=MRqoaZ-I",
      "path": "full/44172d998f8100e8f983dacdf22f3d7a38e26f9a.jpg",
      "checksum": "6569600089b1675e739a83198d59c48b",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/system/files/styles/ftc_scaled_medium_800_/private/ftc_gov/images/payment_methods.png?itok=qTjP2Czj",
      "path": "full/c7401c702c7e20146d8a98cb9cb6c3baca646a38.jpg",
      "checksum": "0688e165800e8e12adc28982eeda966a",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Never click on links or respond to unexpected messages. If you think a story might be legit, contact the company or agency using a phone number or website you know is real. Don’t use the information in the message.",
    "Don’t believe anyone who says you need to buy gift cards, use a Bitcoin ATM, or move money to protect it or fix a problem. Real businesses and government agencies will never do that – and anyone who asks is a scammer.",
    "Slow down. Scammers want to rush you, so, again: stop and check it out. Before you do anything else, talk with someone you trust. Anyone who’s rushing you into paying or giving information is almost certainly a scammer.",
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "deceptive/misleading conduct"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Never click on links or respond to unexpected messages. If you think a story might be legit, contact the company or agency using a phone number or website you know is real. Don’t use the information in the message.",
      "links": []
    },
    {
      "index": 2,
      "text": "Don’t believe anyone who says you need to buy gift cards, use a Bitcoin ATM, or move money to protect it or fix a problem. Real businesses and government agencies will never do that – and anyone who asks is a scammer.",
      "links": []
    },
    {
      "index": 3,
      "text": "Slow down. Scammers want to rush you, so, again: stop and check it out. Before you do anything else, talk with someone you trust. Anyone who’s rushing you into paying or giving information is almost certainly a scammer.",
      "links": []
    },
    {
      "index": 4,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 5,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    },
    {
      "index": 6,
      "text": "Imposter",
      "links": [
        "https://www.ftc.gov/imposter"
      ]
    },
    {
      "index": 7,
      "text": "deceptive/misleading conduct",
      "links": [
        "https://www.ftc.gov/terms/deceptivemisleading-conduct"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2024/09/bitcoin-atms-payment-portal-scammers",
  "scraped_at": "2025-11-15T20:49:45.873867",
  "title": "Bitcoin ATMs: A payment portal for scammers",
  "published_date": "2024-09-03",
  "full_text": "Bitcoin ATMs (or BTMs) [1]  have been popping up at convenience stores, gas stations, and other high-traffic areas for years. [2]  For some, they’re a convenient way to buy or send crypto, but for scammers they’ve become an easy way to steal. FTC Consumer Sentinel Network data show that fraud losses at BTMs are skyrocketing, increasing nearly tenfold from 2020 to 2023, and topping $65 million in just the first half of 2024. [3]  Since the vast majority of frauds are not reported, this likely reflects only a fraction of the actual harm. [4] Cryptocurrency surged as a major payment method for scams in recent years, along with the massive growth in crypto payments on fake investment opportunities. [5]  But now crypto is a top payment method for many other scams, too. [6]  Widespread access to BTMs has helped make this possible. Reports of losses using BTMs are overwhelmingly about government impersonation, business impersonation, and tech support scams. [7]  And when people used BTMs, their reported losses are exceptionally high. In the first six months of 2024, the median loss people reported was $10,000. [8] In the first half of the year, people 60 and over were more than three times as likely as younger adults to report a loss using a BTM. [9]   In fact, more than two of every three dollars reported lost to fraud using these machines was lost by an older adult. [10] Scams that use BTMs work in lots of different ways. Many start with a call or message about supposed suspicious activity or unauthorized charges on an account. [11]  Others get your attention with a fake security warning on your computer, often impersonating a company like Microsoft or Apple. These things are hard to ignore, and that’s the point. From there, the story quickly escalates. They might say all your money is at risk, or your information has been linked to money laundering or even drug smuggling. The scammer may get a fake government agent on the line – maybe even claiming to be from the “FTC” – to up the ante. So where do BTMs fit into the story? Scammers claim that depositing cash into these machines will protect your money or fix the fake problem they’ve concocted. They’ve even called BTMs “safety lockers.” They direct you to go to your bank to take out cash. Next, they send you to a nearby BTM location – often a specific one – to deposit the cash you just took out of your bank account. [12]  They text you a QR code to scan at the machine, and once you do, the cash you deposit goes right into the scammer’s wallet. So how can you spot and steer clear of these scams? To spot and avoid scams visit  ftc.gov/scams . Report scams to the FTC at  ReportFraud.ftc.gov . [1] While machines that allow consumers to buy cryptocurrency are commonly referred to as Bitcoin ATMs or BTMs, these machines often handle – and scams can take place in – other cryptocurrencies in addition to Bitcoin. [2] BTM installations self-reported by operators to an industry website increased from about 4,250 in January 2020 to about 32,000 in June 2024. See trend chart available at  https://coinatmradar.com/charts/growth/united-states/ [3] These and other figures throughout this Spotlight are estimates based on keyword analysis of the narratives provided in reports that identified cryptocurrency as the payment method. Not all reports identify a payment method or include sufficient details in the report narrative to determine whether a BTM was used. [4] See Anderson, K. B., To Whom Do Victims of Mass-Market Consumer Fraud Complain? at 1 (May 2021), available at  https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3852323 (study showed only 4.8% of people who experienced mass-market consumer fraud complained to a Better Business Bureau or a government entity). [5] See FTC Consumer Protection Data Spotlight, Reports Show Scammers Cashing in on Crypto Craze (June 3, 2022), available at  https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2022/06/reports-show-scammerscashing-crypto-craze . [6] In the first half of 2024, cryptocurrency was the top payment method in terms of aggregate reported losses on tech support scams and job scams, and the second most costly method after bank transfers on business impersonation scams, government impersonation scams, romance scams, and family and friend impersonation scams. [7] In the first half of 2024, about 86% of people who reported a fraud loss using a BTM indicated that it was on a government impersonation, business impersonation, and/or tech support scam. This excludes reports categorized as unspecified. [8] In the first half of 2024, the median individual reported fraud loss when cryptocurrency was the reported payment method (including reports with and without BTM use) was $5,400; the median individual reported loss to fraud generally was $447. [9] This comparison of older and younger consumers’ reporting rates is normalized based on the population size of each age group using the Census Bureau’s 2018-2022 American Community Survey 5-Year Estimates. This excludes reports that did not include consumer age information. [10] In the first half of 2024, people 60 and over reported losing $46 million using BTMs, or about 71% of the reported losses using these machines. During the same period, when a reported cryptocurrency fraud loss did not involve the use of a BTM, about 72% of the losses were reported by people 18 to 59. Most of these losses were to fake cryptocurrency investment opportunities. Percentage calculations exclude reports that did not include consumer age information. [11] Phone calls were the initial contact method in about 47% of these reports, followed by online ads or pop-ups (16%), and e-mails (9%). Reports indicating online ad or pop-up as the contact method typically described fake computer security alerts. People reported that security pop-ups and email messages included a phone number to call for help. [12] Reports show that scammers direct people to specific BTM locations and many consumers name the BTM operator in their reports. These details show a pattern that suggests scammers prefer some operators over others and that these preferences have changed over time. While the reports do not tell us why this might be, differences in fraud prevention measures taken by various operators likely play a role.",
  "summary": "Bitcoin ATMs (or BTMs)[1] have been popping up at convenience stores, gas stations, and other high-traffic areas for years.[2]",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Money Transfers",
    "Consumer Sentinel Network",
    "deceptive/misleading conduct",
    "Finance",
    "Credit and Finance",
    "Privacy and Security",
    "Tech",
    "FinTech"
  ],
  "image_urls": [
    "https://www.ftc.gov/system/files/styles/ftc_scaled_medium_800_/private/ftc_gov/images/reported_btm_fraud_losses_by_year.png?itok=W23n1Hby"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/system/files/styles/ftc_scaled_medium_800_/private/ftc_gov/images/reported_btm_fraud_losses_by_year.png?itok=W23n1Hby",
      "path": "full/457111f7b7cf3311f89caf7599fbfd7932815d22.jpg",
      "checksum": "cc2085049d87707a247670008ad088a9",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Never click on links or respond directly to unexpected calls, messages, or computer pop-ups. If you think it could be legit, contact the company or agency, but look up their number or website yourself. Don't use the one the caller or message gave you.",
    "Slow down. Scammers want to rush you, so stop and check it out. Before you do anything else, talk with someone you trust.",
    "Never withdraw cash in response to an unexpected call or message. Only scammers will tell you to do that.",
    "Don’t believe anyone who says you need to use a Bitcoin ATM, buy gift cards, or move money to protect it or fix a problem. Real businesses and government agencies will never do that – and anyone who asks is a scammer.",
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Money Transfers",
    "Consumer Sentinel Network",
    "deceptive/misleading conduct",
    "Finance",
    "Credit and Finance",
    "Privacy and Security",
    "Tech",
    "FinTech"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Never click on links or respond directly to unexpected calls, messages, or computer pop-ups. If you think it could be legit, contact the company or agency, but look up their number or website yourself. Don't use the one the caller or message gave you.",
      "links": []
    },
    {
      "index": 2,
      "text": "Slow down. Scammers want to rush you, so stop and check it out. Before you do anything else, talk with someone you trust.",
      "links": []
    },
    {
      "index": 3,
      "text": "Never withdraw cash in response to an unexpected call or message. Only scammers will tell you to do that.",
      "links": []
    },
    {
      "index": 4,
      "text": "Don’t believe anyone who says you need to use a Bitcoin ATM, buy gift cards, or move money to protect it or fix a problem. Real businesses and government agencies will never do that – and anyone who asks is a scammer.",
      "links": []
    },
    {
      "index": 5,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 6,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    },
    {
      "index": 7,
      "text": "Imposter",
      "links": [
        "https://www.ftc.gov/imposter"
      ]
    },
    {
      "index": 8,
      "text": "Money Transfers",
      "links": [
        "https://www.ftc.gov/money-transfers"
      ]
    },
    {
      "index": 9,
      "text": "Consumer Sentinel Network",
      "links": [
        "https://www.ftc.gov/terms/consumer-sentinel-network"
      ]
    },
    {
      "index": 10,
      "text": "deceptive/misleading conduct",
      "links": [
        "https://www.ftc.gov/terms/deceptivemisleading-conduct"
      ]
    },
    {
      "index": 11,
      "text": "Finance",
      "links": [
        "https://www.ftc.gov/industry/finance"
      ]
    },
    {
      "index": 12,
      "text": "Credit and Finance",
      "links": [
        "https://www.ftc.gov/business-guidance/credit-finance"
      ]
    },
    {
      "index": 13,
      "text": "Privacy and Security",
      "links": [
        "https://www.ftc.gov/business-guidance/privacy-security"
      ]
    },
    {
      "index": 14,
      "text": "Tech",
      "links": [
        "https://www.ftc.gov/business-guidance/privacy-security/tech"
      ]
    },
    {
      "index": 15,
      "text": "FinTech",
      "links": [
        "https://www.ftc.gov/business-guidance/credit-finance/fintech"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2024/12/paying-get-paid-gamified-job-scams-drive-record-losses",
  "scraped_at": "2025-11-15T20:49:46.197621",
  "title": "Paying to get paid: gamified job scams drive record losses",
  "published_date": "2024-12-12",
  "full_text": "A job you truly enjoy is a good thing, but if the work feels more like an online game than an actual job, you can bet it’s a scam. Reported losses to job scams increased more than threefold from 2020 to 2023 and, in just the first half of 2024, topped $220 million.  [1]  Driving this trend are skyrocketing reports about gamified job scams, often called task scams. About 20,000 people reported these scams in the first half of the year, compared to about 5,000 in all of 2023.  [2]  Since the vast majority of frauds are not reported, this likely reflects only a fraction of the actual harm. [3]     Task scams ask you to do simple repetitive tasks such as liking videos or rating product images. Your “job” is to complete these tasks in an app or online platform that creates the illusion you’re racking up commissions with every click. Tasks are often assigned in sets of forty, with the promise of leveling up once you complete your set. You may even get a so-called double task that earns a bigger commission. Many people report getting small payouts at first, which give them greater trust in the system.  So how do these scammers  steal  your money while making you think you’re  earning  money? At some point, they’ll say you have to make a deposit to complete your next set of tasks and get your supposed earnings out of the app. You “charge up” your account to avoid losing what the app shows you’ve earned, believing you’ll get all the money you deposited back, along with your commission, once you complete the set. But no matter what the system says you’ve earned, you didn’t. That money isn’t real. And if you deposit money, you won’t get it back.  Task scams work in many different ways, but they have some common elements. First, the scam typically starts with an unexpected text or WhatsApp message offering online work but no specifics. Second, they say you’ll be completing “tasks” and will often use buzzwords like “product boosting” or “app optimization.” And third, they’re designed to hook you – these scammers know it can be hard to cut your losses, and the apps they use make those fake earnings seem very real. Sometimes they even go a step further to try to keep you in the game: if you hesitate to deposit money, scammers will often invite you to a group chat where newcomers hear supposed success stories from (fake) experienced workers. Reports show crypto is the currency of choice for these scams. These payments have helped drive skyrocketing cryptocurrency losses to job scams generally – about $41 million in the first half of 2024, compared to about $21 million in all of 2023. People now report losing far more money to job scams using cryptocurrency than any other method of payment. So how can you spot and avoid these scams? To learn more about spotting and avoiding scams, visit  ftc.gov/scams . Report scams to the FTC at  ReportFraud.ftc.gov .   [1] These figures are based on fraud reports to the FTC’s Consumer Sentinel Network classified as job scams and employment agencies. Reported dollar losses by year are as follows: $223M (2024 through June), $286M (2023), $179M (2022), $131M (2021), $90M (2020). These figures are available with quarterly updates on  FTC’s Tableau Public dashboard . [2] Task scam figures here and throughout this Spotlight are estimates based on hand-coding a random sample of 500 job scam reports for each year (2,500 total). Reports that did not included a narrative describing the consumer's experience were excluded. The share of reports identified as task scams for each year was then multiplied by the total number of job scam reports in that respective year to estimate the totals for each year. In the first half of 2024, 38.8% were identified as task scams, compared to 5.6% (2023), 1.6% (2022), and .6% (2021). No task scams were identified in the sample of 2020 reports. [3] See  Anderson, K. B., To Whom Do Victims of Mass-Market Consumer Fraud Complain?  at 1 (May 2021) (study showed only 4.8% of people who experienced mass-market consumer fraud complained to a Better Business Bureau or a government entity). [4] See FTC Press Release,  Federal Trade Commission Announces Final Rule Banning Fake Reviews and Testimonials  (August 14, 2024).",
  "summary": "A job you truly enjoy is a good thing, but if the work feels more like an online game than an actual job, you can bet it’s a scam.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Jobs"
  ],
  "image_urls": [
    "https://www.ftc.gov/system/files/styles/ftc_scaled_medium_800_/private/ftc_gov/images/task-scam-reports-by-year-image.png?itok=XRE-J6m-"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/system/files/styles/ftc_scaled_medium_800_/private/ftc_gov/images/task-scam-reports-by-year-image.png?itok=XRE-J6m-",
      "path": "full/2693f4379012cd9a561b18925db3b0fb0a44f906.jpg",
      "checksum": "c681e423a2646d61ddd125810fc4c05c",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Ignore generic and unexpected texts or WhatsApp messages about jobs. Real employers will never contact you that way.",
    "Never pay anyone to get paid. Someone telling you to pay money to get the money you’ve supposedly earned is a sure sign of a scam. No legit business would ever do that.",
    "Don’t trust anyone who says they’ll pay you to rate or “like” things online. That’s illegal and no honest company will do it.  [4]",
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Jobs"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Ignore generic and unexpected texts or WhatsApp messages about jobs. Real employers will never contact you that way.",
      "links": []
    },
    {
      "index": 2,
      "text": "Never pay anyone to get paid. Someone telling you to pay money to get the money you’ve supposedly earned is a sure sign of a scam. No legit business would ever do that.",
      "links": []
    },
    {
      "index": 3,
      "text": "Don’t trust anyone who says they’ll pay you to rate or “like” things online. That’s illegal and no honest company will do it.  [4]",
      "links": [],
      "statistics": [
        "4"
      ]
    },
    {
      "index": 4,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 5,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    },
    {
      "index": 6,
      "text": "Jobs",
      "links": [
        "https://www.ftc.gov/jobs"
      ]
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/data-visualizations/data-spotlight/2025/04/top-text-scams-2024",
  "scraped_at": "2025-11-15T20:50:11.694661",
  "title": "Top text scams of 2024",
  "published_date": "2025-04-14",
  "full_text": "It’s hard not to glance at your phone when you hear the ding of an incoming text. [1]  Scammers bet on it. And reports to the FTC’s Consumer Sentinel Network suggest their odds of a big payout have improved: reported losses to text scams have skyrocketed even as the number of reports declined. In 2024, people reported $470 million in losses to these scams, more than five times the 2020 number. [2]  And since the vast majority of frauds are never reported, this number likely reflects only a fraction of the actual harm. [3] While there are countless varieties of text scams, the top five described below are estimated to account for about half of all text frauds reported to the FTC’s Consumer Sentinel Network in 2024. [4] 1) Fake package delivery problems Messages about package deliveries, usually from someone pretending to be from the U.S. Postal Service, were the most reported text scam last year. These messages say there’s a problem with a delivery and link to a website that looks like the real USPS site – but isn’t. Many people reported paying a small “redelivery fee” that turned out to be a trick to get their credit card or even Social Security number.  2) Phony job opportunities Scammers posing as recruiters to take people’s money isn’t new. But in 2024, reports of a new “task scam” took off. [5]  These scams often start with an unexpected text offering work without specifics. The “job” is to complete simple repetitive tasks like rating products or apps. But it’s all fake. At some point, people are told to send money to finish their tasks and withdraw their supposed earnings. But people who sent money said that they didn’t get it back. 3) Fake fraud alerts Many people reported texts about so-called suspicious activity or a big purchase they didn’t make. These texts often look like they’re from a bank or Amazon. They might give a number to call. Or they might say to reply YES or NO to verify a large transaction. People who reply are connected to the (fake) fraud department for “help” fixing the made-up problem. These scammers quickly up the ante, often telling people all their money is at risk. The scammers then pressure people into moving money out of their accounts to supposedly keep it safe, but it really goes to the scammers. And people who move that money do not get any of it back. 4) Bogus notices about unpaid tolls Scammers are sending texts that look like they’re from highway toll programs all over the country, from SunPass in Florida to FasTrak in San Francisco. These scammers tell people to click a link to pay an unpaid balance, but neither the charges nor the message are legit. Reports show these scammers are really after credit card and even Social Security numbers. 5) “Wrong number” texts that aren’t Wrong number scams start with an out-of-the-blue message that looks innocent enough – it might just say “hello” or “do you want to get a coffee?” But a simple act of kindness – responding to let a stranger know they have the wrong number – can be the start of a very costly scam. Reports show these scammers strike up a fake friendship, often with romantic undertones. Next, they claim to be successful investors, offering to share their tricks and directing people to bogus investment platforms. People report losing all the money they “invest,” often tens of thousands of dollars. Here are some things you can do to help stop text scams: How can you avoid text scams? To learn more about how to spot and avoid scams – and how to recover money if you’ve paid a scammer – visit  ftc.gov/scams . Learn more about text scams at  ftc.gov/textscams .     [1] Text message open rates are estimated to be as high as 98%, and response rates as high as 45%, as compared to email open and response rates of 20% and 6% respectively. More than half of consumers text daily, making texting more common than any other communication method, including voice or email. See FCC, Consumer Advisory Committee, Report on the State of Text Messaging at 5 (August 2022), available at  https://files.fcc.gov/ecfs/download/20970528-9c2e-400d-951b-1024118e50fb?orig=true&pk=cb77b2ec-1a58-dbc6-139b-ad192cfd5d9b .  [2] The share of text scam reports indicating that money was lost increased as follows: 5% (2020), 4% (2021), 6% (2022), 9% (2023), 11% (2024). These figures are available with quarterly updates at  https://public.tableau.com/shared/MNHYNJWNT?:display_count=n&:origin=viz_share_link . [3] See  Anderson, K. B., To Whom Do Victims of Mass-Market Consumer Fraud Complain?  at 1 (May 2021) (study showed only 4.8% of people who experienced mass-market consumer fraud complained to a Better Business Bureau or a government entity). [4] The top text scams were identified by hand-coding a random sample of 1,000 2024 text fraud reports containing a narrative description. The scam types identified here do not replace the subcategories the FTC publishes in its annual Consumer Sentinel Network Data Book, but rather provide more detail. For example, most toll and delivery scams are classified as imposter scams. The most recent aggregate data on text scams is available at  https://public.tableau.com/shared/P3J7W6S4N?:display_count=n&:origin=viz_share_link . [5] See the  December 2024 Data Spotlight  for more information about task scams.",
  "summary": "It’s hard not to glance at your phone when you hear the ding of an incoming text. Scammers bet on it. And reports to the FTC’s Consumer Sentinel Network suggest their odds of a big payout have improved: reported losses to text scams have skyrocketed even as the number of reports declined. In 2024, people reported $470 million in losses to these scams, more than five times the 2020 number. And since the vast majority of frauds are never reported, this number likely reflects only a fraction of the actual harm.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection"
  ],
  "image_urls": [
    "https://www.ftc.gov/system/files/styles/scaled_lg/private/ftc_gov/images/trend-visual-new.png?itok=hVUiRlr7",
    "https://www.ftc.gov/system/files/styles/scaled_lg/private/ftc_gov/images/top%20types.png?itok=oDXvdVDB"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/system/files/styles/scaled_lg/private/ftc_gov/images/trend-visual-new.png?itok=hVUiRlr7",
      "path": "full/c54d17036cf223bd12d232700f0c5632bcb5548b.jpg",
      "checksum": "e12b468f451bc2588548c2131f642b0e",
      "status": "downloaded"
    },
    {
      "url": "https://www.ftc.gov/system/files/styles/scaled_lg/private/ftc_gov/images/top%20types.png?itok=oDXvdVDB",
      "path": "full/cf9bbe0af15c442ec10ea15f9de1731e05b6122d.jpg",
      "checksum": "4bd418297e1ad1c3c8dbbd88ce334158",
      "status": "downloaded"
    }
  ],
  "relevant_data": [
    "Forward messages to  7726 (SPAM) . This helps your wireless provider spot and block similar messages.",
    "Report it on either the  Apple iMessages app  or  Google Messages app  for Android users.",
    "Report it to the FTC at  ReportFraud.ftc.gov .",
    "Never click on links or respond to unexpected texts.  If you think it might be legit, contact the company using a phone number or website you know is real. Don’t use the information in the text message.",
    "Filter unwanted texts before they reach you.  There are a few ways to  block unwanted texts .",
    "Consumer Protection",
    "Bureau of Consumer Protection"
  ],
  "sources": [
    {
      "index": 1,
      "text": "Forward messages to  7726 (SPAM) . This helps your wireless provider spot and block similar messages.",
      "links": [
        "https://www.ctia.org/consumer-resources/protecting-yourself-from-spam-text-messages"
      ],
      "statistics": [
        "7726"
      ]
    },
    {
      "index": 2,
      "text": "Report it on either the  Apple iMessages app  or  Google Messages app  for Android users.",
      "links": [
        "https://support.apple.com/en-us/HT201229",
        "https://support.google.com/messages/answer/9061432?hl=en&co=GENIE.Platform%3DAndroid&oco=1"
      ]
    },
    {
      "index": 3,
      "text": "Report it to the FTC at  ReportFraud.ftc.gov .",
      "links": [
        "https://reportfraud.ftc.gov/"
      ]
    },
    {
      "index": 4,
      "text": "Never click on links or respond to unexpected texts.  If you think it might be legit, contact the company using a phone number or website you know is real. Don’t use the information in the text message.",
      "links": []
    },
    {
      "index": 5,
      "text": "Filter unwanted texts before they reach you.  There are a few ways to  block unwanted texts .",
      "links": [
        "https://consumer.ftc.gov/articles/how-recognize-and-report-spam-text-messages#what_to_do"
      ]
    },
    {
      "index": 6,
      "text": "Consumer Protection",
      "links": [
        "https://www.ftc.gov/consumer-protection"
      ]
    },
    {
      "index": 7,
      "text": "Bureau of Consumer Protection",
      "links": [
        "https://www.ftc.gov/bureau-consumer-protection"
      ]
    }
  ]
}
]