[
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/10/ftc-approves-final-divestiture-order-synopsys-ansys-deal",
  "scraped_at": "2025-11-13T22:18:20.503540",
  "title": "FTC Approves Final Divestiture Order in Synopsys and Ansys Deal",
  "published_date": "2025-10-17",
  "full_text": "The Federal Trade Commission finalized a consent order that requires Synopsys, Inc. and Ansys, Inc. to divest certain assets to resolve antitrust concerns surrounding their $35 billion merger. The FTC’s final  consent order  preserves competition across several software tool markets that are critical for the design of semiconductors and light simulation devices.  The final consent order resolves  FTC allegations  that the deal would eliminate head-to-head competition between Synopsys and Ansys in three critical software tool markets, leading to higher prices for the design of semiconductors and light simulation devices, as well as decreased innovation. Under the order, Synopsys is required to divest its optical software tools and its photonic software tools, while Ansys will divest a power consumption analysis tool called PowerArtist. Both Synopsys and Ansys will divest their assets to Keysight Technologies, Inc. Without the divestitures, the FTC alleged that the deal would ultimately harm device manufacturers and consumers.  Following a public comment period, the Commission voted 3-0 to approve the final order. Commissioner Mark R. Meador issued a  concurring statement .  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "The Federal Trade Commission finalized a consent order that requires Synopsys, Inc. and Ansys, Inc. to divest certain assets to resolve antitrust concerns surrounding their $35 billion merger.",
  "tags": [
    "Competition",
    "Bureau of Competition"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/operators-student-loan-forgiveness-scam-will-be-permanently-banned-debt-relief-industry-ordered-turn",
  "scraped_at": "2025-11-13T22:18:24.026822",
  "title": "Operators of Student Loan Forgiveness Scam Will Be Permanently Banned from Debt Relief Industry, Ordered to Turn Over Assets",
  "published_date": "2025-09-11",
  "full_text": "Eric Caldwell and David Hernandez will be permanently banned from the debt relief industry and required to turn over their assets to resolve Federal Trade Commission charges that they helped operate an illegal student loan debt-relief operation. Additionally, Caldwell will be banned from the telemarketing industry, and Hernandez will be prohibited from violating the Telemarketing Sales Rule. In its early 2025 amended  complaint, the FTC alleged that Nevada-based Superior Servicing , along with several other companies, and their operators, Caldwell, Hernandez, and Dennise Merdjanian, pretended to be affiliated with the Department of Education or its loan servicers to convince student loan borrowers about the legitimacy of their student loan debt-relief program. They required borrowers pay upfront fees that they claimed would be applied to consumers’ student loan balances, when, in reality, they were pocketing consumers’ hard-earned money. Individual defendants  Caldwell   and  Hernandez   have agreed to settle the FTC’s charges in proposed orders banning them from engaging in the debt relief industry.  Additionally, Caldwell’s proposed order bans him from engaging in telemarketing, and Hernandez’s proposed order prohibits him from violating the Telemarketing Sales Rule.  Furthermore, the proposed orders prohibit both of them from: The proposed orders impose a monetary judgment of more than $45.9 million that will be partially suspended, due to the defendants’ inability to pay, after they pay more than $1.6 million and turn over approximately $560,000 in personal and business assets. If either defendant is found to have materially misrepresented their finances, the full amount of the monetary judgment would become immediately due. Litigation continues against Merdjanian and the corporate defendants. The FTC has resources on how to avoid student loan debt relief scams at  ftc.gov/StudentLoans . Consumers can get assistance with their student loans for free at  StudentAid.gov . The Commission vote approving the stipulated final orders was 3-0.   The FTC filed the proposed orders in the U.S. District Court for the District of Nevada. Stipulated final orders have the force of law when approved and signed by the District Court Judge. The lead staff attorneys on this matter were Luis Gallegos and Reid Tepfer of the FTC’s Bureau of Consumer Protection assisted by FTC Investigator Kelle Slaughter. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Eric Caldwell and David Hernandez will be permanently banned from the debt relief industry and required to turn over their assets to resolve Federal Trade Commission charges that they helped operat",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Southwest Region",
    "Bureau of Consumer Protection",
    "Debt Relief",
    "Education",
    "Imposter",
    "deceptive/misleading conduct",
    "Advertising and Marketing",
    "Credit and Finance"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ed-tech-provider-chegg-pay-75-million-settle-ftc-allegations-concerning-unlawful-cancellation",
  "scraped_at": "2025-11-13T22:18:25.919640",
  "title": "Ed Tech Provider Chegg to Pay $7.5 Million to Settle FTC Allegations Concerning Unlawful Cancellation Practices",
  "published_date": "2025-09-15",
  "full_text": "Chegg Inc. will be required to pay $7.5 million to settle Federal Trade Commission allegations that the education technology provider made it extremely difficult for consumers to cancel recurring subscriptions while also failing to honor consumers’ cancellation requests. For years, Chegg failed to provide consumers, namely students and parents, with a simple mechanism to cancel auto-renewing subscriptions for online learning tools such as homework help and writing assistance tools, according to the FTC’s  complaint . Under a  proposed order  settling the FTC’s charges, Chegg will be required to provide a simple cancellation mechanism for consumers in addition to the $7.5 million payment.  “It harms the American people when companies fail to provide simple mechanisms to cancel recurring charges as Congress required in the Restore Online Shoppers’ Confidence Act,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection. “As part of our effort to reinvigorate the agency’s fraud program, the FTC will continue enforcing ROSCA against online sellers where they violate this important statute.” In its complaint, the FTC alleges that Chegg used unlawful cancellation practices that made it difficult, and in some cases nearly impossible, for consumers to cancel their recurring subscriptions. For example, the complaint alleges that: The FTC alleges that Chegg’s deceptive billing and cancellation practices violate the FTC Act and the Restore Online Shoppers’ Confidence Act (ROSCA), which requires online retailers selling through negative option features to clearly and conspicuously disclose the material terms of the transaction, obtain consumers’ express, informed consent before charging them, and provide simple ways to stop recurring charges. The FTC’s latest action against Chegg follows a  2022 FTC settlement with the company.  The 2022 order required Chegg to bolster its security against data breaches and delete unnecessary data in response to allegations that the company’s lax data security practices exposed sensitive information about millions of its customers and employees. Under the FTC’s proposed order, Chegg will pay $7.5 million, which will be used to provide refunds to consumers impacted by Chegg’s deceptive cancellation practices. The proposed order also requires that Chegg maintain simple cancellation mechanisms for negative option features. The Commission vote authorizing the staff to file the complaint and proposed order was 3-0. The complaint and proposed order were filed in the U.S. District Court for the Northern District of California. NOTE:  The Commission authorizes the filing of a complaint when it has “reason to believe” that the named defendant is violating or is about to violate the law and it appears to the Commission that a proceeding is in the public interest. Stipulated final orders have the force of law when approved and signed by the District Court judge. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Chegg Inc.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Education",
    "Technology",
    "Advertising and Marketing",
    "Online Advertising and Marketing",
    "Payments and Billing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-sends-money-consumers-harmed-deceptive-business-opportunity-scheme-known-blueprint-wealth",
  "scraped_at": "2025-11-13T22:18:26.648109",
  "title": "FTC Sends Money to Consumers Harmed by Deceptive Business Opportunity Scheme Known as “Blueprint to Wealth”",
  "published_date": "2025-09-17",
  "full_text": "The Federal Trade Commission is sending a total of $666,631 to consumers defrauded by a sprawling business opportunity scheme that operated under the name “Blueprint to Wealth.” In December 2023,  the FTC announced a court order  temporarily halting the operations of the defendants, which the agency alleged ran a business opportunity scheme that took in millions of dollars from consumers with false promises of huge returns by building their own businesses. In its complaint, the FTC alleged the scheme had been operating since 2018 under several names, including “Blueprint to Wealth.” In September 2024, the Commission announced the  last of three settlements  against the defendants which barred them from the illegal conduct described in the complaint. The orders resolving the complaint also required the defendants to pay hundreds of thousands of dollars to provide money to harmed consumers. The FTC is sending payments to 4,208 affected consumers. Check recipients should cash their checks within 90 days, as indicated on the check. PayPal recipients should redeem their PayPal payments within 30 days. Consumers who have questions about their payment should contact the refund administrator, JND Legal Administration, at 1-855-779-3542, or visit the FTC website to  view frequently asked questions  about the refund process. The Commission never requires people to pay money or provide account information to get a refund. The Commission’s  interactive dashboards for refund data  provide a state-by-state breakdown of refunds in FTC cases. In 2024, FTC actions led to more than $339 million in refunds to consumers across the country. The Federal Trade Commission works to promote competition and to  protect and educate consumers .  The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize.  You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Like the FTC on  Facebook , follow us on  Twitter , get  consumer alerts , read our  blogs , and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "The Federal Trade Commission is sending a total of $666,631 to consumers defrauded by a sprawling business opportunity scheme that operated under the name “Blueprint to Wealth.”",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Franchises, Business Opportunities, and Investments"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/three-directors-resign-sevita-board-directors-response-ftcs-ongoing-enforcement-efforts-against",
  "scraped_at": "2025-11-13T22:18:26.750313",
  "title": "Three Directors Resign from Sevita Board of Directors in Response to the FTC’s Ongoing Enforcement Efforts Against Interlocking Directorates",
  "published_date": "2025-09-15",
  "full_text": "The Federal Trade Commission announced today that three individuals have resigned from their positions on the Board of Directors of Sevita Health (Sevita) in response to the Federal Trade Commission’s enforcement of the Clayton Act, which generally prohibits directors and officers from serving simultaneously on the boards of competitors. “We are committed to enforcing the Clayton Act’s prohibition on interlocking directorates, which risk suppressing competition,” said Daniel Guarnera, Director of the FTC’s Bureau of Competition. “We are pleased that the firms involved in this case worked with the FTC to resolve this issue quickly. We encourage all firms to review their board memberships to avoid any overlaps with competitors—including when new board members are added as a result of investments by private equity firms or other new shareholders.” Sevita and Beacon Specialized Living Services, Inc. (Beacon) both provide services, including residential facilities, to individuals with intellectual and developmental disabilities. Despite this, they had common representation on each firm’s board of directors. The resignations made in response to the FTC’s enforcement efforts have now resolved the competition concerns raised by the three individuals serving as directors for both Sevita and Beacon simultaneously. The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "The Federal Trade Commission announced today that three individuals have resigned from their positions on the Board of Directors of Sevita Health (Sevita) in response to the Federal Trade Commissio",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Health Care"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-announces-workshop-noncompete-agreements",
  "scraped_at": "2025-11-13T22:18:27.985850",
  "title": "FTC Announces Workshop on Noncompete Agreements",
  "published_date": "2025-09-17",
  "full_text": "Today the Federal Trade Commission announced it will host a workshop, titled “ Moving Forward: Protecting Workers from Anticompetitive Noncompete Agreements .” The event will be held on October 8, 2025 from 2:00pm to 6:00pm, at the FTC’s Constitution Center. The event is open to the public, in-person or via livestream. A noncompete agreement is a contractual term between an employer and a worker that typically blocks the worker from taking a job with a competing employer or starting a competing business after the end of the worker’s employment. In practice, noncompete agreements are often subject to abuse. The workshop is part of the Trump-Vance FTC’s efforts to highlight the negative impact of noncompete agreements on American workers and put business on notice of its enforcement priorities. The workshop will be hosted by the FTC’s Labor Task Force, which was created by Chairman Andrew N. Ferguson to prioritize rooting out and prosecuting deceptive, unfair, and anticompetitive labor-market practices that harm American workers. It follows a  recent FTC enforcement action  eliminating restrictive and anticompetitive noncompete agreements;  a series of letters  sent to healthcare companies warning them to review and eliminate any anticompetitive noncompete agreements they may have; and a broad  request for information  seeking tips to lead to further enforcement actions. The workshop will include public statements from FTC Commissioners, victims of unfair and anticompetitive noncompete agreements, and leading experts in the field. A full agenda and list of speakers will be available prior to the event. A livestream link will be posted to FTC.gov on the morning of the event.  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Today the Federal Trade Commission announced it will host a workshop, titled “",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Nonmerger",
    "Noncompete"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-doj-issue-fiscal-year-2024-hart-scott-rodino-annual-report",
  "scraped_at": "2025-11-13T22:18:29.900713",
  "title": "FTC and DOJ Issue Fiscal Year 2024 Hart-Scott-Rodino Annual Report",
  "published_date": "2025-09-17",
  "full_text": "The Federal Trade Commission and the Department of Justice’s (DOJ) Antitrust Division released their  47 th  Annual Hart-Scott-Rodino (HSR) Report . This report summaries the agencies’ merger enforcement efforts and provides fiscal year 2024 data on the Premerger Notification Program, which alerts the agencies to transactions that may substantially lessen competition in violation of federal law. The report explains that in fiscal year 2024, companies notified the agencies of 2,031 transactions under the HSR Act, approximately one-fourth of which were valued at more than $1 billion. The FTC and DOJ took 32 merger enforcement actions to maintain competition in critically important sectors across the American economy, including healthcare, groceries, technology, labor, and manufacturing. The Commission brought 18 of these actions, six of which resulted in administrative or federal court litigation while in the remaining cases the parties abandoned or restructured their proposed deal as a result of antitrust concerns raised. The statistical tables in the report profile HSR filings and investigations during fiscal year 2024. Appendices provide a summary of transactions for the past 10 years, as well as the number of transactions reported and the number of transactions by industry group. The Commission vote to issue the report was 3-0.  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "The Federal Trade Commission and the Department of Justice’s (DOJ) Antitrust Division released their",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "Hart-Scott-Rodino Act (HSR)"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-recommends-anticompetitive-regulations-deletion-or-revision",
  "scraped_at": "2025-11-13T22:18:31.435567",
  "title": "FTC Recommends Anticompetitive Regulations for Deletion or Revision",
  "published_date": "2025-09-17",
  "full_text": "On Tuesday, Federal Trade Commission Chairman Andrew N. Ferguson  submitted recommendations  for deleting or revising anticompetitive regulations across the entire federal government to the White House’s Office of Management and Budget. This report is a response to President Trump’s Executive Order  on Reducing Anticompetitive Regulatory Barriers . The Executive Order tasked the FTC with finding unnecessary regulations that exclude new market entrants, protect dominant incumbents, and predetermine economic winners and losers, as a first step to repealing them. “President Trump’s Executive Order recognizes that heavy-handed regulations can hurt competition, including by entrenching incumbent firms, raising costs for new entrants, and discouraging innovative new ways to serve customers,” said FTC Bureau of Competition Director Daniel Guarnera. “Competitive markets lower the cost of living, improve the quality of products and services, and drive innovation. Our engagement with citizens across the country and agencies across the federal government has underscored the importance of scrutinizing regulations to ensure that they don’t distort healthy, free-market competition.” Examples of anticompetitive regulations that the Chairman recommends for deletion or modification include: The report is now under review at the Office of Management and Budget. The FTC will continue to work collaboratively with OMB and all of the relevant federal agencies to rescind or revise their regulations as appropriate. The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "On Tuesday, Federal Trade Commission Chairman Andrew N.",
  "tags": [
    "Competition",
    "Commissioners"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-sues-live-nation-ticketmaster-engaging-illegal-ticket-resale-tactics-deceiving-artists-consumers",
  "scraped_at": "2025-11-13T22:18:33.962451",
  "title": "FTC Sues Live Nation and Ticketmaster for Engaging in Illegal Ticket Resale Tactics and Deceiving Artists and Consumers about Price and Ticket Limits",
  "published_date": "2025-09-18",
  "full_text": "The Federal Trade Commission and seven states sued Live Nation and Ticketmaster for tacitly coordinating with brokers and allowing them to harvest millions of dollars worth of tickets in the primary market. Live Nation and Ticketmaster then sell the illegally harvested tickets at a substantial markup in the secondary market, causing consumers to pay significantly more than the face value of the ticket.  The FTC further alleged in  a complaint   that California-based Ticketmaster LLC and its parent company Live Nation Entertainment, Inc., (collectively “Ticketmaster”) deceived artists and consumers by engaging in bait-and-switch pricing through advertising lower prices for tickets than what consumers must pay to purchase tickets; deceptively claimed to impose strict limits on the number of tickets that consumers could purchase for an event, even though ticket brokers routinely and substantially exceeded those limits; and sold millions of tickets, often at much higher cost to consumers, on its resale platform that those brokers obtained in excess of artists’ ticket limits. “President Donald Trump made it clear in his March Executive Order that the federal government must protect Americans from being ripped off when they buy tickets to live events,” said FTC Chairman Andrew N. Ferguson. “American live entertainment is the best in the world and should be accessible to all of us. It should not cost an arm and a leg to take the family to a baseball game or attend your favorite musician’s show. The Trump-Vance FTC is working hard to ensure that fans have a shot at buying fair-priced tickets, and today’s lawsuit is a monumental step in that direction.” Ticketmaster is the leading provider of tickets for concerts—controlling about 80% or more of major concert venues’ primary ticketing—and it also has a growing share of ticket resales in the secondary market. From 2019 to 2024 alone, consumers spent more than $82.6 billion purchasing tickets from Ticketmaster. The FTC alleges that in public, Ticketmaster maintains that its business model is at odds with brokers that routinely exceed ticket limits. But in private, Ticketmaster acknowledged that its business model and bottom line benefit from brokers preventing ordinary Americans from purchasing tickets to the shows they want to see at the prices artists set. The FTC’s complaint against Ticketmaster alleges that: The FTC alleges that these practices violate the FTC Act’s prohibition on deceptive acts or practices in the marketplace and the  Better Online Ticket Sales Act . The FTC is seeking civil penalties against Ticketmaster and any additional monetary relief that that the court finds appropriate. The Commission vote authorizing the staff to file the complaint was 2-0-1, with Commissioner Melissa Holyoak recused due to her previous work as Utah’s Solicitor General. The complaint was filed in the U.S. District Court for the Central District of California. NOTE:  The Commission files a complaint when it has “reason to believe” that the named defendants are violating or are about to violate the law and it appears to the Commission that a proceeding is in the public interest. The case will be decided by the court. The lead staffers on this matter are Elizabeth C. Scott, Taylor H. Arana, and Claire E.W. Stewart from the FTC’s Midwest Regional Office. The Attorneys General of Virginia, Utah, Florida, Tennessee, Nebraska, Illinois and Colorado joined the FTC in bringing this action. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission and seven states sued Live Nation and Ticketmaster for tacitly coordinating with brokers and allowing them to harvest millions of dollars worth of tickets in the primar",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Midwest Region",
    "Bureau of Consumer Protection",
    "deceptive/misleading conduct",
    "Entertainment",
    "Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-secures-historic-25-billion-settlement-against-amazon",
  "scraped_at": "2025-11-13T22:18:33.997869",
  "title": "FTC Secures Historic $2.5 Billion Settlement Against Amazon",
  "published_date": "2025-09-25",
  "full_text": "The Federal Trade Commission has secured a historic order with Amazon.com, Inc., as well as Senior Vice President Neil Lindsay and Vice President Jamil Ghani, settling allegations that Amazon enrolled millions of consumers in Prime subscriptions without their consent, and knowingly made it difficult for consumers to cancel. Amazon will be required to pay a $1 billion civil penalty, provide $1.5 billion in refunds back to consumers harmed by their deceptive Prime enrollment practices, and cease unlawful enrollment and cancellation practices for Prime. “Today, the Trump-Vance FTC made history and secured a record-breaking, monumental win for the millions of Americans who are tired of deceptive subscriptions that feel impossible to cancel,” said FTC Chairman Andrew N. Ferguson. “The evidence showed that Amazon used sophisticated subscription traps designed to manipulate consumers into enrolling in Prime, and then made it exceedingly hard for consumers to end their subscription. Today, we are putting billions of dollars back into Americans’ pockets, and making sure Amazon never does this again. The Trump-Vance FTC is committed to fighting back when companies try to cheat ordinary Americans out of their hard-earned pay.” The FTC has  charged Amazon  and several Amazon executives with knowingly misleading millions of consumers into enrolling in Prime, violating the FTC Act and the Restore Online Shoppers’ Confidence Act (ROSCA). The FTC alleged Amazon created confusing and deceptive user interfaces to lead consumers to enroll in Prime without their knowledge. Compounding these deceptive enrollment practices, Amazon also created a complex and difficult process for consumers seeking to cancel their Prime subscription, with the goal of preventing consumers from cancelling Prime. Amazon documents discovered in the lead up to trial showed that Amazon executives and employees knowingly discussed these unlawful enrollment and cancellation issues, with comments like “subscription driving is a bit of a shady world” and leading consumers to unwanted subscriptions is “an unspoken cancer.”  The historic monetary judgment contained in the settlement is only the third ROSCA case in which the FTC has obtained a civil penalty. It includes: Additionally,  the settlement  requires Amazon to stop their unlawful practices and make meaningful changes to the Prime enrollment and cancellation flows by: The Commission vote approving the stipulated final order was 3-0. The FTC filed the proposed order   in the U.S. District Court for the Western District of Washington. NOTE:  Stipulated final orders have the force of law when approved and signed by the District Court judge. The FTC attorneys on this matter include Jonathan Cohen, Evan Mendelson, Olivia Jerjian, Jonathan W. Ware, Sana Chaudhry, Anthony Saunders, Eli Freedman, Colin D. A. MacDonald, Rachel F. Sifuentes, and Jeffrey Tang. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission has secured a historic order with Amazon.com, Inc., as well as Senior Vice President Neil Lindsay and Vice President Jamil Ghani, settling allegations that Amazon enrol",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "deceptive/misleading conduct",
    "Technology",
    "Advertising and Marketing",
    "Online Advertising and Marketing",
    "Advertising and Marketing Basics"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-alters-final-consent-order-response-public-comments-preventing-coordination-global-advertising",
  "scraped_at": "2025-11-13T22:18:35.155670",
  "title": "FTC Alters Final Consent Order in Response to Public Comments, Preventing Coordination in Global Advertising Merger",
  "published_date": "2025-09-26",
  "full_text": "Following a public comment period, the Federal Trade Commission has approved a  final order  to settle Federal Trade Commission charges that Omnicom Group Inc.’s $13.5 billion acquisition of The Interpublic Group of Companies, Inc. (IPG) would violate the antitrust laws. The order eliminates Omnicom’s ability to deny advertising dollars to media publishers based on their political or ideological viewpoint, except at the express and individualized direction of Omnicom’s advertiser customers. As announced in  June 2025 , the  complaint  alleged that advertising agencies have coordinated—including through industry associations—on decisions not to advertise on certain websites and applications. Coordination among advertising firms may reduce ad revenues for particular media publishers, forcing those publishers to reduce the amount of content they can offer to their own consumers and their investment in their sites. In response to comments received during the designated public comment period, the Commission modified the proposed order.  The final order further clarifies the order’s scope and imposes a compliance monitor. The commission vote approving the final order was 2-0-1, with Commissioner Mark R. Meador recused.   The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Following a public comment period, the Federal Trade Commission has approved a final order to settle Federal Trade Commission char",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "coordinated interaction"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-invites-public-comment-draft-strategic-plan",
  "scraped_at": "2025-11-13T22:18:36.214815",
  "title": "FTC Invites Public Comment on Draft Strategic Plan",
  "published_date": "2025-09-26",
  "full_text": "The Federal Trade Commission is seeking public comment on the  agency’s proposed Strategic Plan for Fiscal Years 2026-2030 . Government agencies update their strategic plans every four years. The FTC’s strategic plan presents its mission, goals, and objectives for the next five years and sets the metrics by which the agency will measure success. This draft of the FTC’s strategic plan keeps the three strategic goal structure from previous plans, but streamlines the document, refocusing the FTC on its core mission areas. The Commission welcomes feedback on how the draft plan can be further adjusted. Public comments on the draft plan are being accepted until October 17, 2025. The Federal Trade Commission works to  promote competition , and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Follow the  FTC on social media , read our  blogs  and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "The Federal Trade Commission is seeking public comment on the agency’s proposed Strategic Plan for Fiscal Years 2026-2030.",
  "tags": [
    "FTC Operations",
    "Office of the Executive Director"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-19-states-act-stop-deceptive-cancer-charity-fundraising-scheme",
  "scraped_at": "2025-11-13T22:18:36.474847",
  "title": "FTC and 19 States Act to Stop a Deceptive Cancer Charity Fundraising Scheme",
  "published_date": "2025-09-25",
  "full_text": "The Federal Trade Commission, along with 22 agencies from 19 states, stopped a deceptive charity fundraising scheme and its operators who made false or deceptive claims to U.S. donors. Kars-R-Us.com, Inc. (Kars) and its operators, Michael Irwin and Lisa Frank, solicited charitable donations nationwide on behalf of United Breast Cancer Foundation, Inc. (UBCF), a charity that claims to assist individuals affected by breast cancer, according to a  complaint  filed by the FTC and states. Kars claimed that vehicle donations would allow UBCF to “save lives” by providing free and low-cost breast cancer screenings. But, in reality, only $126,815 or 0.28% of the more than $45 million that Kars raised was used to provide breast cancer screenings, the complaint alleges. Under a  proposed settlement order  reached with the FTC and its state partners, Kars and its operators face restrictions on future fundraising activities and Irwin, Kars’s President and co-owner until 2022, will be permanently banned from fundraising. “This case should send a strong message to fundraisers that the FTC will take action if they misrepresent the truth and exploit the kindness of generous donors for their own gain,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection. “We are grateful to our state partners for joining this effort to protect the public from fundraising schemes like this one.” Kars solicited vehicle donations through national and local TV, radio and online ads in English and Spanish, claiming the donations would allow UBCF to “save lives” by providing free and low-cost breast cancer screenings. Kars tugged at donors’ heartstrings to maximize contributions with little regard for truthfulness or accuracy of the claims it made on behalf of UBCF, the complaint alleges. More than 84,000 well-intentioned people donated their vehicles to Kars.   Between 2017 to 2022 Kars raised more than $45.5 million on behalf of UBCF. The complaint alleges that $34.9 million of those raised funds went to pay Kars, its operators, and its vendors. Of the fraction of funds left to UBCF, most were largely used for other purposes, including generous compensation to UBCF’s CEO. Kars, Irwin, and Frank knew or should have known that the breast cancer-related claims they drafted and made on behalf of UBCF were deceptive or lacked substantiation, the complaint alleges. The proposed settlement order imposes restrictions on Kars, Irwin, and Frank, including: Irwin, Frank, and Kars also face a total monetary judgment of $3,882,091, which is partially suspended based on their inability to pay the full amount. If Kars, Frank, and Irwin are found to have lied to the FTC and state partners about their financial status, the full judgment will be immediately payable. The state agencies joining the FTC in this case include the attorneys general of Arkansas, California, Colorado, Connecticut, Delaware, Florida, Georgia, Illinois, Indiana, Maryland, New York, North Carolina, Oklahoma, Oregon, Utah, Virginia, West Virginia, and Wisconsin as well as the secretaries of state of Maryland, North Carolina, and South Carolina; and the Utah Division of Consumer Protection. The Commission vote authorizing the staff to file the complaint and stipulated final orders was 3-0. The FTC filed the complaint and final orders in the U.S. District Court for the Central District of California. Consumers looking for  more information about how to donate safely  and avoid charity scams can find it on the FTC’s website.  The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission, along with 22 agencies from 19 states, stopped a deceptive charity fundraising scheme and its operators who made false or deceptive claims to U.S. donors.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Cars",
    "Charity",
    "Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-alleges-sendit-app-its-ceo-unlawfully-collected-personal-data-children-deceived-users-about",
  "scraped_at": "2025-11-13T22:18:38.817491",
  "title": "FTC Alleges Sendit App and its CEO Unlawfully Collected Personal Data from Children, Deceived Users About Messages, Subscription Memberships",
  "published_date": "2025-09-29",
  "full_text": "The Federal Trade Commission is taking action against the operator of the Sendit anonymous messaging app for unlawfully collecting personal data from children, misleading users by sending messages from fake “people,” and tricking consumers into purchasing paid subscriptions by falsely promising to reveal the senders of anonymous messages. A complaint, filed by the Department of Justice upon notification and referral from the FTC , alleged that Sendit’s operator, Los Angeles-based Iconic Hearts Holdings, Inc., and its CEO, Hunter Rice, violated the  Children’s Online Privacy Protection Rule (COPPA Rule).  The Rule requires operators of websites, apps and other online services that have knowledge they are collecting personal information from children under 13 to notify parents about what personal information the sites or apps collect and obtain verifiable parental consent before collecting such information. The complaint also alleged that Iconic Hearts made misrepresentations to users to push them to purchase premium subscriptions, unfairly used fake messages to trick child and teen users into purchasing premium subscriptions and failed to clearly disclose the terms of its subscription plans. “Sendit’s operator and CEO were well aware that many of its users were under the age of 13 and still failed to comply with COPPA,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection. “At the same time, they manipulated many users, including children, into signing up for their weekly subscription service by sending fake messages and promising to reveal the identity of message senders but failing to deliver.” The complaint alleged that Iconic Hearts knew that numerous Sendit users were under the age of 13 but failed to comply with the COPPA Rule. For example, in 2022, more than 116,000 users reported their age as under 13 while using Sendit, according to the complaint. Iconic Hearts also received complaints from parents who indicated that their children were under 13. Even though it was aware that many users were under 13, Iconic Hearts failed to notify parents that it collected personal information from children, including their phone numbers, birthdates, photos and usernames for Snapchat, Instagram, TikTok and other accounts, and did not obtain parents’ verifiable consent to such data collection. The complaint also alleged that Iconic Hearts and Rice deceived Sendit’s users, many of whom were children and teens, into purchasing its premium “Diamond Membership” using methods such as: In addition to the COPPA Rule, Iconic Hearts and Rice allegedly violated the FTC Act and the Restore Online Shoppers’ Confidence Act (ROSCA), which prohibits certain unfair or deceptive internet sales practices with a negative option feature. The Commission vote to refer the complaint to the Department of Justice for filing was 3-0. The Department of Justice filed the complaint upon referral from the Commission in the U.S. District Court   for the Central District of California. NOTE:  The Commission refers a complaint to the DOJ for filing when it has “reason to believe” that the named defendants are violating or are about to violate the law and that a proceeding is in the public interest. The case will be decided by the court. The lead attorneys on this matter are Siobhan Amin, Miles Freeman, and John Jacobs in the FTC’s Western Region Los Angeles office. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission is taking action against the operator of the Sendit anonymous messaging app for unlawfully collecting personal data from children, misleading users by sending messages",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Bureau of Consumer Protection",
    "Western Region Los Angeles",
    "Children's Online Privacy Protection Act (COPPA)",
    "deceptive/misleading conduct",
    "Payments and Billing",
    "Privacy and Security",
    "Children's Privacy",
    "Social Media"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/federal-trade-commission-us-department-justice-japan-fair-trade-commission-meet-washington",
  "scraped_at": "2025-11-13T22:18:39.836834",
  "title": "Federal Trade Commission, US Department of Justice, and Japan Fair Trade Commission Meet in Washington",
  "published_date": "2025-09-29",
  "full_text": "Federal Trade Commission Chairman Andrew N. Ferguson, Assistant Attorney General Abigail Slater of the Justice Department’s Antitrust Division, and Japan Fair Trade Commission Chairman Eiji Chatani of the Japan Fair Trade Commission (JFTC) met today in Washington, D.C., to continue the United States and Japan’s long history of engagement on competition issues affecting both countries. “I want to thank Chairman Chatani and the Japan Fair Trade Commission for joining us in a productive and insightful discussion,” said FTC Chairman Andrew N. Ferguson. “The friendship between the United States and Japan is among the most important for both countries, and these strong ties also apply to the longstanding relationship between the U.S. and Japanese competition agencies. I fully expect our collaboration will continue to produce substantial benefits for competition, consumers, and workers in both countries.” “The Japan Fair Trade Commission is one of our closest and most important international partners,” said Assistant Attorney General Slater. “We are grateful to the JFTC for our long history of sharing best practices, discussing common challenges, and engagement on competition issues of interest to both of our countries. I would like to thank JFTC Chairman Chatani for traveling to Washington for today’s discussion. We look forward to continuing our close relationship with the JFTC in the future.” “I am truly honored to participate in today’s bilateral meeting between the United States and Japan, a dialogue with a long and distinguished history,” said JFTC Chair Eiji Chatani. “As competition authorities confront common challenges, it is vital that our leadership engage in direct and candid discussions. I would like to express my sincere gratitude to AAG Slater and Chairman Ferguson for their gracious hospitality. This productive meeting establishes a solid foundation for deepening cooperation between our nations, promoting mutual progress and sustained collaboration across multiple levels.” The 1999 competition cooperation agreement between the FTC, DOJ, and JFTC builds on a long-standing and close relationship, dating from the enactment of Japan's Antimonopoly Law in 1947. The FTC and DOJ have held regular antitrust consultations with the JFTC since the 1970s, the longest running of the United States' bilateral consultations with foreign antitrust authorities. The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Federal Trade Commission Chairman Andrew N.",
  "tags": [
    "Competition",
    "Bureau of Competition"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/dun-bradstreet-agrees-pay-57-million-resolve-alleged-violations-ftc-order",
  "scraped_at": "2025-11-13T22:18:40.319562",
  "title": "Dun & Bradstreet Agrees to Pay $5.7 Million to Resolve Alleged Violations of FTC Order",
  "published_date": "2025-09-29",
  "full_text": "Business credit report service provider Dun & Bradstreet (D&B) has agreed to a $5.7 million settlement with the Federal Trade Commission over allegations the firm violated a 2022 order. D&B’s alleged violations include providing inaccurate information about its products to customers before renewing their subscription services, leading to overcharging, and misrepresenting that purchasing fee-based products will improve these customers’ credit scores. “Our signed orders are not suggestions,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection. “This settlement is another example of the Bureau’s effort to reinvigorate its fraud program and protect small businesses from deceptive and unlawful conduct.” In 2022, the  FTC alleged that D&B  deceived businesses about the value of products and failed to correct errors on business credit reports. The  2022 Order  settling those allegations required D&B to notify its customers of certain material facts before automatically renewing subscriptions for its paid services. It also prohibited D&B from using automatic renewal to switch a subscriber into a more expensive product that the subscriber did not order. And it prohibited D&B from misrepresenting to customers any material fact about the price or features of any product and to retain records of its telemarketing calls. The  proposed complaint , filed by the Department of Justice upon notification and referral from the FTC, alleges that D&B violated the 2022 Order by: Under the proposed order, D&B will be required to pay a total of $5.7 million, including $3.7 million that will be used for refunds to consumers and over $2 million in civil penalties for violating the 2022 order. In addition, D&B has agreed to modify the 2022 Order to address allegations in the latest complaint. These changes would require D&B to: The Commission vote to authorize the staff to refer the complaint to the DOJ and to approve the stipulated final order was 3-0. The DOJ filed the complaint and stipulated final order on behalf of the Commission in the U.S. District Court for the Middle District of Florida, Jacksonville Division. NOTE:  Stipulated final orders have the force of law when approved and signed by the District Court judge. The Commission’s lead attorneys on this matter are Christopher J. Erickson and Taylor H. Bates from the FTC’s Bureau of Consumer Protection. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Business credit report service provider Dun & Bradstreet (D&B) has agreed to a $5.7 million settlement with the Federal Trade Commission over allegations the firm violated a 2022 order.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "deceptive/misleading conduct",
    "Finance",
    "Credit and Finance",
    "Credit and Loans",
    "Credit Reporting",
    "Small Business"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-secures-preliminary-injunction-against-im-mastery-academy-its-owners",
  "scraped_at": "2025-11-13T22:18:43.646732",
  "title": "FTC Secures Preliminary Injunction Against IM Mastery Academy and Its Owners",
  "published_date": "2025-08-21",
  "full_text": "A U.S. District Court judge in Nevada has issued a preliminary injunction against the three companies that executed the  IM Mastery Academy schemes  and the two individuals who have led it, halting their activities and requiring them to preserve their assets. In a  complaint  filed in May 2025, the FTC and the State of Nevada allege that the scheme—which operated most recently as IYOVIA, but has also branded itself as IM Mastery Academy, iMarketsLive, and IM Academy—used false or baseless earning claims to entice consumers to purchase training on investment in financial markets. The defendants have used similar claims to persuade consumers to buy into the defendants’ multi-level marketing business venture, which involves marketing the defendants’ training services to others. The FTC alleges that the total harm to consumers since 2018 exceeds $1.2 billion. The  preliminary injunction  against Chris and Isis Terry and the companies that operated the scheme requires the defendants to preserve assets and records, and puts a monitor in place to ensure that the companies comply with the law and the requirements in the preliminary injunction. The preliminary injunction prohibits them from: Last week, the FTC  announced that three other defendants  involved in the scheme, Global Dynasty Network, LLC, Jason Brown, and Matthew Rosa, agreed to a settlement related to their roles in the scheme. The FTC staff attorneys on this matter are Tom Biesty, Laura Basford, Ron Brooke, and Josh Doan of the FTC’s Bureau of Consumer Protection. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "A U.S.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Work-at-Home",
    "Going into Business",
    "deceptive/misleading conduct",
    "Franchises, Business Opportunities, and Investments",
    "Advertising and Marketing",
    "Made in USA",
    "Online Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-case-against-e-commerce-business-opportunity-scheme-its-operators-results-permanent-ban-industry",
  "scraped_at": "2025-11-13T22:18:45.709793",
  "title": "FTC Case Against E-Commerce Business Opportunity Scheme and its Operators Results in Permanent Ban from Industry",
  "published_date": "2025-08-25",
  "full_text": "The operators of an e-commerce business opportunity scheme and their companies will be permanently banned from the industry as part of a settlement resolving Federal Trade Commission allegations that the defendants deceived consumers into paying millions for empty promises to create and operate lucrative online stores for consumers. Under the proposed settlement with the FTC, Click Profit and its operators also will be required to turn over cash, real estate, and personal property that will be used for consumer redress. In March 2025, the FTC filed a  complaint and obtained a temporary restraining order against four individuals and their eight corporations doing business as Click Profit.  The FTC alleged the company and its operators promised to create and operate stores for consumers on Amazon and other third-party e-commerce platforms that would generate hundreds of thousands, and even millions of dollars in guaranteed, “passive income.” According to the complaint, Click Profit and its operators: As a result of the FTC’s complaint, a federal court issued an order temporarily halting the scheme and putting the business under the control of a receiver, and later granted a preliminary injunction. The proposed orders against  Craig Emslie, Patrick McGeoghean, Click Profit, LLC, SA Automation Enterprise LLC, M23 Holdings, LLC, M7 Investments LLC, and Express Ecom LLC ,   William Holton and Ecom Direct LLC , and  Jason Masri, Automation Industries LLC, and Click Profit Distribution, LLC   permanently ban the defendants from: The   proposed orders include a monetary judgment of $13.6 million against individual defendants Emslie, McGeoghean, Holton, and their affiliated entities,   and a $7.3 million monetary judgment against Masri and his affiliated entities. The judgments have been partially suspended based on the defendants’ inability to pay the full amount.  If the defendants are found to have made false claims to the FTC about their financial status, the full judgment would be immediately payable. The Commission vote approving the stipulated final orders was 3-0. The FTC filed the proposed order in the U.S. District Court for the Southern District of Florida. Stipulated final orders have the force of law when approved and signed by the District Court Judge. The lead staff attorneys on this matter are Lisa Bohl and Katharine Roller.  The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The operators of an e-commerce business opportunity scheme and their companies will be permanently banned from the industry as part of a settlement resolving Federal Trade Commission allegations th",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Midwest Region",
    "Bureau of Consumer Protection",
    "Work-at-Home",
    "Going into Business",
    "Franchises, Business Opportunities, and Investments",
    "Advertising and Marketing",
    "Online Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-sues-stop-air-ai-using-deceptive-claims-about-business-growth-earnings-potential-refund",
  "scraped_at": "2025-11-13T22:18:45.786231",
  "title": "FTC Sues to Stop Air AI from Using Deceptive Claims about Business Growth, Earnings Potential, and Refund Guarantees to Bilk Millions from Small Businesses",
  "published_date": "2025-08-25",
  "full_text": "The Federal Trade Commission has asked a federal court to  stop Air AI   from using allegedly deceptive claims about business growth, earnings potential, and refund guarantees to fleece small businesses and entrepreneurs. The FTC alleges consumers, many of whom are small business owners, lose as much as $250,000 and are often left in debt after relying on Air AI’s false promises. “Companies that market AI-related tools with false promises of unrealistic investment returns and guaranteed refunds harm hardworking small business owners and undermine legitimate business’s adoption of AI,” said FTC Bureau of Consumer Protection Director Christopher Mufarrige. “The FTC is focused on ensuring the promise of new technology isn’t misused as a means to mislead consumers.” The Commission filed a  complaint against Delaware-based technology company Air AI Technologies   (also doing business as Air AI, Air.AI, Scale 13)   , its owners—Caleb Matthew Maddix, Ryan Paul O’Donnell, and Thomas Matthew Lancer—and five other companies for their misrepresentations to consumers. The complaint alleges that, since at least February 2023, the company and its owners have deceptively marketed and sold business coaching materials and support, coupled with a suite of business support services called an “Air AI Access Card,” as well as licenses to resell their services. According to the complaint, the company and its operators have advertised their flagship feature as “conversational AI,” claiming that their product can replace human customer service representatives and, in combination with other services, make business owners significant sums of money. For example, the FTC alleges Air AI and its owners make claims that consumers would earn back tens of thousands of dollars in a matter of days or months and that some consumers could make millions of dollars using these services. The FTC alleges that, despite Air AI’s promises, consumers often do not earn the promised profits or even recoup the money paid to Air AI. The agency also alleges that Air AI and its owners deceived consumers by promising that Air AI would provide full refunds to customers who do not earn a certain amount—typically twice or three times their investment within a specified number of months—or are unsatisfied with the products for any other reason. In reality, when consumers ask for a refund, the defendants rarely honor their guarantee, often delaying and leaving consumers in the dark before cutting off communication altogether. The Commission alleges the defendants engaged in various illegal activities, including: The Commission vote approving the filing of the complaint was 3-0. The FTC filed the complaint in the U.S. District Court for the District of Arizona against: Air AI Technologies, Inc. (also doing business as Air AI, Air.AI, Scale 13), Apex Holdings Group LLC, Apex Scaling LLC, Apex 4 Kids LLC, New Life Capital LLC, Onyx Capital LLC, and Caleb Matthew Maddix, Ryan Paul O’Donnell, and Thomas Matthew Lancer.  The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission has asked a federal court to stop Air AI from using allegedly deceptive claims about bu",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Going into Business",
    "deceptive/misleading conduct",
    "Franchises, Business Opportunities, and Investments",
    "Advertising and Marketing",
    "Small Business",
    "Artificial Intelligence"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/telemarketer-fees-access-ftcs-national-do-not-call-registry-increase-2026",
  "scraped_at": "2025-11-13T22:18:46.636025",
  "title": "Telemarketer Fees to Access the FTC’s National Do Not Call Registry to Increase in 2026",
  "published_date": "2025-08-27",
  "full_text": "The Federal Trade Commission today announced new fees for telemarketers to access phone numbers on the National Do Not Call (DNC) Registry  for Fiscal Year 2026 , which begins on October 1, 2025. All telemarketers calling consumers in the United States are required to download the numbers on the National DNC Registry to ensure they do not call consumers who have registered their phone numbers. The first five area codes are free to download, and organizations that are exempt, such as some charities and political callers, may obtain the entire list for free. Telemarketers must subscribe each year for access to the Registry numbers. The cost of accessing a single area code in the registry will be $82 in FY 2026, which is an increase of $2 from FY 2025. The maximum charge to any single entity for accessing all area codes nationwide is now $22,626 (up from $22,038 in FY 2025). The fee for accessing an additional area code for a half year will increase $1 from FY 2025, to $41. The Commission vote authorizing publication of the Federal Register notice announcing the new fees was 3-0. Note:  The new fees will go into effect on October 1, 2025. The effective date listed in the Federal Register notice lists the wrong year and will be corrected in the coming days The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission today announced new fees for telemarketers to access phone numbers on the National Do Not Call (DNC) Registry",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Do Not Call",
    "robocalls",
    "Advertising and Marketing",
    "Telemarketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-sends-more-67-million-consumers-impacted-gig-work-companys-deceptive-earnings-claims",
  "scraped_at": "2025-11-13T22:18:48.180514",
  "title": "FTC Sends More Than $6.7 Million to Consumers Impacted by Gig Work Company’s Deceptive Earnings Claims",
  "published_date": "2025-08-26",
  "full_text": "The Federal Trade Commission is sending more than $6.7 million to consumers impacted by a gig work company’s deceptive claims about the potential money workers could make on its platform. In its  July 2024 complaint, the FTC alleged that Arise Virtual Solutions  regularly targeted people looking for opportunities to support their families by working from home, including stay-at-home mothers, with misleading promises about the earnings they could make on its platform. Arise used deceptive advertisements that said consumers who signed up on its platform would have access to jobs that paid “up to $18/hour” doing remote customer service work for major companies, according to the complaint. The FTC said that the company violated the FTC Act and the Business Opportunity Rule, including the requirement to truthfully disclose the basis for earnings claims to consumers. Under the July 2024 order settling the FTC’s allegations,  Arise is prohibited from making any earnings claims  to consumers without being able to substantiate those claims or making any false or misleading claims generally. It also was required to pay $7 million to compensate affected consumers. The FTC is sending checks to 98,254 affected consumers. Recipients should cash their checks within 90 days, as indicated on the check. Consumers who have questions about their payment should contact the refund administrator, Epiq Systems, at 888-998-8059, or visit the FTC website to  view frequently asked questions  about the refund process. The Commission never requires people to pay money or provide account information to get a refund. The Commission’s  interactive dashboards for refund data  provide a state-by-state breakdown of refunds in FTC cases. In 2024, FTC actions led to more than $339 million in refunds to consumers across the country. The Federal Trade Commission works to promote competition and to  protect and educate consumers .  The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize.  You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Like the FTC on  Facebook , follow us on  Twitter , get  consumer alerts , read our  blogs , and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "The Federal Trade Commission is sending more than $6.7 million to consumers impacted by a gig work company’s deceptive claims about the potential money workers could make on its platform.",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Midwest Region",
    "Bureau of Consumer Protection",
    "Jobs",
    "Work-at-Home",
    "consumer refunds",
    "Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-approves-final-order-against-workado-llc-which-misrepresented-accuracy-its-artificial",
  "scraped_at": "2025-11-13T22:18:50.458890",
  "title": "FTC Approves Final Order against Workado, LLC, Which Misrepresented the Accuracy of its Artificial Intelligence Content Detection Product",
  "published_date": "2025-08-28",
  "full_text": "The Federal Trade Commission has given final approval to an order against Workado, LLC, requiring the company to stop advertising the accuracy or efficacy of its artificial intelligence (AI) content detection products unless it has competent and reliable evidence showing those products are as accurate as claimed. Workado markets its AI Content Detector to consumers seeking to determine whether written content was developed using generative AI technology or if it was written by a human being. The company claimed that its AI Content Detector was developed using a wide range of material, including blog posts and Wikipedia entries, to make it more accurate for average users. The FTC’s  April 2025 complaint  alleges, however, that the AI model powering the AI Content Detector was trained or fine-tuned to effectively classify only academic content. The  final order  is designed to ensure Workado does not engage in similar false, misleading, or unsupported advertising. Under the order, Workado: Following a public comment period, the Commission voted 3-0 to approve the final consent order and respond to two comments the FTC received on the proposed order. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission has given final approval to an order against Workado, LLC, requiring the company to stop advertising the accuracy or efficacy of its artificial intelligence (AI) c",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Northwest Region",
    "Bureau of Consumer Protection",
    "Technology",
    "Advertising and Marketing",
    "Artificial Intelligence"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/federal-trade-commission-chairman-andrew-n-ferguson-issues-letter-gmail-using-partisan-filtering",
  "scraped_at": "2025-11-13T22:18:51.868413",
  "title": "Federal Trade Commission Chairman Andrew N. Ferguson Issues Letter on Gmail Using Partisan Filtering",
  "published_date": "2025-08-28",
  "full_text": "Today, Federal Trade Commission Chairman Andrew N. Ferguson  issued a letter  to Alphabet, Inc. CEO Sundar Pichai regarding potential FTC Act violations related to partisan administration of Gmail. The letter addresses reporting that Gmail uses partisan methods to determine which emails are flagged as spam, and reminds Alphabet of its obligations under the FTC Act.  The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Today, Federal Trade Commission Chairman Andrew N.",
  "tags": [
    "Consumer Protection",
    "Commissioners",
    "Bureau of Consumer Protection",
    "Technology"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/disney-pay-10-million-settle-ftc-allegations-company-enabled-unlawful-collection-childrens-personal",
  "scraped_at": "2025-11-13T22:18:52.867645",
  "title": "Disney to Pay $10 Million to Settle FTC Allegations the Company Enabled the Unlawful Collection of Children’s Personal Data",
  "published_date": "2025-09-02",
  "full_text": "Disney will pay $10 million to settle Federal Trade Commission allegations that the company allowed personal data to be collected from children who viewed kid-directed videos on YouTube without notifying parents or obtaining their consent as required by the  Children’s Online Privacy Protection Rule (COPPA Rule) . The  proposed order  would transform how the entertainment behemoth designates videos on YouTube as “Made for Kids,” while encouraging adoption of age assurance technologies on YouTube. A complaint , filed by the Department of Justice upon notification and referral from the FTC, alleged that Disney Worldwide Services, Inc. and Disney Entertainment Operations LLC (Disney) violated the COPPA Rule by failing to properly label some videos that it uploaded to YouTube as “Made for Kids.” The complaint says the mislabeling allowed Disney, through YouTube, to collect personal data from children under 13 viewing child-directed videos and use that data for targeted advertising to children. Disney receives a portion of the revenues that YouTube generates from advertising placed with Disney videos and revenues from advertising that Disney sells directly. The mislabeling also exposed children to age-inappropriate YouTube features like autoplay to videos not “Made for Kids.” “This case underscores the FTC’s commitment to enforcing COPPA, which was enacted by Congress to ensure that parents, not companies like Disney, make decisions about the collection and use of their children’s personal information online,” said FTC Chairman Andrew N. Ferguson. “Our order penalizes Disney’s abuse of parents’ trust, and, through a mandated video-review program, makes room for the future of protecting kids online—age assurance technology.” The COPPA Rule requires websites, apps and other online services that are directed to children under 13 to notify parents about what personal information they collect and obtain verifiable parental consent before collecting such information. Following a  2019 settlement with the FTC over allegations it violated COPPA , YouTube began requiring content creators, including Disney, to indicate if the videos they upload to YouTube are “Made for Kids” (MFK) or “Not Made for Kids” (NMFK) in order to comply with COPPA. The designation ensures that some features on videos that are classified as MFK are disabled. For example, YouTube does not collect personal information or serve personalized ads to viewers watching videos marked as MFK and does not allow for comments to be posted to those videos, according to the Disney complaint. To comply with YouTube’s policy, content creators can mark each individual video or mark a particular channel as MFK or NMFK. If a channel is MFK or NMFK, every video uploaded to that channel is marked the same way by default. YouTube, however, has warned content creators that they are responsible for ensuring that all the videos they post are accurately classified, according to the complaint. According to the complaint, Disney chose to mark all of its videos uploaded to YouTube at the channel level and did not change the default to mark each video individually. The complaint alleged that Disney uploaded many videos directed to children to Disney channels labeled as NMFK, thereby labeling them by default as NMFK. According to the complaint, even after being told by YouTube in mid-2020 that YouTube had changed designations on more than 300 Disney videos from NMFK to MFK, Disney did not change its policy of designating videos at the channel level and continued to fail to properly designate individual videos as MFK. These videos included child-directed subject matter, visual content, and music from The Incredibles, Coco, Toy Story, Frozen, and Mickey Mouse. Under the proposed settlement, Disney will be required to: The Commission voted 3-0 to refer the complaint and proposed order to the Department of Justice. Chairman Ferguson   joined by Commissioners Melissa Holyoak and Mark R. Meador  released a   statement . The DOJ filed the complaint and stipulated order in the U.S. District Court for the Central District of California, Western Division. NOTE:  The Commission authorizes the filing of a complaint when it has “reason to believe” that the named defendant is violating or is about to violate the law and it appears to the Commission that a proceeding is in the public interest. Stipulated orders have the force of law when approved and signed by the District Court judge. The lead FTC attorneys on this matter are Jacqueline Ford and Genevieve Bonan from the FTC’s Bureau of Consumer Protection. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Disney will pay $10 million to settle Federal Trade Commission allegations that the company allowed personal data to be collected from children who viewed kid-directed videos on YouTube without not",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Children's Online Privacy Protection Act (COPPA)",
    "Entertainment",
    "Advertising and Marketing",
    "Children",
    "Online Advertising and Marketing",
    "Privacy and Security",
    "Children's Privacy",
    "Tech"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-seeks-public-comment-petition-modify-eqt-quantum-energy-order",
  "scraped_at": "2025-11-13T22:18:55.466847",
  "title": "FTC Seeks Public Comment on Petition to Modify EQT, Quantum Energy Order",
  "published_date": "2025-07-22",
  "full_text": "The Federal Trade Commission requests public comment on a petition seeking to reopen and set aside a final consent order involving a $5.2 billion cash-and-stock deal between private equity firm Quantum Energy Partners and natural gas producer EQT Corporation. The FTC’s 2023 consent order resolved antitrust concerns that alleged the deal would have made Quantum one of EQT’s largest shareholders and given Quantum a seat on EQT’s board of directors. Quantum and EQT are direct competitors in the production and sale of natural gas in the Appalachian Basin, the largest natural gas-producing region in the United States. In addition, the FTC alleged that an existing joint venture between EQT and Quantum involved in purchasing mineral rights in the Appalachian Basin raised concerns regarding anticompetitive information exchange and the harm to competition in the acquisition of mineral rights. The FTC alleged EQT and Quantum Energy’s deal would violate the antitrust laws and harm competition. Under the FTC’s final order, Quantum is prohibited from occupying an EQT board seat to prevent the formation of an interlocking directorate, which is an arrangement that occurs when an officer or director of one firm simultaneously serves as an officer or director of a competing firm. The final order also required Quantum to divest its EQT shares, prevented anticompetitive information exchange, unwound the joint venture between the two entities, and imposed additional restraints to protect competition. EQT, Quantum Energy, and other relevant parties  filed a petition  with the Commission that seeks to reopen and set aside the final consent order. According to the petition, by October 2024, Quantum had divested all EQT shares acquired in the transaction and, in February 2024, an affiliate of EQT and an affiliate of Quantum completed the dissolution of the joint venture. The petition states that given these changes, none of the facts giving rise to the final consent order remain, and it would be in the public interest to reopen and set aside the final order. The public will have 30 days, until August 21, 2025, to submit comments on the  petition to reopen  and set aside the consent order. Instructions for filing comments appear on the docket. Once processed, they will be posted on  Regulations.gov . After the comment period closes, the Commission will vote to determine how to resolve the petition. The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "The Federal Trade Commission requests public comment on a petition seeking to reopen and set aside a final consent order involving a $5.2 billion cash-and-stock deal between private equity firm Qua",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "coordinated interaction",
    "Interlocking directorates",
    "oil and gas competition",
    "Energy",
    "Gasoline",
    "Natural Gas"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-sends-money-consumers-harmed-student-loan-forgiveness-scam",
  "scraped_at": "2025-11-13T22:18:57.374331",
  "title": "FTC Sends Money to Consumers Harmed by Student Loan Forgiveness Scam",
  "published_date": "2025-07-24",
  "full_text": "The Federal Trade Commission is sending more than $356,900 in refunds to consumers harmed by scammers who lured struggling student loan borrowers into signing up for a program that promised loan forgiveness that did not exist. In the FTC’s  complaint against SL Finance LLC and its owners Michael Castillo and Christian Castillo , the agency charges that the defendants pretended to be affiliated with the U.S. Department of Education, charged illegal junk fees, and lured students with repayment programs and loan forgiveness that did not exist. The complaint also notes that the defendants falsely claimed that their program was part of the CARES Act or a similar COVID-19 relief program. As part of a settlement announced in October 2023, the Castillo brothers agreed to surrender their assets, which the FTC is using to provide refunds to consumers. The settlement order also permanently bans them from offering debt relief services of any kind. The FTC is sending checks to 7,150 affected consumers. Recipients should cash their checks within 90 days, as indicated on the check. Consumers who have questions about their payment should contact the refund administrator, Analytics, at 833-588-3361, or visit the FTC website to  view frequently asked questions  about the refund process. The Commission never requires people to pay money or provide account information to get a refund. The Commission’s  interactive dashboards for refund data  provide a state-by-state breakdown of refunds in FTC cases. In 2024, FTC actions led to more than $339 million in refunds to consumers across the country. The Federal Trade Commission works to promote competition and to  protect and educate consumers .  The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize.  You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Like the FTC on  Facebook , follow us on  Twitter , get  consumer alerts , read our  blogs , and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "The Federal Trade Commission is sending more than $356,900 in refunds to consumers harmed by scammers who lured struggling student loan borrowers into signing up for a program that promised loan forgiveness that did not exist.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Debt Relief",
    "Education",
    "deceptive/misleading conduct",
    "consumer refunds"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-doj-host-listening-session-lowering-americans-drug-prices-through-competition",
  "scraped_at": "2025-11-13T22:18:57.446574",
  "title": "FTC and DOJ Host Listening Session on Lowering Americans’ Drug Prices Through Competition",
  "published_date": "2025-07-23",
  "full_text": "The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "WHAT: The Federal Trade Commission and the Justice Department’s Antitrust Division, along with the Department of Commerce and the Department of Hea",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Pharmacy Benefits Managers (PBM)",
    "Health Care",
    "Drug Stores and Pharmacies",
    "Prescription Drugs",
    "Health Professional Services",
    "Pharmaceuticals"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-obtains-permanent-ban-e-commerce-business-opportunity-scheme-operator",
  "scraped_at": "2025-11-13T22:18:58.296526",
  "title": "FTC Obtains Permanent Ban of E-Commerce Business Opportunity Scheme Operator",
  "published_date": "2025-07-30",
  "full_text": "The owner of a business opportunity scheme will be permanently banned from selling business opportunities in settlement of Federal Trade Commission allegations that he and his company deceptively guaranteed consumers income through online storefronts. Additionally, FBA Machine (formerly Passive Scaling)   and its owner Bratislav Rozenfeld (also known as Steven Rozenfeld and Steven Rozen) will be required to turn over the contents of multiple financial accounts and any funds realized upon the sale of real estate property. The proceeds will be used for consumer redress. In June 2024,  the FTC filed suit  against FBA Machine and Rozenfeld alleging that, in a business opportunity scheme, they falsely guaranteed that consumers could make money operating online storefronts using AI-powered software. The defendants allegedly failed to deliver on the promised earnings claims and defrauded consumers out of over $15 million. The FTC also added Amanda Peremen, Rozenfeld’s wife, as a relief defendant in the case. The amended complaint alleged that, though not directly involved in the scheme, she received proceeds from it. As a result of the FTC’s complaint, a federal court issued an order temporarily halting the scheme and putting it under the control of a receiver. The proposed order bans FBA Machine and Rozenfeld from: The   proposed order includes a total monetary judgment of $15.7 million , which is partially suspended based on the defendants’ inability to pay the full amount. If the defendants are found to have lied to the FTC about their financial status, the full judgment would be immediately payable. The Commission vote approving the stipulated final order was 3-0. The FTC filed the proposed order in the U.S. District Court for the District of New Jersey. Stipulated final orders have the force of law when approved and signed by the District Court Judge. The lead staff attorneys on this matter were Frances Kern and Colleen Robbins. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The owner of a business opportunity scheme will be permanently banned from selling business opportunities in settlement of Federal Trade Commission allegations that he and his company deceptiv",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Going into Business",
    "Technology",
    "Franchises, Business Opportunities, and Investments",
    "Advertising and Marketing",
    "Online Advertising and Marketing",
    "Artificial Intelligence"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-requests-public-comment-regarding-gender-affirming-care-minors",
  "scraped_at": "2025-11-13T22:18:58.440555",
  "title": "FTC Requests Public Comment Regarding “Gender-Affirming Care” for Minors",
  "published_date": "2025-07-28",
  "full_text": "Today, the Federal Trade Commission launched a public inquiry to better understand how consumers may have been exposed to false or unsupported claims about “gender-affirming care”, especially as it relates to minors, and to gauge the harms consumers may be experiencing. In a  Request for Information , the FTC encourages members of the public to comment on any issues or concerns that are relevant to the FTC’s consideration of this topic, including by submitting any written data, advertisements, social media posts, disclosures, or empirical research. On July 9, 2025, the FTC  hosted a workshop  on unfair or deceptive trade practices in “gender-affirming care” for minors. The FTC heard testimony from doctors, medical ethicists, whistleblowers, detransitioners, and parents of detransitioners. That testimony indicated that practitioners of “gender-affirming care” may be actively deceiving consumers. Against this backdrop, the FTC seeks to evaluate whether consumers (in particular, minors) have been harmed and whether medical professionals or others may have violated Sections 5 and 12 of the FTC Act by failing to disclose material risks associated with “gender-affirming care” or making false or unsubstantiated claims about the benefits or effectiveness of “gender-affirming care.” The FTC has a long history of bringing enforcement actions  in this area  and is uniquely positioned to investigate this potentially unlawful activity. The public will have 60 days to  submit comments at Regulations.gov , no later than September 26, 2025. Once submitted, comments will be posted to Regulations.gov. Individuals wishing to submit confidential, non-public comments should reference the alternative submission guidelines in the RFI.  The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Today, the Federal Trade Commission launched a public inquiry to better understand how consumers may have been exposed to false or unsupported claims about “gender-affirming care”, especially as it",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Health Care",
    "Advertising and Marketing",
    "Children",
    "Health Claims"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-awarded-grant-upgrade-its-data-processing-capabilities-needed-analyze-data-used-investigations",
  "scraped_at": "2025-11-13T22:18:59.470908",
  "title": "FTC Awarded Grant to Upgrade its Data Processing Capabilities Needed to Analyze Data Used in Investigations",
  "published_date": "2025-07-28",
  "full_text": "The Federal Trade Commission has received a $14.6 million Technology Modernization Fund (TMF) grant that will enable the agency to enhance its in-house data processing capabilities and improve the way it analyzes data used in its investigations, saving both time and money. The grant will help the FTC meet President Trump’s goal to make government more efficient and cost effective by improving the agency’s ability to monitor and identify fraud and anti-competitive conduct. The FTC will use the grant to develop a comprehensive cloud-based analytics platform that leverages AI tools and train staff to handle complex data analysis in-house. These new tools will enable the agency to reduce the amount of time it takes to sift through data from weeks to hours. And doing this work in-house will save millions of dollars by reducing the agency’s reliance on more costly outside contractors. The  TMF provides grants to federal agencies  to modernize IT projects that have a high likelihood of success and generate savings and other benefits for taxpayers. The Federal Trade Commission works to  promote competition , and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Follow the  FTC on social media , read our  blogs  and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "The Federal Trade Commission has received a $14.6 million Technology Modernization Fund (TMF) grant that will enable the agency to enhance its in-house data processing capabilities and improve the",
  "tags": [
    "Consumer Protection",
    "Competition",
    "FTC Operations",
    "Office of the Chief Information Officer"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-doj-host-listening-session-lowering-americans-drug-prices-through-competition",
  "scraped_at": "2025-11-13T22:19:02.344664",
  "title": "FTC and DOJ Host Listening Session on Lowering Americans’ Drug Prices Through Competition",
  "published_date": "2025-08-01",
  "full_text": "The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "WHAT: The Federal Trade Commission and the Justice Department’s Antitrust Division, along with the Department of Commerce and the Department of Hea",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Health Care",
    "Drug Stores and Pharmacies",
    "Prescription Drugs"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-sends-money-student-loan-borrowers-harmed-debt-relief-scam",
  "scraped_at": "2025-11-13T22:19:03.560309",
  "title": "FTC Sends Money to Student Loan Borrowers Harmed by Debt Relief Scam",
  "published_date": "2025-08-05",
  "full_text": "The Federal Trade Commission is sending a total of $743,230 to student loan borrowers harmed by a debt relief scam that falsely promised loan forgiveness and bilked students out of millions. In its complaint against  BCO Consulting Services Inc., SLA Consulting Services Inc. and their owners Gianni Olilang, Brandon Clores, Kishan Bhakta, and Allan Radam , the FTC alleged the operators lured students seeking to reduce their loans into paying hundreds to thousands of dollars in illegal upfront fees. The defendants falsely told student loan borrowers that they were affiliated with the Department of Education and would take over servicing for students’ loans. The defendants convinced borrowers into believing that they were enrolled in a legitimate loan repayment program, that their loans would be forgiven in whole or in part, and that most or all of their payments to the companies would be applied to their loan balances. In reality, the defendants were pocketing students’ payments, according to the FTC’s complaint. In early October 2023, BCO Consulting, SLA Consulting Services, and their owners were permanently banned from the debt relief industry and were ordered to turn over their assets as part of a settlement with the FTC. The FTC is sending checks to 6,269 affected consumers. Recipients should cash their checks within 90 days, as indicated on the check. Consumers who have questions about their payment should contact the refund administrator, Analytics, at 844-656-5198, or visit the FTC website to  view frequently asked questions  about the refund process. The Commission never requires people to pay money or provide account information to get a refund. The Commission’s  interactive dashboards for refund data  provide a state-by-state breakdown of refunds in FTC cases. In 2024, FTC actions led to more than $339 million in refunds to consumers across the country. The Federal Trade Commission works to promote competition and to  protect and educate consumers .  The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize.  You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Like the FTC on  Facebook , follow us on  Twitter , get  consumer alerts , read our  blogs , and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "The Federal Trade Commission is sending a total of $743,230 to student loan borrowers harmed by a debt relief scam that falsely promised loan forgiveness and bilked students out of millions.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Debt Relief",
    "Education",
    "consumer refunds",
    "Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/06/ftc-sends-126-million-refunds-fortnite-players-who-were-charged-unwanted-items-reopens-claims",
  "scraped_at": "2025-11-13T22:19:05.038474",
  "title": "FTC Sends $126 Million in Refunds to Fortnite Players Who Were Charged for Unwanted Items, Reopens Claims Process",
  "published_date": "2025-06-25",
  "full_text": "The Federal Trade Commission is sending refunds totaling more than $126 million to players of the popular video game Fortnite who were charged for unwanted purchases while playing the game. The agency also announced it is reopening the process for Fortnite gamers and their parents or guardians to submit a claim for compensation stemming from the agency’s  2023 settlement with Fortnite developer Epic Games . The company agreed to pay $245 million to settle the FTC’s allegations that Epic used deceptive practices to trick players into making unwanted purchases. Eligible consumers who have not yet submitted a claim will now have until July 9, 2025, to submit one at  www.ftc.gov/fortnite . In December 2024, the FTC issued the first round of refunds, 629,344 payments totaling more than $72 million. As part of this latest round of refunds, the FTC will send 969,173 checks and PayPal payments on June 25 and June 26 to consumers who filed a valid claim. Today’s announcement brings the total amount of refunds the FTC has issued to consumers related to Epic’s deceptive billing practices to nearly $200 million. Consumers selected their payment method when they completed their claim form. Check recipients should cash their checks within 90 days, as indicated on the check. PayPal recipients should redeem their PayPal payments within 30 days. Consumers who have questions about their payment should contact the refund administrator, Rust Consulting, Inc, at 1-833-915-0880 or by email at  admin@fortniterefund.com . The Commission never requires people to pay money or provide account information to get a refund. The Commission’s  interactive dashboards for refund data  provide a state-by-state breakdown of refunds in FTC cases. In 2024, FTC actions led to more than $339 million in refunds to consumers across the country. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission is sending refunds totaling more than $126 million to players of the popular video game Fortnite who were charged for unwanted purchases while playing the game.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "consumer refunds",
    "Credit and Finance",
    "Payments and Billing",
    "Gaming"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/06/ftc-releases-agenda-workshop-unfair-or-deceptive-trade-practices-gender-affirming-care-minors",
  "scraped_at": "2025-11-13T22:19:06.236953",
  "title": "FTC Releases Agenda for Workshop on Unfair or Deceptive Trade Practices in “Gender-Affirming Care” for Minors",
  "published_date": "2025-06-25",
  "full_text": "The Federal Trade Commission  released a tentative agenda  for its July 9, 2025 workshop on “The Dangers of ‘Gender-Affirming Care’ for Minors.” The agenda includes doctors, medical ethicists, whistleblowers, detransitioners, and parents of detransitioners, who will share perspectives grounded in research, expertise, and personal experience. Speakers include FTC Chairman Andrew N. Ferguson, FTC Commissioner Melissa Holyoak, psychiatrist Dr. Miriam Grossman, endocrinologist Dr. Michael Laidlaw, and parent advocate Erin Friday. Section 5 of the Federal Trade Commission Act gives the FTC broad authority to protect consumers from unfair or deceptive acts or practices. The workshop will help the FTC to understand whether consumers are being or have been exposed to false or unsupported claims about “gender-affirming care” and to gauge the harms consumers may be experiencing. The workshop will begin at 9:00 am ET and will take place at the FTC’s Constitution Center building at 400 7th St SW Washington, D.C. 20024. For the safety of participants, in-person attendance at the event will be invitation only. Members of the public or press wishing to attend in person should email  healthcareworkshop@ftc.gov  to indicate interest. A link to watch the live webcast will be posted the morning of the event to FTC.gov. The livestream will be open to the public and does not require registration.  The Federal Trade Commission works to  promote competition , and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Follow the  FTC on social media , read our  blogs  and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "The Federal Trade Commission",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Advertising and Marketing",
    "Children"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/06/statement-grant-early-termination-ftcs-investigation-proposed-acquisition-kellanova-mars",
  "scraped_at": "2025-11-13T22:19:07.518763",
  "title": "Statement on the Grant of Early Termination of the FTC’s Investigation of the Proposed Acquisition of Kellanova by Mars",
  "published_date": "2025-06-25",
  "full_text": "Today, the FTC granted early termination of its review of Mars, Incorporated’s proposed acquisition of Kellanova. Mars is a global manufacturer of pet care, snacking, and food products. Kellanova owns legacy Kellogg brands, including in snacks, crackers, and frozen breakfasts, after spinning off its North American cereals business in 2023 as WK Kellogg Co. “The Commission cares deeply about any competition concerns that affect American consumers, including in food products,” said Daniel Guarnera, Director of the Bureau of Competition. “Commission staff closely reviewed every aspect of this transaction, including both specific product markets and potential portfolio effects from the acquisition. They turned over every stone needed to arrive at a robust assessment of the likely competitive effects of this transaction. After nearly a year of investigation, dozens upon dozens of interviews with non-parties at all levels of the supply chain (including large chains and small, independent businesses), extensive data analysis, sworn testimony from party witnesses, and the review of hundreds of thousands of documents, staff found that the evidence pointed in one direction: this transaction does not meet the standard for an anticompetitive merger set by Section 7 of the Clayton Act.” “In other countries, Mars and Kellanova offer different products than they do in the United States, and they face different market participants, consumer preferences, and shopping practices. Notably, Kellanova continues to sell breakfast cereal in other markets, including the European Union, that it does not sell in the United States,” continued Guarnera. “The Trump-Vance FTC takes an America First approach to antitrust enforcement. Our job is to protect competition and consumers in the United States. Our job is to determine whether there is a violation of American law that we can prove in court. And once we’ve concluded there is not, our job is to get out of the way.” The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Today, the FTC granted early termination of its review of Mars, Incorporated’s proposed acquisition of Kellanova. Mars is a global manufacturer of pet care, snacking, and food products.",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "Food and Beverages"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/06/ftc-sends-more-35-million-consumers-harmed-credit-game-credit-repair-scheme",
  "scraped_at": "2025-11-13T22:19:09.093096",
  "title": "FTC Sends More Than $3.5 Million to Consumers Harmed by  ‘The Credit Game’ Credit-Repair Scheme",
  "published_date": "2025-06-26",
  "full_text": "The Federal Trade Commission is sending more than $3.5 million in refunds to consumers harmed by a credit-repair scheme called ‘The Credit Game.’ In 2022,  the FTC sued  the scheme’s operators, Michael and Valerie Rando, and their companies, alleging that their operation illegally charged consumers hundreds and even thousands of dollars for credit-repair services that provided little to no value. The FTC’s complaint alleged that the defendants: The FTC’s action resulted in an order halting the company’s illegal operations and  banning  Michael and Valerie Rando from the credit-repair industry. The order also required them to turn over assets to provide refunds to consumers harmed by the scam. The FTC is sending checks and PayPal payments to 9,224 affected consumers. Check recipients should cash their checks within 90 days, as indicated on the check. PayPal recipients should redeem their PayPal payments within 30 days. Consumers who have questions about their payment should contact the refund administrator, Simpluris, at 833-296-0723, or visit the FTC website to  view frequently asked questions  about the refund process. The Commission never requires people to pay money or provide account information to get a refund. The Commission’s  interactive dashboards for refund data  provide a state-by-state breakdown of refunds in FTC cases. In 2024, FTC actions led to more than $339 million in refunds to consumers across the country. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission is sending more than $3.5 million in refunds to consumers harmed by a credit-repair scheme called ‘The Credit Game.’",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Credit & Loan Offers",
    "Debt Relief",
    "Going into Business",
    "consumer refunds",
    "credit cards",
    "Coronavirus (COVID-19)",
    "Finance",
    "Franchises, Business Opportunities, and Investments",
    "Credit and Finance",
    "Credit and Loans"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/06/ftc-takes-action-prevent-anticompetitive-effects-retail-gas-station-deal",
  "scraped_at": "2025-11-13T22:19:10.116408",
  "title": "FTC Takes Action to Prevent Anticompetitive Effects of Retail Gas Station Deal",
  "published_date": "2025-06-26",
  "full_text": "Today, the Federal Trade Commission took action to protect Americans from paying higher prices at the pump by resolving antitrust concerns surrounding Alimentation Couche-Tard Inc.’s (ACT) proposed $1.57 billion acquisition of 270 retail fuel outlets from grocery store chain Giant Eagle, Inc. ACT currently operates more than 7,100 stores in the United States, primarily under the brand Circle K. Under the  proposed consent order , the FTC will require ACT to divest 35 gas stations, which will be acquired by Majors Management, LLC. The consent order settles  FTC charges  that ACT’s deal with Giant Eagle is anticompetitive and will likely lead to higher fuel costs for consumers across Indiana, Ohio, and Pennsylvania. “This anticompetitive acquisition threatened to make Americans pay more at the pump by raising fuel prices,” said Daniel Guarnera, Director of the FTC’s Bureau of Competition. “The FTC’s action today preserves competition between gas stations that is critical for keeping fuel prices in check. The FTC will keep a watchful eye on retail fuel markets to make sure American consumers can spend less on gas and keep more money in their pockets.” As originally structured, ACT’s acquisition of Giant Eagle’s retail fuel outlets would eliminate head-to-head competition across 35 local markets in Indiana, Ohio, and Pennsylvania, the FTC’s complaint alleges. In these 35 local markets, ACT and Giant Eagle routinely monitor each other’s prices and currently use that information when setting their own prices for gasoline and diesel fuel. In addition, ACT and Giant Eagle stations are frequently located along the same traffic routes and are geographically close to each other, making them a clear, and sometimes the only, alternative for consumers. The complaint alleges that ACT would be able to raise fuel prices unilaterally after the proposed acquisition by eliminating current competition from Giant Eagle. Further, the acquisition threatens to lead to coordinated interaction between the remaining retail fuel outlets, since the merger would reduce the number of independent competitors in each local market. Majors, which will acquire the 35 divested gas stations, is an experienced operator of retail fuel outlets. This transaction will expand its geographic footprint as a new competitor in markets across Indiana, Ohio, and Pennsylvania, ultimately resolving the FTC’s antitrust concerns. The FTC’s proposed order requires the store divestitures and specifies, among other terms, that: The Commission vote to issue the complaint and accept the consent agreement for public comment was 3-0. Commissioner Mark R. Meador  issued a statement . The public will have 30 days to submit comments on the proposed consent agreement package. Instructions for filing comments appear on the docket. Once processed, they will be posted on  Regulations.gov . NOTE:  The Commission issues an administrative complaint when it has “reason to believe” that the law has been or is being violated, and it appears to the Commission that a proceeding is in the public interest. When the Commission issues a consent order on a final basis, it carries the force of law with respect to future actions. The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Today, the Federal Trade Commission took action to protect Americans from paying higher prices at the pump by resolving antitrust concerns surrounding Alimentation Couche-Tard Inc.’s (ACT) proposed",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "Energy",
    "Gasoline"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/federal-trade-commission-chairman-andrew-n-ferguson-issues-statement-made-usa-month",
  "scraped_at": "2025-11-13T22:19:11.238611",
  "title": "Federal Trade Commission Chairman Andrew N. Ferguson Issues Statement on ‘Made in the USA’ Month",
  "published_date": "2025-07-01",
  "full_text": "Today, Federal Trade Commission Chairman Andrew N. Ferguson issued the following statement proclaiming July 2025 as \"Made in the USA\" Month: “In honor of our nation’s independence, the Federal Trade Commission has designated July as ‘Made in the USA’ month. As Chairman of the FTC, I am responsible for enforcing laws that prohibit companies from making false or unsubstantiated claims that a product is ‘Made in the USA.’ It is important to protect Americans from deceptive advertising, and also important because it provides consumers with confidence that when they buy something that says ‘Made in the USA’ they are actually supporting American workers, American manufacturers, and American communities. In recent poll, 61% of Americans stated that whether a product was Made in the USA played a factor in their purchasing decisions. Americans rightly believe that American-made goods are higher quality and better for the environment than foreign-produced alternatives. Most importantly, Americans want to support their nation’s workers, manufacturers, and communities. Unfortunately, many products—from everyday household appliances to highly complex tools and machinery—which could be advertised as ‘Made in the USA’ are not. That’s why the FTC has created an  easy-to-read online guide  for companies who wish to advertise their products as ‘Made in the USA.’ While we want to enforce the law, we also want to help companies showcase that their products are made by American workers and that American manufacturing is an engine of American innovation, job creation, and economic growth.  ‘Made in the USA’ is not just a slogan, but a sign that a product truly connects us with the ingenuity, quality craftmanship, and livelihood of our fellow citizens. As we celebrate our nation’s independence this month, let us also remember to celebrate the hard-work, self-reliance, and pioneering spirt of our nation’s workers. When we buy a product that is ‘Made in the USA,’ we keep alive the spirit that won us our independence and has always made our country great.” The FTC has  additional guidance  on how to comply with the Made in USA Rule. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Today, Federal Trade Commission Chairman Andrew N. Ferguson issued the following statement proclaiming July 2025 as \"Made in the USA\" Month:",
  "tags": [
    "Consumer Protection",
    "Commissioners",
    "Manufacturing",
    "Advertising and Marketing",
    "Made in USA"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/06/former-ceo-voyager-digital-agrees-ban-28-million-payment-resolve-ftc-charges",
  "scraped_at": "2025-11-13T22:19:11.271114",
  "title": "Former CEO of Voyager Digital Agrees to Ban and $2.8 Million Payment to Resolve FTC Charges",
  "published_date": "2025-06-27",
  "full_text": "Stephen Ehrlich, the former CEO of crypto platform company Voyager Digital, will pay $2.8 million to resolve the Federal Trade Commission’s charges that he and his company misled consumers. Ehrlich has also agreed to a ban on marketing or selling retail products   or services used to buy, sell, deposit, or trade cryptocurrency. The FTC charged in its  October 2023 complaint  that Voyager and its CEO Stephen Ehrlich falsely promised that consumers’ deposits were FDIC-insured and would be “as safe with us as at a bank” to convince them to hold and trade cryptocurrency on Voyager. In reality, most funds were not FDIC-insured, and Voyager’s customers lost more than $1 billion in cryptocurrency when the company failed, according to the FTC’s complaint. The complaint also alleges that when the company failed it blocked consumers from accessing their assets, including their life savings, college tuition funds, and down payments for homes. Consumers were locked out of their cash accounts for more than a month, according to the complaint. The FTC previously reached a  settlement with Voyager Digital, LLC, and its affiliated companies , which the court entered on November 23, 2023. The  proposed settlement requires Ehrlich and his wife, Francine Ehrlich , who is named in the complaint as a relief defendant, to pay $2.8 million. The proposed settlement will also prohibit Stephen Ehrlich from: The Commission vote approving the stipulated final order was 3-0. The FTC filed the proposed order in the U.S. District Court for the Southern District of New York. Stipulated final orders have the force of law when approved and signed by the District Court Judge. The staff attorneys on this matter are Mark Glassman, Quinn Martin, and Elizabeth Arens of the FTC’s Bureau of Consumer Protection. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Stephen Ehrlich, the former CEO of crypto platform company Voyager Digital, will pay $2.8 million to resolve the Federal Trade Commission’s charges that he and his company misled consumers.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Investment",
    "deceptive/misleading conduct",
    "Technology",
    "Finance",
    "Advertising and Marketing",
    "Credit and Finance",
    "FinTech"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/06/ftc-doj-host-listening-session-lowering-americans-drug-prices-through-competition",
  "scraped_at": "2025-11-13T22:19:12.556750",
  "title": "FTC and DOJ Host Listening Session on Lowering Americans’ Drug Prices Through Competition",
  "published_date": "2025-06-30",
  "full_text": "The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "WHAT: The Federal Trade Commission and the Justice Department’s Antitrust Division, along with the Department of Commerce and the Department of Hea",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Health Care",
    "Drug Stores and Pharmacies",
    "Prescription Drugs",
    "Health Professional Services",
    "Pharmaceuticals"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-sends-more-29-million-consumers-harmed-home-improvement-financing-firm",
  "scraped_at": "2025-11-13T22:19:13.843673",
  "title": "FTC Sends More Than $2.9 Million to Consumers Harmed by Home Improvement Financing Firm",
  "published_date": "2025-07-08",
  "full_text": "The Federal Trade Commission is sending more than $2.9 million in payments to consumers harmed by Ygrene Energy Fund, a home-improvement financing company that made false claims about the potential financial impact of its services. According to the  FTC’s October 2022 complaint , Ygrene and its network of door-to-door home-improvement contractors deceptively sold Ygrene’s home-improvement financing program by telling homeowners that the financing program would not interfere with the sale or refinancing of their homes. The complaint also alleged that Ygrene’s contractors used high-pressure sales tactics, even forgery in some cases, to sign up consumers, which resulted in liens being recorded without the homeowner’s express, informed consent. As part of the settlement, Ygrene agreed to stop its deceptive and unfair practices, to monitor its contractors closely, and to pay $3 million to provide relief to certain consumers whose homes are still subject to the company’s liens. The settlement did not remove Ygrene’s liens, and those liens remain outstanding until paid. The FTC is sending checks and PayPal payments to 960 affected consumers. Check recipients should cash their checks within 90 days, as indicated on the check. PayPal recipients should redeem their PayPal payments within 30 days. Consumers who have questions about their payment should contact the refund administrator, Analytics Consulting LLC, at 877-412-1816, or visit the FTC website to  view frequently asked questions  about the refund process. The Commission never requires people to pay money or provide account information to get a refund. The Commission’s  interactive dashboards for refund data  provide a state-by-state breakdown of refunds in FTC cases. In 2024, FTC actions led to more than $339 million in refunds to consumers across the country. The Federal Trade Commission works to promote competition and to  protect and educate consumers .  The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize.  You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Like the FTC on  Facebook , follow us on  Twitter , get  consumer alerts , read our  blogs , and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "The Federal Trade Commission is sending more than $2.9 million in payments to consumers harmed by Ygrene Energy Fund, a home-improvement financing company that made false claims about the potential financial impact of its services.",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Bureau of Consumer Protection",
    "Western Region Los Angeles",
    "Credit & Loan Offers",
    "Energy Savings",
    "Mortgages",
    "deceptive/misleading conduct",
    "consumer refunds",
    "Advertising and Marketing",
    "Advertising and Marketing Basics",
    "Credit and Finance",
    "Credit and Loans",
    "Mortgages"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-grants-part-denies-part-encap-verdun-xcl-petition-modify-order",
  "scraped_at": "2025-11-13T22:19:14.821342",
  "title": "FTC Grants in Part, Denies in Part EnCap, Verdun, XCL Petition to Modify Order",
  "published_date": "2025-07-07",
  "full_text": "The Federal Trade Commission has approved in part and denied in part a petition to modify a final consent order involving the acquisition of EP Energy LLC (EP Energy) by a subsidiary of EnCap Capital Fund XI, L.P. and EnCap Investments L.P. (together, EnCap). The  2022 consent order  settled charges that the acquisition would harm competition for the sale of Uinta Basin waxy crude oil to Salt Lake City area refiners. The consent order required the divestiture of EP Energy’s entire business and assets in Utah, and required EnCap and its subsidiaries Verdun Oil Company II LLC (Verdun) and XCL Resources Holdings, LLC (XCL) to obtain prior approval from the FTC before engaging in certain acquisitions in the seven Utah counties comprising the Uinta Basin. EnCap, Verdun, and XCL  filed a petition  with the FTC  earlier this year  that sought to remove the prior-approval requirement. To support their request, the parties noted in the petition that XCL sold all its interests in the Uinta Basin and currently none of the parties compete in the market at issue in the complaint. In reviewing the petition to reopen and modify the order, the Commission determined that the 2022 order warranted some modification. The FTC’s  order modifying the petition  removes the prior-approval requirement for any reentry into the market by EnCap, Verdun, or XCL, as requested by the parties, and replaces the prior-approval requirement with a prior-notice requirement for any subsequent transaction involving oil- or gas-producing assets in the Uinta Basin area. Under the prior-notice requirement, EnCap, Verdun, and XCL will be required to notify the FTC of subsequent acquisitions involving oil- or gas-producing assets in the Uinta Basin area after they reenter the market, similar to existing reporting provisions under the Hart-Scott-Rodino Act. Requiring prior notice instead of prior approval helps alleviate the concerns underlying the petition relating to delays and uncertainty of prior approval while balancing the FTC’s mission to maintain competitive markets. The Commission vote approving the petition in part and denying it in part was 2-0-1, with Commissioner Melissa Holyoak recused.  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "The Federal Trade Commission has approved in part and denied in part a petition to modify a final consent order involving the acquisition of EP Energy LLC (EP Energy) by a subsidiary of EnCap Capit",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "Energy",
    "Natural Gas"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/federal-trade-commission-warns-companies-comply-made-usa-requirements",
  "scraped_at": "2025-11-13T22:19:17.483883",
  "title": "Federal Trade Commission Warns Companies to Comply with “Made in USA” Requirements",
  "published_date": "2025-07-08",
  "full_text": "Today, the Federal Trade Commission sent warning letters to four companies who claim their consumer goods are of U.S. origin, reminding them to comply with the FTC’s “Made in USA” requirements. Additionally, the FTC sent letters to Amazon and Walmart regarding third-party sellers who appear to be making deceptive “Made in USA” claims about their products on those online marketplaces.  “‘Made in the USA’ is not just a slogan – it’s a sign that a product connects us to the workers and businesses that make America great,” said FTC Chairman Andrew N. Ferguson. “Consumers want to have confidence that when they buy something labelled ‘Made in the USA’ they are actually supporting American workers and the American economy. Companies that falsely claim their products are ‘Made in the USA’ can expect to hear from the FTC.” The FTC sent warning letters to flagpole retailer  Americana Liberty , footwear maker  Oak Street Manufacturing, LLC , football equipment company  Pro Sports Group LLC , and personal care products manufacturer  USA Big Mountain Paper Inc . The warning letters explain that the FTC Act and the Made in USA Labeling Rule require that products advertised as “Made in the USA” must be “all or virtually all” made in the United States. The FTC warned these companies to discontinue such claims or provide substantiation that the products at issue are in fact “all or virtually all” made in the United States. Companies that violate the FTC Act and the MUSA Labeling Rule may be subject to legal action including the issuance of an administrative subpoena, the filing of a federal lawsuit, injunctive relief, and civil penalties or other monetary relief.  The FTC also sent letters to  Amazon  and   Walmart , explaining the FTC’s “Made in USA” requirements and how they apply to online marketplaces. The letters also identify third-party sellers who may be making deceptive U.S.-origin claims on those online marketplaces. In each letter, the FTC points out that such claims may violate the FTC Act and run afoul of the platform’s specific terms of service. Throughout July, the FTC is highlighting the importance of the FTC’s “Made in USA” requirements to ensure that Americans can trust that products advertised or labeled as “Made in USA” are actually American-made. The FTC offers  additional guidance  on how to comply with the Made in USA Rule.  The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Today, the Federal Trade Commission sent warning letters to four companies who claim their consumer goods are of U.S. origin, reminding them to comply with the FTC’s “Made in USA” requirements.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Manufacturing",
    "Advertising and Marketing",
    "Made in USA"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-host-july-9-workshop-unfair-or-deceptive-trade-practices-gender-affirming-care-minors",
  "scraped_at": "2025-11-13T22:19:19.123214",
  "title": "FTC to Host July 9 Workshop on Unfair or Deceptive Trade Practices in “Gender-Affirming Care” for Minors",
  "published_date": "2025-07-08",
  "full_text": "The Federal Trade Commission works to  promote competition , and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Follow the  FTC on social media , read our  blogs  and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "WHAT: The Federal Trade Commission is hosting a workshop on Unfair or Deceptive Trade Practices in “Gender-Affirming Care” for Minors, which will e",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Advertising and Marketing",
    "Children"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-sends-refunds-consumers-harmed-weight-loss-supplement-marketers-deceptive-claims-review",
  "scraped_at": "2025-11-13T22:19:19.970224",
  "title": "FTC Sends Refunds to Consumers Harmed by Weight-loss Supplement Marketer’s Deceptive Claims and Review Practices",
  "published_date": "2025-07-09",
  "full_text": "The Federal Trade Commission is sending payments totaling more than $409,000 to consumers who bought products from weight-loss supplement marketer Roca Labs. In 2018, a  federal court granted  the FTC’s request for summary judgment against Roca Labs over allegations Roca made baseless weight-loss claims for its products, misrepresented that one of its promotional websites was an objective information website, and failed to disclose its financial ties to that site and to people who posted positive reviews. The complaint also alleged that the defendants threatened to enforce “gag clause” provisions against consumers to stop them from posting negative reviews and testimonials online. Under the  order imposed by the court , Roca Labs was required to turn over certain funds, which the FTC is using to compensate consumers affected by the defendant’s deceptive claims. The FTC is sending checks and PayPal payments to 7,481 affected consumers. Check recipients should cash their checks within 90 days, as indicated on the check. PayPal recipients should redeem their PayPal payments within 30 days. The FTC is also sending 34 claim forms to consumers who paid for the defendant’s products before October 2015. The deadline to submit a claim is October 7, 2025. More information about the refund process is available at  www.ftc.gov/RocaLabs  or by calling the refund administrator, Simpluris, at 1-866-675-3043. The Commission never requires people to pay money or provide account information to get a refund. The Commission’s  interactive dashboards for refund data  provide a state-by-state breakdown of refunds in FTC cases. In 2024, FTC actions led to more than $339 million in refunds to consumers across the country. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission is sending payments totaling more than $409,000 to consumers who bought products from weight-loss supplement marketer Roca Labs.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Advertising and Marketing",
    "Health Claims"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-takes-action-against-telemedicine-firm-nextmed-over-charges-it-used-misleading-prices-fake",
  "scraped_at": "2025-11-13T22:19:20.832379",
  "title": "FTC Takes Action Against Telemedicine Firm NextMed Over Charges It Used Misleading Prices, Fake Reviews, and Deceptive Weight Loss Claims to Sell GLP-1 Weight-Loss Programs",
  "published_date": "2025-07-14",
  "full_text": "The operators of telemedicine company Southern Health Solutions, Inc., doing business as Next Medical and NextMed, have agreed to settle the Federal Trade Commission’s charges that they used deceptive cost and weight loss claims, as well as fake reviews and testimonials to lure consumers into buying their weight-loss membership programs that had hidden terms and conditions. In its  complaint, the FTC alleges that New York-based NextMed, its founders Robert Epstein, and CEO Frank Leonardo III  sold telehealth weight-loss programs providing access to medical providers who could prescribe popular glucagon-like peptide 1 agonist (GLP-1) weight-loss drugs, such as Wegovy and Ozempic, that were the subject of skyrocketing interest when NextMed began offering its weight-loss programs in early 2022. NextMed sold its membership programs at an advertised monthly price, typically at $138 or $188, without adequately disclosing that the price did not include the cost of the actual GLP-1 drug, the cost of the lab work required to determine eligibility for such drugs, or the cost of the consultation with a medical provider that was necessary to obtain a prescription. The complaint also alleges that NextMed failed to adequately disclose that its membership programs had a required one-year commitment with early termination fees, and that many customers who called to cancel or request refunds faced significant delays in resolving their complaints due to NextMed’s insufficient customer service staffing and capacity. The FTC also alleged that the company suppressed negative reviews on Trustpilot by selectively challenging critical reviews, offering Amazon gift cards to consumers to remove or change negative reviews, and by conditioning refunds on consumers’ agreement to remove negative reviews. In addition, the complaint alleges that the company generated fake positive reviews that were posted on Trustpilot and used testimonials and before-and-after photos from people who were not NextMed clients and had not used GLP-1 drugs for weight loss.   “Consumers who signed up for NextMed’s programs faced significant unexpected costs and the company’s customer service failures prevented consumers from cancelling or getting a refund,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection. “Today’s action makes clear that companies cannot hide important information from consumers or neglect their responsibility to respond to valid complaints and concerns.” In its complaint, the FTC alleges that NextMed, Epstein and Leonardo: In addition to requiring  NextMed and its principals to pay $150,000, which is expected to be used to provide refunds to consumers, the proposed consent order : The Commission vote to issue the administrative complaint and to accept the proposed consent agreement was 3-0. The FTC will publish a description of the consent agreement package in the Federal Register soon. The agreement will be subject to public comment for 30 days after publication in the Federal Register, after which the Commission will decide whether to make the proposed consent order final. Instructions for filing comments will appear in the published notice. Once processed, comments will be posted on Regulations.gov. NOTE:  The Commission issues an administrative complaint when it has “reason to believe” that the law has been or is being violated, and it appears to the Commission that a proceeding is in the public interest. When the Commission issues a consent order on a final basis, it carries the force of law with respect to future actions. Each violation of such an order may result in a civil penalty of up to $53,088. The staff attorney on this matter is Christine DeLorme of the FTC’s Bureau of Consumer Protection. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The operators of telemedicine company Southern Health Solutions, Inc., doing business as Next Medical and NextMed, have agreed to settle the Federal Trade Commission’s charges that they used decept",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Health",
    "Weight Loss",
    "Advertising and Marketing",
    "Endorsements, Influencers, and Reviews",
    "Health Claims",
    "Advertising and Marketing Basics"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-denies-sheffields-petition-reopen-set-aside-exxon-pioneer-final-order",
  "scraped_at": "2025-11-13T22:19:21.962935",
  "title": "FTC Denies Sheffield’s Petition to Reopen and Set Aside the Exxon-Pioneer Final Order",
  "published_date": "2025-07-15",
  "full_text": "The Federal Trade Commission denied a request filed by Scott Sheffield, the founder and former CEO of Pioneer Natural Resources, to reopen and set aside a final consent order involving Exxon Mobil Corporation’s acquisition of Pioneer. Sheffield’s  petition  to reopen and set aside the final order in its entirety must be denied because Sheffield is not a party to the final order and therefore cannot make use of the petition process, as defined by the FTC’s Rules of Practice, specifically Rule 2.51.  The FTC’s  final consent  order, issued in January 2025, prohibits Exxon from nominating, designating, or appointing Sheffield to the Exxon board of directors or from having him serve in an advisory capacity in any way to the Exxon board or Exxon’s management. In addition, the final consent order requires that for a period of five years, Exxon shall not nominate, designate, or appoint any Pioneer employee or director, other than certain named individuals, to the Exxon board. The final consent order resolved an FTC complaint  alleging  that Exxon’s acquisition of Pioneer was anticompetitive due to the proposed appointment of Sheffield to Exxon’s board of directors. The complaint alleged that Sheffield’s appointment would increase the likelihood of anticompetitive coordination and harm crude oil competition, based on allegations regarding Sheffield’s past communications with representatives of the Organization of Petroleum Exporting Countries (OPEC) concerning the output of oil and gas. Sheffield’s appointment to the board might also create an unlawful interlocking directorate, the complaint stated. While the FTC’s  complaint  made several references to Sheffield’s alleged conduct, it did not formally charge him with violating the antitrust laws, specifically Section 7 of the Clayton Act or Section 5 of the FTC Act. The  order denying the petition  states that Sheffield is not a party to the final consent order and thus lacks the requisite standing to file a petition under Rule 2.51. Requests and information from those not subject to an FTC order may be submitted to the Commission for review and consideration, but any action on such requests would be in the Commission’s discretion, and any resulting modification would follow the procedural requirements of Rule 3.72 within the FTC’s Rules of Practice. While Sheffield cannot make use of the petition process under Rule 2.51, the Commission plans to consider his arguments in support of reopening and vacating the final order under Rule 3.72. The vote denying the petition to reopen and set aside the order was 3-0.  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "The Federal Trade Commission denied a request filed by Scott Sheffield, the founder and former CEO of Pioneer Natural Resources, to reopen and set aside a final consent order involving Exxon Mobil",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "Interlocking directorates",
    "Energy",
    "Gasoline",
    "Natural Gas"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-action-against-e-commerce-business-opportunity-scam-results-permanent-bans-owner-his-companies",
  "scraped_at": "2025-11-13T22:19:23.266475",
  "title": "FTC Action Against E-Commerce Business Opportunity Scam Results in Permanent Bans for Owner and his Companies",
  "published_date": "2025-07-17",
  "full_text": "The remaining defendants in a business opportunity scheme halted by the Federal Trade Commission will turn over cash and property valued in the millions of dollars to settle allegations they lured consumers with false promises of big returns selling goods through Amazon’s and Walmart’s online marketplaces. Under the order, Steven J. Mayer and companies associated with him will turn over cash, real estate interests, and personal property which will be used for consumer redress. The FTC secured  similar settlements from the other defendants in this case in March 2025. “Sellers of e-commerce business opportunities and investments must follow the law,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection. “These defendants took advantage of people looking to provide for their families and obtain financial security. The FTC will take action against those who promise big returns that they can’t back up.” In October 2024, the FTC filed suit  alleging that the companies and their operators made false claims that consumers could earn significant profits from online e-commerce stores that the defendants would establish and operate on their behalf. For example, they promised that consumers would generate sales of “$100K+ per month” and that their stores could become “million-dollar” operations. These promises rarely, if ever, materialized. Most consumers lost tens of thousands of dollars investing with defendants, and many incurred crushing debts due to the alleged scam. The  first court order announced today  bans Mayer and Ecom Genie Consulting from any involvement with the sales, marketing, or operations of any business opportunity. It also prohibits them from deceiving consumers about any good or service they sell, including by making unsubstantiated earnings claims. The order contains a monetary judgment of nearly $14 million, which is partially suspended based on their inability to pay the full amount. The four defendants subject to that order, including relief defendants Alpine Management Group Inc. and Vicenza Capital Corp., are required to turn over their interest in commercial real estate in Canada, other property worth more than $300,000, and roughly $1.7 million in cash. If any of the defendants are found to have misled the FTC about their financial status, the full monetary judgment will immediately become due. The other  proposed order  bans Profitable Automation and Lunar Capital Ventures from any involvement with the sales, marketing, or operations of any business opportunity. The order also requires Profitable Automation to turn over roughly $73,000 in cash. The Commission vote approving the stipulated final orders was 3-0. The FTC filed the proposed orders   in the U.S. District Court for the Southern District of Florida. NOTE:  Stipulated final orders have the force of law when approved and signed by the District Court judge. The staff attorneys on this matter are Sara Tonnesen and Molly Rucki of the FTC’s Bureau of Consumer Protection. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The remaining defendants in a business opportunity scheme halted by the Federal Trade Commission will turn over cash and property valued in the millions of dollars to settle allegations they lured",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Work-at-Home",
    "Going into Business",
    "deceptive/misleading conduct",
    "Franchises, Business Opportunities, and Investments",
    "Advertising and Marketing",
    "Online Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-reopens-sets-aside-exxon-pioneer-final-order",
  "scraped_at": "2025-11-13T22:19:24.937586",
  "title": "FTC Reopens and Sets Aside Exxon-Pioneer Final Order",
  "published_date": "2025-07-17",
  "full_text": "Today, the Federal Trade Commission  reopened and set aside  the final consent order involving Exxon Mobil Corporation’s proposed acquisition of Pioneer Natural Resources Company. The FTC’s  final order  prohibited Exxon from nominating, designating, or appointing founder and former Pioneer CEO Scott Sheffield to Exxon’s board of directors or from serving in an advisory capacity in any way to the Exxon board or Exxon’s management. In addition, the final consent order required that for a period of five years, Exxon shall not nominate, designate, or appoint any Pioneer employee or director, other than certain named individuals, to Exxon’s board. The FTC’s May 2024  complaint  alleged that Mr. Sheffield sought to coordinate oil output levels with other crude oil producers, and that appointment to Exxon’s board would give him a larger platform for coordination and create an unlawful interlocking directorate. Now-Chairman Andrew N. Ferguson and Commissioner Melissa Holyoak  dissented  when the consent order was proposed. In January 2025, just days before President Trump’s inauguration, the outgoing majority approved the final consent order, again over the  dissent  of now-Chairman Ferguson and Commissioner Holyoak. In March 2025, Mr. Sheffield petitioned the FTC to reopen and vacate the order, and the FTC received over 3,000 comments from the public. Upon review of the matter, the FTC found that the complaint: The FTC  denied  Mr. Sheffield’s petition because he lacked standing. However, the FTC Act authorizes the Commission to modify a prior order when it is in the public interest. In light of the complaint’s deficiencies, the FTC concluded that maintaining the restrictions on Mr. Sheffield’s employment would damage the FTC’s credibility and undermine its mission. Vacating the final order is therefore in the public interest. Exxon has already consented to setting aside the final order and has waived all its rights under rule 3.72(b). Today’s decision accordingly sets aside the final order without further process. The vote to reopen and set aside the final order was 3-0. Commissioner Mark R. Meador  issued a statement .  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Today, the Federal Trade Commission reopened and set aside the final consent order involving Exxon Mobil Corporatio",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "Energy",
    "Gasoline",
    "Natural Gas"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-reopens-sets-aside-chevron-hess-final-order",
  "scraped_at": "2025-11-13T22:19:25.786861",
  "title": "FTC Reopens and Sets Aside Chevron-Hess Final Order",
  "published_date": "2025-07-17",
  "full_text": "Today, the Federal Trade Commission  reopened and set aside  the final consent order involving Chevron Corporation’s proposed acquisition of Hess Corporation. The  January 2025 final consent order  prohibited Chevron from nominating, designating, or appointing Hess CEO John B. Hess Chevron’s board of directors. The FTC’s  complaint  alleged that Mr. Hess made “supportive messaging” to representatives of the Organization of Petroleum Exporting Countries (OPEC) regarding their agenda to stabilize the oil market. The complaint alleged that Mr. Hess’s participation on Chevron’s board would amplify Mr. Hess’s messaging to OPEC and others, increasing the likelihood that Chevron would align its production with OPEC’s output decisions. When the settlement was published in September 2024, now-Chairman  Andrew N. Ferguson  and Commissioner  Melissa Holyoak  dissented. However, just days before President Trump’s inauguration, the outgoing majority approved the  final consent order , again over the dissent of now-Chairman Ferguson and Commissioner Holyoak. In March 2025, Chevron and Hess  petitioned  the Commission to reopen and modify the final consent order. After a period of public comment and review, the FTC found that the complaint: The FTC concluded that in light of these deficiencies, maintaining the restrictions on Mr. Hess’s employment would damage the FTC’s credibility and undermine its mission. Granting Chevron’s and Hess’s petition is therefore in the public interest. The vote approving the petition to reopen and set aside the order was 3-0. Commissioner Mark R. Meador  issued a statement .  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Today, the Federal Trade Commission reopened and set aside the final consent order involving Chevron Corporation’s pro",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "Energy",
    "Gasoline",
    "Natural Gas"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-halts-illegal-debt-relief-operation-falsely-impersonated-businesses-government-harming-consumers",
  "scraped_at": "2025-11-13T22:19:25.858575",
  "title": "FTC Halts Illegal Debt-Relief Operation that Falsely Impersonated Businesses and the Government, Harming Consumers",
  "published_date": "2025-07-21",
  "full_text": "At the Federal Trade Commission’s request, a federal court has  temporarily halted  an alleged debt relief services scheme that targeted seniors, including veterans, using a wide range of deceptive conduct, including falsely impersonating consumers’ banks and credit card companies as well as government agencies. The Commission filed a  complaint  against seven companies and three individuals operating the “Accelerated Debt” program that falsely claimed to reduce consumers’ debt by as much as 75% or more. The complaint also seeks monetary relief for consumers the companies defrauded. “The defendants falsely posed as consumers’ banks and credit bureaus to mislead them into paying thousands of dollars for their supposed debt relief services,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection. “What makes this case especially egregious is the defendants’ targeting of older Americans and veterans. The Commission will continue to stop such illegal and unethical conduct.” The Accelerated Debt defendants, acting as a common enterprise, operated a debt relief scam that took in an estimated $100 million, primarily targeting older consumers, some of whom are veterans, according to the complaint. For example, in papers filed along with the complaint, the FTC noted that one consumer, an Army veteran, was $13,000 deeper in debt and saw his credit score plummet from the high 700s to the 500s because of the defendants’ actions. He almost lost the security clearance required for his job after the defendants told him to stop paying his credit cards, which then went into default. Another consumer, a retired, disabled veteran, was forced to use his savings and retirement funds to repay the increased debt that he incurred as a result of the defendants’ actions and their unlawful advance fee of nearly $10,000. The defendants contacted consumers through telemarketing calls or in response to inbound calls resulting from their direct mail and online ads. The FTC alleges the defendants engaged in multiple illegal activities, including: Based on this conduct, the FTC alleges the defendants violated the FTC Act, the Telemarketing Sales Rule, the Impersonation Rule, and the Fair Credit Reporting Act. The complaint also alleges the defendants violated Section 521 of the Gramm-Leach-Bliley Act by making false statements to get consumers’ financial account numbers. The Commission vote approving the filing of the complaint was 3-0. The FTC filed the complaint in the U.S. District Court for the District of Arizona against: Accelerated Debt Settlement, Inc.; ADS Resolve LLC; Financial Solutions Group LLC; Unified Capital Services LLC; Mediawerks; Resolution Specialists LLC; Futura Capital LLC; Jeffery A. Lakes; Robert Knechtel; and Elizabeth Reaney. The staff attorneys on this matter are Gregory Ashe and Benjamin Cady in the FTC’s Bureau of Consumer Protection. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "At the Federal Trade Commission’s request, a federal court has",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Debt Relief",
    "deceptive/misleading conduct",
    "military",
    "Finance",
    "Credit and Finance",
    "Credit and Loans",
    "Debt"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-challenges-anticompetitive-medical-device-deal",
  "scraped_at": "2025-11-13T22:19:26.873875",
  "title": "FTC Challenges Anticompetitive Medical Device Deal",
  "published_date": "2025-08-06",
  "full_text": "The Federal Trade Commission today moved to block medical device supplier Edwards Lifesciences Corp.’s (Edwards) proposed acquisition of JenaValve Technology, Inc. (JenaValve) due to concerns that the acquisition would limit patient access to lifesaving medical devices used to treat a potentially fatal heart condition. The FTC alleges that over the span of two days in July 2024, Edwards executed agreements to acquire both JenaValve and JC Medical, the two leading companies competing to bring to market transcatheter aortic valve replacement devices that treat a heart condition called aortic regurgitation (TAVR-AR devices). Edwards closed its acquisition of JC Medical in July 2024, and its proposed $945 million acquisition of JenaValve would combine the only two companies with ongoing clinical trials in the United States for a TAVR-AR device. The deal threatens to reduce competition in the TAVR-AR market, likely resulting in reduced innovation, diminished product quality, and potentially increased prices for consumers, according to  the complaint . “ Edwards’ attempt to buy the U.S. market for TAVR-AR devices would eliminate the head-to-head competition that has spurred innovation for lifesaving artificial heart valves,” said Daniel Guarnera, Director of the FTC’s Bureau of Competition. “The FTC is taking action to stop this anticompetitive deal and ensure that JenaValve and Edwards’ JC Medical subsidiary continue competing to innovate, expand treatment eligibility, and keep down costs. Americans deserve all the benefits that come from competition between medical device makers, just as they do in other markets.” More than 8 million Americans suffer from aortic regurgitation, which occurs when the heart’s aortic valve does not close properly, causing blood to backflow into the heart. Currently, surgical valve replacement via open heart surgery is the only U.S. Food and Drug Administration (FDA) approved procedure to treat aortic regurgitation, and TAVR-AR devices offer a new and less invasive way to treat the condition. JenaValve is poised to become the first company to bring a TAVR-AR device, called Trilogy, to the commercial market in the United States. If Edwards acquires JenaValve, Edwards would gain control over the two most advanced TAVR-AR devices, the FTC complaint alleges. FDA approval or commercialization of any other TAVR-AR device in the United States by another company, aside from Edwards and JenaValve, is not expected for the foreseeable future. Direct head-to-head competition between Edwards, through its now-subsidiary JC Medical, and JenaValve has driven the two companies to accelerate the development of their TAVR-AR devices, the FTC’s complaint alleges. Ultimately, patients will benefit if JenaValve and Edwards continue to directly compete to complete their separate TAVR-AR device clinical trials, product improvements, and commercialization plans. The competition concerns caused by Edwards’ dual acquisition strategy are predicated on Edwards owning both JenaValve and JC Medical simultaneously, but Edwards has elected to attempt to buy JenaValve while retaining its ownership of JC Medical. Edwards has not been willing to engage on divesting JC Medical to resolve the competition concerns with the proposed JenaValve acquisition, according to the complaint. The Commission vote to issue an administrative complaint and authorize staff to seek a temporary restraining order and a preliminary injunction was 3-0. The federal court complaint and request for preliminary relief was filed in the U.S. District Court for the District of Columbia to halt the transaction pending an administrative proceeding. NOTE : The Commission issues an administrative complaint when it has “reason to believe” that the law has been or is being violated, and it appears to the Commission that a proceeding is in the public interest. The issuance of the administrative complaint marks the beginning of a proceeding in which the allegations will be tried in a formal hearing before an administrative law judge. The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "The Federal Trade Commission today moved to block medical device supplier Edwards Lifesciences Corp.’s (Edwards) proposed acquisition of JenaValve Technology, Inc.",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "Health Care",
    "Medical Equipment and Devices"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-seeks-comment-petition-vacate-2021-order-related-provider-stalkerware-apps",
  "scraped_at": "2025-11-13T22:19:27.133131",
  "title": "FTC Seeks Comment on Petition to Vacate 2021 Order  Related to Provider of Stalkerware Apps",
  "published_date": "2025-07-18",
  "full_text": "The Federal Trade Commission is seeking public comment on a request from Scott Zuckerman, the CEO of a company that marketed “stalkerware” apps, to vacate or modify the FTC’s order banning monitoring products and services and requiring implementation of an information-security program. In its  2021 complaint , the FTC alleged that Support King, LLC, which did business as SpyFone.com, and Zuckerman sold apps that allowed purchasers to secretly monitor devices without device-owner knowledge. The apps secretly collected and shared data on photos, text messages, web histories, location, and physical movements. SpyFone facilitated this by instructing purchasers on how to bypass security settings on the device where the apps were installed. Under  an order settling the FTC’s allegations , Support King and Zuckerman are banned from offering, promoting, selling, or advertising any surveillance app, service, or business. The order also requires the company and Zuckerman’s other businesses to develop an information-security program and obtain biennial assessments by a third party to ensure they are complying with the order’s requirements and other reporting obligations. In his petition, Zuckerman said Support King is permanently closed and claimed that the FTC’s order imposed an “excessive and unnecessary burden” on him personally. He said the financial costs of complying with the order prevented him from expanding his other businesses, which remain subject to the order’s requirements. In his petition, Zuckerman asked the Commission to either: The  public will have 30 days , until August 19, 2025, to submit comments on  the petition . Instructions for filing comments appear on the docket. Once processed, they will be posted on  Regulations.gov . After the comment period closes, the Commission will vote to determine how to resolve the petition. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission is seeking public comment on a request from Scott Zuckerman, the CEO of a company that marketed “stalkerware” apps, to vacate or modify the FTC’s order banning monitori",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Mobile",
    "Privacy and Security",
    "Consumer Privacy",
    "Data Security"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-data-show-more-four-fold-increase-reports-impersonation-scammers-stealing-tens-even-hundreds",
  "scraped_at": "2025-11-13T22:19:31.740694",
  "title": "FTC Data Show a More Than Four-Fold Increase in Reports of Impersonation Scammers Stealing Tens and Even Hundreds of Thousands from Older Adults",
  "published_date": "2025-08-07",
  "full_text": "New analysis from the Federal Trade Commission shows a more than four-fold increase since 2020 in reports from older adults who say they lost $10,000 or more—sometimes their entire life savings—to scammers who impersonate trusted government agencies or businesses to convince consumers to transfer money to protect it, when in reality the scammers want to steal it. The FTC’s latest  Consumer Protection Data Spotlight   shows a huge jump in losses reported by people 60 and over to these types of impersonation scams in the last four years. Most notably, combined losses reported by older adults who lost more than $100,000 increased eight-fold, from $55 million in 2020 to $445 million in 2024. While younger consumers also have reported these scams, older adults were much more likely to report these extraordinarily high losses. The scams generally involve someone contacting consumers to alert them to a fake and urgent problem and then proceeding to try to persuade them to transfer their money to “keep it safe” or for some other false reason. In reality, the money is being sent to the scammers. The lies these scammers tell generally take three forms: Ironically, some scammers even pretend to be with the FTC and tell people to transfer money out of their accounts, deposit cash into Bitcoin ATMS, and even hand off stacks of cash or gold to couriers—actions the FTC would never ask people to do. Regardless of the fake story, the goal is generally the same: to get your money. To avoid such scams, the FTC recommends: The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "New analysis from the Federal Trade Commission shows a more than four-fold increase since 2020 in reports from older adults who say they lost $10,000 or more—sometimes their entire life savings—to",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "deceptive/misleading conduct",
    "Government"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/assurance-iq-mediaalpha-pay-total-145-million-settle-ftc-charges-they-misled-consumers-seeking",
  "scraped_at": "2025-11-13T22:19:31.948544",
  "title": "Assurance IQ and MediaAlpha to Pay a Total of $145 Million to Settle FTC Charges That They Misled Consumers Seeking Health Insurance",
  "published_date": "2025-08-07",
  "full_text": "Assurance IQ, LLC and MediaAlpha, Inc. will pay a total of $145 million to settle Federal Trade Commission charges that they misled millions of consumers seeking to buy comprehensive health insurance. In two separate actions, the FTC alleged that both Assurance and MediaAlpha deceived consumers and led them to purchase plans that did not provide the promised health care coverage, and bombarded consumers with telemarketing and robocalls. “Coherently and systematically addressing unlawful lead generation is a priority for the FTC. That’s especially so in connection to health insurance, one of the most expensive and important products consumers buy to protect themselves and their families. Consumers should receive accurate, truthful, and non-misleading information about the coverage insurance provides,” said Christopher Mufarrige, Director of the Bureau of Consumer Protection. “The FTC will take action when lead generators or other sellers break the law and harm the American people.” Founded and operated by Michael Rowell and Michael Paulus, Seattle-based Assurance IQ, LLC, also doing business as Assurance, Assurance IQ, and National Family Assurance Corporation (collectively, Assurance), used telemarketing to deceptively market and sell health plans, specifically short-term medical (STM) and limited benefit indemnity (LBI) plans bundled with supplemental products like telemedicine plans, prescription discount plans, and dental and vision discount plans. According to the  FTC’s complaint , Assurance’s telemarketers made deceptive statements to consumers about the health plans’ actual costs and benefits, including that they provided coverage for preexisting conditions, did not have caps on benefits, allowed access to medical provider networks that would lower consumers’ costs significantly, and incorporated supplemental products. The complaint also alleges that Assurance unfairly charged consumers without first getting their express informed consent. The FTC alleges that this conduct violated the FTC Act and the Telemarketing Sales Rule (TSR). The  proposed court order  announced today resolving the FTC’s allegations imposes a $100 million judgment against Assurance for violating the TSR which will be used to provide refunds to consumers. It also prohibits Assurance from making a range of express and implied misrepresentations relating to health plans, including: The order also requires that Assurance have competent and reliable evidence to substantiate any claim it makes regarding any health plan and to truthfully disclose actual costs and any limitations on the use or benefits of any health plan it offers. In addition, the order bars Assurance from billing consumers for any health plan before getting express informed consent and from violating the TSR. The Commission vote approving the complaint and proposed stipulated final order against Assurance was 3-0. The FTC filed the complaint and proposed order   in the U.S. District Court for the Western District of Washington at Seattle. The staff attorneys on this matter have been Ben Halpern-Meekin and Stephen Fairchild of the FTC’s Northwest Region. Los Angeles-based MediaAlpha, Inc. and its operating subsidiary QuoteLab (collectively, MediaAlpha), use advertisements and websites claiming to provide health insurance quotes to collect information from consumers looking for insurance, so the information can be sold to telemarketers. In 2024, MediaAlpha sold approximately 119 million leads about consumers. According to the  FTC’s complaint , MediaAlpha has attracted consumers to their healthcare-related lead generation websites using misleading domains such as “ObamacarePlans.com” that imply they are associated with the government and claim that consumers will be able to buy low-cost, comprehensive health insurance that complies with the ACA. The FTC also alleged that MediaAlpha has hired actors and celebrities to promote a non-existent government “Health Insurance Give Back Program” to drive consumer traffic to its health sites. MediaAlpha even paid a doctor to appear in scripted “advertorial” news segments and suggest that “millions of Americans … were able to qualify for a great health plan for $1 a day” using the defendants’ lead generation services. Many consumers, including those whose phone numbers were listed on the national Do Not Call Registry, were flooded with robocalls and telemarketing calls that made false and misleading claims about the health care plans provided by MediaAlpha’s partners, who in fact rarely provided the low-cost comprehensive health care plans that Media Alpha promised, according to the complaint. The FTC alleged that MediaAlpha violated the FTC Act, the TSR, and the Impersonation Rule. The  proposed court order  resolving the FTC’s allegations imposes a $45 million judgment against MediaAlpha, which will be used to provide refunds to harmed consumers. The order also: The Commission vote approving the complaint and proposed stipulated final order against MediaAlpha and QuoteLab was 3-0. The FTC filed the complaint and proposed order   in the U.S. District Court for the Central District of California. The staff attorneys on this matter are Matthew Schiltz and Rachel Granetz of the FTC’s Midwest Region. NOTE:  The Commission files a complaint when it has “reason to believe” that the named defendants are violating or are about to violate the law and it appears to the Commission that a proceeding is in the public interest. The case will be decided by the court. Stipulated final orders have the force of law when approved and signed by the District Court judge. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Assurance IQ, LLC and MediaAlpha, Inc.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Health",
    "deceptive/misleading conduct"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/three-defendants-im-mastery-academy-scheme-agree-pay-25-million-settle-ftc-allegations",
  "scraped_at": "2025-11-13T22:19:33.261993",
  "title": "Three Defendants in the IM Mastery Academy Scheme Agree to Pay $2.5 Million  to Settle FTC Allegations",
  "published_date": "2025-08-07",
  "full_text": "Three of the defendants involved in the IM Mastery Academy scheme will pay $2.5 million to settle Federal Trade Commission allegations that they used false or baseless earnings claims to persuade people to pay for financial training programs and a multi-level marketing business venture. In their  complaint , the FTC and the state of Nevada allege that the scheme—which operated most recently as IYOVIA, but has also branded itself as IM Mastery Academy, iMarketsLive, and IM Academy—used false or baseless earning claims to entice consumers to purchase training on investment in financial markets. The scheme has used similar claims to persuade consumers to buy into defendants’ multi-level-marketing business venture, which involves marketing defendants’ training services to others. The defendants focused their deceptive marketing on young people and used social media posts flaunting luxurious and expensive lifestyles, purportedly funded by trading profits and multi-level-marketing commissions. The FTC alleged that, since 2018, the total harm to consumers exceeds $1.2 billion. Three of the defendants named in the FTC’s complaint, Global Dynasty Network, LLC, Jason Brown, and Matthew Rosa, have agreed to settle the allegations. The FTC and Nevada charged in their complaint that Brown and Rosa were two of the most highly compensated salespeople for the IM Mastery Academy scheme, made deceptive earnings claims, and instructed salespeople on how to make such claims without being detected. As detailed in the complaint, Brown was also a corporate officer of IM Mastery Academy and hired a third party to post fake positive reviews about IM Mastery Academy under a pseudonym. According to the complaint, Brown and Rosa collectively earned more than $36 million from the scheme; most of those funds were channeled through Brown and Rosa’s company, Global Dynasty Network. The  proposed order  with Global Dynasty Network, Brown, and Rosa imposes a $36 million judgment, which will be suspended after they pay $2.5 million. The total amount will be due if they are found to have lied about their finances. The proposed order permanently prohibits Global Dynasty Network, Brown, and Rosa from: The Commission vote approving the stipulated final order was 3-0. The FTC filed the proposed order   in the U.S. District Court for the District of   Nevada. Litigation with the other defendants is ongoing. NOTE:  Stipulated final orders have the force of law when approved and signed by the District Court judge. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Three of the defendants involved in the IM Mastery Academy scheme will pay $2.5 million to settle Federal Trade Commission allegations that they used false or baseless earnings claims to persuade p",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Work-at-Home",
    "Going into Business",
    "deceptive/misleading conduct",
    "Franchises, Business Opportunities, and Investments",
    "Advertising and Marketing",
    "Online Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/frank-romero-agrees-court-order-requiring-payment-ftc-mail-order-rule-violations",
  "scraped_at": "2025-11-13T22:19:34.465762",
  "title": "Frank Romero Agrees to Court Order Requiring Payment to the FTC for Mail Order Rule Violations",
  "published_date": "2025-08-08",
  "full_text": "Frank Romero, the operator of Trend Deploy, will be required to turn over the remaining funds in his bank and retirement accounts as part of a settlement with the Federal Trade Commission, which the FTC asked a court to approve yesterday. Romero failed to comply with a 2023 judgment stemming from an FTC lawsuit charging that he did not deliver personal protective equipment (PPE) as promised to consumers. In its  June 2021 complaint , the FTC alleged that Romero advertised the availability and quick delivery of PPE, including N95 facemasks, even though he had no basis to make those promises. According to the FTC, Romero did not deliver PPE on time (if at all), did not notify consumers of delayed shipments, did not offer cancellations and refunds required by the Mail Order Rule, and failed to honor refund requests. In addition, the PPE products he did send to consumers often were of lower quality that what they ordered. Based on this conduct, the FTC charged Romero with violating the Commission’s Mail Order Rule, the FTC Act, and the COVID-19 Consumer Protection Act. In May 2023, the court agreed and issued  a final judgment and order  for permanent injunction, ordering Romero pay a judgment allowing the Commission to refund consumers for his Mail Order Rule violations. Romero failed to comply in paying the order’s full monetary judgment. Since 2023, the FTC has taken additional actions to ensure Romero paid the judgment, including obtaining writs of garnishment and a post-judgment asset freeze, as well as filing a complaint to unwind transfers of property. The  proposed court order announced today  resolves the FTC’s litigation in this matter and will ensure that Romero turns over remaining assets in accounts he owes the Commission based on his deceptive conduct in this case. To do so, the proposed order requires Romero to make a cash payment to the agency and turn over assets in five accounts. The money collected will be used to provide refunds to defrauded consumers. The proposed order also requires Romero to relinquish all rights to the named assets and to cooperate in turning them over to the FTC. This settlement will benefit consumers by enabling the Commission to return money they lost in this scheme as expeditiously as possible. Finally, Romero remains bound by the injunction previously entered against him. The Commission vote approving the proposed stipulated final order was 3-0. The FTC filed the proposed order   in the U.S. District Court for the Middle District of Florida, Ocala Division. NOTE:  Stipulated final orders have the force of law when approved and signed by the District Court judge. The staff attorneys on this matter are Christopher Erickson and Brian Welke of the FTC’s Bureau of Consumer Protection. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Frank Romero, the operator of Trend Deploy, will be required to turn over the remaining funds in his bank and retirement accounts as part of a settlement with the Federal Trade Commission, which th",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Coronavirus (COVID-19)",
    "Health Care",
    "Over-the-Counter Drugs and Devices",
    "Advertising and Marketing",
    "Health Claims",
    "Online Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/match-group-agrees-pay-14-million-permanently-stop-deceptive-advertising-cancellation-billing",
  "scraped_at": "2025-11-13T22:19:35.591921",
  "title": "Match Group Agrees to Pay $14 Million, Permanently Stop Deceptive Advertising, Cancellation, and Billing Practices to Resolve FTC Charges",
  "published_date": "2025-08-12",
  "full_text": "Match Group, Inc., and Match Group, LLC (Match), the owners and operators of online dating services Match.com, OkCupid, PlentyOfFish, The League, and other dating sites, have agreed to pay $14 million, permanently stop misrepresenting guarantees and locking consumers out of paid-for accounts, and simplify Match.com’s cancellation processes to resolve the Federal Trade Commission’s charges. In  its September 2019 complaint, the FTC alleged that  Match: In addition to  requiring Match to pay $14 million, which the FTC   will use to provide redress to injured consumers, the proposed order also requires Match to: The Commission vote approving the stipulated final order was 3-0. The FTC filed the proposed order in the U.S. District Court for the Northern District of Texas. Stipulated final orders have the force of law when approved and signed by the District Court Judge. The lead staff attorney on this matter was Reid Tepfer together with attorneys Jason Moon, Hasan Aijaz, Erica Hilliard, Nicole Conte and Tammy Chung of the FTC’s Southwest Region. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Match Group, Inc., and Match Group, LLC (Match), the owners and operators of online dating services Match.com, OkCupid, PlentyOfFish, The League, and other dating sites, have agreed to pay $14 mill",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Southwest Region",
    "Bureau of Consumer Protection",
    "Online Dating",
    "Technology",
    "Advertising and Marketing",
    "Online Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-resolves-antitrust-concerns-arising-clean-truck-partnership",
  "scraped_at": "2025-11-13T22:19:36.833310",
  "title": "FTC Resolves Antitrust Concerns Arising from Clean Truck Partnership",
  "published_date": "2025-08-12",
  "full_text": "Today, the Federal Trade Commission closed its investigation into whether several truck and engine manufacturers and their trade association violated the antitrust laws by entering the “Clean Truck Partnership” with the California Air Resources Board (CARB). The Commission has determined that written commitments made by the manufacturers to the Commission, backed by reporting and disclosure obligations, have accomplished the objectives of this investigation. Four manufacturers—Daimler Truck, International Motors, PACCAR, and Volvo Group—control up to 99% of the heavy-duty truck market in the United States. Under the Clean Truck Partnership, these four manufacturers agreed in 2023 to abide by a series of CARB regulations limiting truck sales and greenhouse gas emissions. The Commission’s view, detailed in the  closing statement , is that the structure of the Clean Truck Partnership raised several antitrust concerns: Since the FTC opened its investigation, President Trump has signed legislation revoking CARB’s waivers from the Environmental Protection Agency, and the manufacturers largely have disclaimed the Clean Truck Partnership agreement. The FTC moved quickly to obtain major commitments from the four truck manufacturers and their trade association that would build on those developments. “CARB’s regulatory overreach posed a major threat to American trucking and, in our view, presented serious antitrust concerns,” said Taylor C. Hoogendoorn, Deputy Director of the Bureau of Competition. “The Bureau is pleased that the leading heavy-duty truck manufacturers agreed to a course correction. The Commission’s swift action will put the Clean Truck Partnership squarely in the rearview mirror and prevent repeats of CARB’s troubling regulatory gambit.”   The letters from  Daimler Truck ,  International Motors ,  PACCAR , and  Volvo Group  to the Commission state that the Clean Truck Partnership is unenforceable and that none of the manufacturers has ever or will ever attempt to enforce the Clean Truck Partnership’s terms against another manufacturer. Additionally, the manufacturers commit to acting independently and without regard for the Clean Truck Partnership’s restrictive provisions in attempting to sell heavy-duty trucks. Importantly, the manufacturers also agree not to enter any restrictive agreement with a U.S. state regulator or government permitting cross-enforcement among competitors or containing an agreement to comply with regulatory limits a state has no authority to impose or enforce. To bolster that prospective relief, the Truck & Engine Manufacturers Association, which represents a much larger range of truck manufacturers and was involved in negotiating the Clean Truck Partnership, has  also agreed  not to negotiate or enter into future agreements like the Clean Truck Partnership on behalf of its members. The Commission vote agreeing to close the investigation and accept the letter commitments was 3-0. Chairman Andrew N. Ferguson issued a  statement  joined by Commissioner Melissa Holyoak and Commissioner Mark R. Meador.  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Today, the Federal Trade Commission closed its investigation into whether several truck and engine manufacturers and their trade association violated the antitrust laws by entering the “Clean Truck",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Energy",
    "Manufacturing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-chairman-applauds-revocation-biden-harris-executive-order-competition",
  "scraped_at": "2025-11-13T22:19:38.029566",
  "title": "FTC Chairman Applauds Revocation of Biden-Harris Executive Order on Competition",
  "published_date": "2025-08-14",
  "full_text": "Federal Trade Commission Chairman Andrew N. Ferguson issued the following statement in response to  President Trump's revocation  of the Biden-Harris Administration’s 2021 Executive Order on competition policy: \"America’s markets are the most dynamic on Earth, responsible for enriching the entire world through technological innovations, lifting countless people out of poverty, and inspiring other countries to emulate our economic system.  Our markets thrive when they operate freely and when the Federal government does  not pick winners and losers but allows businesses to grow and innovate. Today’s withdrawal of the Biden-Harris Executive Order on competition marks another break between the last Administration’s failed policies and the Trump-Vance Administration's focus on protecting everyday Americans from anticompetitive practices through tailored action, promoting economic growth, and ensuring that American workers benefit from competition for their labor. The now-withdrawn Executive Order encouraged top-down competition regulations, and established a flawed philosophical underpinning for the Biden-Harris Administration’s undue hostility toward mergers and acquisitions. Consistent with President Trump’s  recent   Executive   Orders , the Trump-Vance FTC is devoting its resources to enforcing the antitrust laws passed by Congress, for the benefit of all American consumers and workers—lowering the cost of living, improving the quality of goods and services, fostering new innovations, and leading to ever-greater prosperity for our Nation.\"   The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Federal Trade Commission Chairman Andrew N.",
  "tags": [
    "Competition",
    "Commissioners",
    "Bureau of Competition"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/statement-ftc-grand-canyon-university-case",
  "scraped_at": "2025-11-13T22:19:39.243678",
  "title": "Statement from FTC on Grand Canyon University Case",
  "published_date": "2025-08-15",
  "full_text": "Today, the FTC dismissed its complaint against  Grand Canyon University . The Commission issued a  statement . The Commission vote authorizing staff to dismiss the complaint was 3-0. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Today, the FTC dismissed its complaint against Grand Canyon University.",
  "tags": [
    "Consumer Protection",
    "Commissioners",
    "Bureau of Consumer Protection",
    "Education",
    "Advertising and Marketing",
    "Telemarketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-takes-action-against-ticket-resellers-using-illegal-tactics-bypass-ticket-limit-protections",
  "scraped_at": "2025-11-13T22:19:40.558988",
  "title": "FTC Takes Action Against Ticket Resellers for Using Illegal Tactics to Bypass Ticket Limit Protections in Violation of Better Online Ticket Sales Act",
  "published_date": "2025-08-18",
  "full_text": "The Federal Trade Commission is suing a ticket broker operation for allegedly using unlawful tactics to exceed ticket purchasing limits for many popular events, including Taylor Swift’s Eras Tour, and resell the tickets at significantly higher prices, generating millions in revenue. “President Trump made it clear in his March Executive Order that unscrupulous middlemen who harm fans and jack up prices through anticompetitive methods will hear from us,” said FTC Chairman Andrew N. Ferguson. “Today’s action puts brokers on notice that the Trump-Vance FTC will police operations that unlawfully circumvent ticket sellers’ purchase limits, ensuring that consumers have an opportunity to buy tickets at fair prices.” The scheme is operated by Maryland-based ticket broker Key Investment Group and its affiliated companies, which have done business under such names as Epic Seats, TotalTickets.com LLC, and Totally Tix LLC, as well as Key Investment Group’s CEO, Yair D. Rozmaryn, Chief Financial Officer, Elan N. Rozmaryn, and Chief Strategic Officer, Taylor Kurth, according to  the FTC’s complaint . The FTC alleges that the operation uses a variety of tactics to bypass security measures implemented by Ticketmaster to block resellers from violating ticket purchasing limits. These security measures include monitoring whether purchases are associated with verifiable Ticketmaster accounts and unique credit cards and IP addresses. In addition, Ticketmaster sometimes requires purchasers to enter a code sent to their cell phone to verify their accounts. The complaint alleges that the defendants were often able to bypass these protections by: These tactics allowed the defendants to purchase at least 379,776 tickets in just over a year from Ticketmaster at a cost of nearly $57 million. Defendants resold a portion of those tickets on secondary marketplaces for approximately $64 million by, in many cases, charging a significant markup to consumers, according to the complaint. For just one Taylor Swift concert, the defendants allegedly used 49 different accounts to purchase 273 tickets, dramatically exceeding the Eras Tour’s 2023 six-ticket purchase limit per event. They then resold those tickets at a significant markup. The complaint alleges that the defendants violated the FTC Act and the Better Online Ticket Sales Act, which makes it illegal for any person to “circumvent a security measure, access control system, or other technological control or measure on an Internet website or online service that is used by the ticket issuer to enforce posted event ticket limits or to maintain the integrity of posted online ticket purchasing order rules.” The Commission vote authorizing the staff to file the complaint was 3-0. The FTC filed the complaint in the U.S. District Court   for the District of Maryland, Northern Division. NOTE:  The Commission files a complaint when it has “reason to believe” that the named defendants are violating or are about to violate the law and it appears to the Commission that a proceeding is in the public interest. The case will be decided by the court. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission is suing a ticket broker operation for allegedly using unlawful tactics to exceed ticket purchasing limits for many popular events, including Taylor Swift’s Eras Tour,",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "deceptive/misleading conduct",
    "Entertainment",
    "Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-takes-action-against-robot-toy-maker-allowing-collection-childrens-data-without-parental-consent",
  "scraped_at": "2025-11-13T22:19:41.255574",
  "title": "FTC Takes Action Against Robot Toy Maker for Allowing Collection of Children’s Data without Parental Consent",
  "published_date": "2025-09-03",
  "full_text": "The Federal Trade Commission is taking action against robot toy maker Apitor Technology over allegations that its app enabled a third party in China to collect geolocation information from children without parental consent. A  complaint, filed by the Department of Justice upon notification and referral from the FTC , alleges that despite claims in Apitor’s privacy policies that it complies with Children’s Online Privacy Protection Rule (COPPA Rule), Apitor failed to notify parents and obtain their consent before collecting, or causing a third party to collect, geolocation data from children as required by COPPA. “Apitor allowed a Chinese third party to collect sensitive data from children using its product, in violation of COPPA,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection. “COPPA is clear: Companies that provide online services to kids must notify parents if they are collecting personal information from their kids and get parents’ consent—even if the data is collected by a third party.” China-based Apitor sells robot toys targeted to children ages 6-14 and includes a free companion mobile app that allows users to program and control the toys. The complaint alleges that: As part of a  proposed order   settling the allegations, Apitor will be required to ensure that any third-party software it uses is in compliance with the COPPA Rule. Other provisions of the proposed order include a $500,000 penalty, which will be suspended because of the company’s inability to pay. Apitor will be required to pay the full amount if it is found to have lied about its finances. Apitor also will be required to delete any personal information the company collected in violation of COPPA unless it notifies parents and obtains their consent. In addition, Apitor must comply with COPPA by: The Commission voted 3-0 to refer the complaint and the proposed stipulated order to the Department of Justice for filing.    The DOJ filed the complaint and stipulated order in the U.S. District Court for the Northern District of California. NOTE:  The Commission authorizes the filing of a complaint when it has “reason to believe” that the named defendant is violating or is about to violate the law and it appears to the Commission that a proceeding is in the public interest. Stipulated orders have the force of law when approved and signed by the District Court judge. The lead staffers on this matter are Shining J. Hsu and Evan Rose from the FTC’s Western Region San Francisco office. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission is taking action against robot toy maker Apitor Technology over allegations that its app enabled a third party in China to collect geolocation information from children",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Bureau of Consumer Protection",
    "Western Region San Francisco",
    "Children's Online Privacy Protection Act (COPPA)",
    "Privacy and Security",
    "Children's Privacy",
    "Tech",
    "Social Media"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-sues-la-fitness-making-it-difficult-consumers-cancel-gym-memberships",
  "scraped_at": "2025-11-13T22:19:41.709165",
  "title": "FTC Sues LA Fitness for Making it Difficult for Consumers to Cancel Gym Memberships",
  "published_date": "2025-08-20",
  "full_text": "The Federal Trade Commission today sued the operators of LA Fitness and other gyms over allegations they make it exceedingly difficult for consumers to cancel their gym memberships and related services that continued indefinitely unless cancelled. The agency is seeking a court order prohibiting the allegedly unfair conduct and money back for consumers harmed by the difficulty in cancelling memberships. “The FTC’s complaint describes a scenario that too many Americans have experienced – a gym membership that seems impossible to cancel,” said Christopher Mufarrige, Director of the Bureau of Consumer Protection. “Tens of thousands of LA Fitness customers reported difficulties – cancellation was often restricted to specific times or required speaking to specific managers who were often not present or available. The FTC will not hesitate to act on behalf of consumers when it believes companies are stifling consumers’ ability to choose which recurring charges they want to keep.” California-based Fitness International, LLC and Fitness & Sports Clubs, LLC operate LA Fitness and other gym chains, including Esporta Fitness, City Sports Club, and Club Studio, that have more than 600 locations and over 3.7 million members nationwide. The two companies offer gym memberships that cost can cost between $30 and $299 a month, depending on the gym, along with optional add-on services such as towel service. When signing up for a membership, the consumer initially pays the first and last month’s dues, followed by monthly recurring dues and annual fees. LA Fitness clubs also offer personal training memberships, which have fixed initial terms followed by a recurring monthly membership. According to the  Commission’s complaint , LA Fitness uses opaque and complicated methods to make it extremely difficult for consumers to cancel their memberships. LA Fitness has required consumers who want to cancel their membership to either go to the gym itself or send a cancellation notice by mail. To start the process, LA Fitness has instructed consumers to log into its website and print a cancellation form. But even logging in can be cumbersome because consumers often do not recall their login credentials, and LA Fitness requires consumers to use the email address used to establish membership, the “key tag” number assigned at start up, and the first five digits of their credit card or bank account number to reset their login credentials. Even after completing this task, consumers who tried to cancel in person still faced obstacles, according to the complaint. Consumers could only cancel with one specific employee, even though LA Fitness authorized several employees to sign consumers up for memberships. This restricted cancellation hours to times when consumers are typically at work, despite most locations operating up to 19 hours per day, seven days per week. Consumers who tried to cancel by mail also faced challenges, according to the complaint. While consumers were told to use the LA Fitness website to download and print the cancellation form, the company did not clearly inform consumers that they also have the option to just submit a written notice of their cancellation and did not tell them what information to include in such a request. Further, consumers were told that the mailed cancellation forms or requests should be sent certified or registered mail, causing the consumers to incur additional costs. In addition, LA Fitness has failed to clearly inform consumers that they can cancel add-on amenities and services individually, without affecting their gym membership, according to the complaint. For example, it failed to disclose that such services could be cancelled by virtually any gym employee. Finally, instead of simplifying the cancellation process in response to consumer complaints, LA Fitness has trained staff to reject escalated requests and to deny cancellations requested by phone or email, reiterating that all cancellations must be done in person with one specific employee or by mail. Consumers who try to cancel their memberships by stopping charges to their bank or credit card find they are rebilled, often under new account numbers. The FTC alleges such practices violate the FTC Act and the Restore Online Shoppers’ Confidence Act (ROSCA). The Commission vote authorizing the staff to file the complaint was 3-0. The complaint was filed in the U.S. District Court for the Central District of California. NOTE:  The Commission files a complaint when it has “reason to believe” that the named defendants are violating or are about to violate the law and it appears to the Commission that a proceeding is in the public interest. The case will be decided by the court. The FTC staff attorneys on this matter are Serena Mosley-Day, Reid Tepfer, and Edward Hynes of the agency’s Southwest Region. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission today sued the operators of LA Fitness and other gyms over allegations they make it exceedingly difficult for consumers to cancel their gym memberships and related serv",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Southwest Region",
    "Bureau of Consumer Protection",
    "Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-chairman-ferguson-warns-companies-against-censoring-or-weakening-data-security-americans-behest",
  "scraped_at": "2025-11-13T22:19:42.269865",
  "title": "FTC Chairman Ferguson Warns Companies Against Censoring or Weakening the Data Security of Americans at the Behest of Foreign Powers",
  "published_date": "2025-08-21",
  "full_text": "Federal Trade Commission Chairman Andrew N. Ferguson sent letters today to more than a dozen prominent technology companies reminding them of their obligations to protect the privacy and data security of American consumers despite pressure from foreign governments to weaken such protections. He also warned them that censoring Americans at the behest of foreign powers might violate the law. The   letters  were sent to companies that provide cloud computing, data security, social media, messaging apps and other services and include: Akamai, Alphabet, Amazon, Apple, Cloudflare, Discord, GoDaddy, Meta, Microsoft, Reddit, Signal, Snap, Slack and X. The letters noted that companies might feel pressured to censor and weaken data security protections for Americans in response to the laws, demands, or expected demands of foreign powers. These laws include the European Union’s Digital Services Act and the United Kingdom’s Online Safety Act, which incentivize tech companies to censor worldwide speech, and the UK’s Investigatory Powers Act, which can require companies to weaken their encryption measures to enable UK law enforcement to access data stored by users. “I am concerned that these actions by foreign powers to impose censorship and weaken end-to-end encryption will erode Americans’ freedoms and subject them to myriad harms, such as surveillance by foreign governments and an increased risk of identity theft and fraud,” Chairman Ferguson wrote. The letter noted that as companies consider how to comply with foreign laws and demands, they are still required to comply with the FTC Act’s prohibition against unfair and deceptive practices in the marketplace. For example, if a company promises consumers that it encrypts or secures online communications but then adopts weaker security in response to demands from a foreign government, such an action could be considered a deceptive practice under the FTC Act, the letter noted. The FTC has brought dozens of cases over the past two decades against companies that have failed to keep their promises to consumers to deploy reasonable safeguards to protect consumer data.  The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Federal Trade Commission Chairman Andrew N.",
  "tags": [
    "Consumer Protection",
    "Commissioners",
    "Bureau of Consumer Protection",
    "Technology",
    "Privacy and Security",
    "Consumer Privacy",
    "Data Security"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-publishes-proposed-2026-budget-horseracing-integrity-safety-authority",
  "scraped_at": "2025-11-13T22:19:44.716958",
  "title": "FTC Publishes Proposed 2026 Budget for Horseracing Integrity and Safety Authority",
  "published_date": "2025-09-03",
  "full_text": "The Federal Trade Commission published in the  Federal Register  the Horseracing Integrity and Safety Authority’s proposed 2026 budget as submitted to the Commission. The  FTC’s rule regarding  oversight of the Authority’s budget process requires the publication of the Authority’s proposed budget in the Federal Register for public comment. The public will have 14 days from the date of publication to submit comments, after which the Commission will approve or disapprove the proposed budget. Information about how to submit a comment is included in the Federal Register notice. Comments will be published on Regulations.gov after they are submitted. The Federal Trade Commission works to  promote competition , and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Follow the  FTC on social media , read our  blogs  and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "The Federal Trade Commission published in the Federal Register the Horseracing Integrity and",
  "tags": [
    "FTC Operations",
    "Office of the General Counsel",
    "Horseracing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-takes-action-against-operators-pornhub-other-pornographic-sites-deceiving-users-about-efforts",
  "scraped_at": "2025-11-13T22:19:47.070667",
  "title": "FTC Takes Action Against Operators of Pornhub and other Pornographic Sites for Deceiving Users About Efforts to Crack Down on Child Sexual Abuse Material and Nonconsensual Sexual Content",
  "published_date": "2025-09-03",
  "full_text": "The Federal Trade Commission and the state of Utah are taking action against the operators of Pornhub and other pornography-streaming sites over charges they deceived users by doing little to block tens of thousands of videos and photos featuring child sexual abuse material (CSAM) and nonconsensual material (NCM) despite claiming that this content was “strictly prohibited.” As part of a  proposed order settling the allegations , Pornhub’s operators, Aylo and its affiliated companies (collectively Aylo), will be required to establish a program to prevent the distribution of CSAM and NCM on its websites and pay a $5 million penalty to the state of Utah. “Pornhub’s operators turned a blind eye to the proliferation of videos depicting the sexual abuse of children on its sites so it could profit off this exploitation,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection. “Under the order we’re announcing today, Pornhub’s operators will be required to take concrete steps to block this harmful content and ensure that those who appear in videos on their sites are consenting adults.” “Pornhub’s operators inflicted grave harm on children and nonconsenting adults by promoting and distributing truly horrific material online,” said FTC Commissioner Melissa Holyoak, who appeared at a news conference in Salt Lake City with Utah officials. “As today’s complaint and proposed order make clear, the FTC will use every tool in its arsenal to stop such outrageous conduct.”    “This consent order is an important step in protecting people from some of the most harmful and exploitative material online,” said Utah Gov. Spencer J. Cox. “Companies that profit from such conduct must be held accountable. I’m grateful to the FTC and our Division of Consumer Protection for their work to safeguard Utah’s children and families.” Aylo, formerly known as MindGeek, operates more than 100 pornographic photo and video-streaming websites including free ad-based “tube” sites such as Pornhub, YouPorn and RedTube, which allow users to upload their own videos, and paid sites including Pornhub Premium, all of which are available in the United States and around the world. These sites have attracted hundreds of millions of monthly visits by U.S. consumers alone. In their  complaint , the FTC and Utah alleged Aylo deceived users by claiming it has zero tolerance for CSAM and works to block CSAM and NCM on its sites by, among other things, taking prompt action when videos are flagged by users. In reality, Aylo failed to review videos flagged by users, did not ban uploaders of CSAM from further use of their websites, did not prevent the reupload of CSAM that Aylo had identified, and did not review all videos before they went live for CSAM or NCM. The FTC alleged that Aylo engaged in unfair practices by distributing CSAM and NCM content on its sites, which Aylo’s Manager of Operations and Child Safety acknowledged “revictimizes” the individuals who were abused in the creation of the content. In its complaint, the FTC alleged: The complaint also alleged that Aylo deceived consumers by failing to protect the privacy and security of data—such as their dates of birth, Social Security numbers and government-issued IDs—uploaded by people enrolled in their model program, which included those who appear in their videos. In December 2020, Aylo announced it would use a third-party vendor to verify the identities of people seeking to participate in its model program and collect, review and secure their ID documents. Aylo, however, failed to disclose that it obtains the data from the vendor and retains it indefinitely. Aylo also told its models that they could “trust that their personal data remains secure” yet failed to use standard security measures to protect the data. For example, Aylo did not encrypt the personal data it stored, failed to limit access to the data, and did not store the data behind a firewall. The proposed order settling the FTC and Utah allegations imposes a $15 million penalty against Aylo, which will be suspended after payment of $5 million to Utah, and permanently prohibits Aylo from misrepresenting its practices related to preventing the posting and proliferation of CSAM and NCM on its websites. Aylo also will be required to take multiple actions to address the deceptive and unfair conduct outlined in the complaint including: The Commission vote authorizing the staff to file the complaint and stipulated final order was 3-0. The FTC and Utah filed the complaint and stipulated order in the U.S. District Court for the District of Utah. Chairman Andrew N. Ferguson  issued a statement , joined by Commissioners Melissa Holyoak and Mark R. Meador. Commissioner Meador also  issued a separate statement .  NOTE:  The Commission files a complaint when it has “reason to believe” that the named defendants are violating or are about to violate the law and it appears to the Commission that a proceeding is in the public interest. Stipulated final orders have the force of law when approved and signed by the District Court judge. The lead staffers on this matter are Jacqueline Ford, Manmeet Dhindsa, and Alejandro Rosenberg from the FTC’s Bureau of Consumer Protection. The FTC collaborated with the Office of the Privacy Commissioner of Canada on this matter. To facilitate cooperation with its Canadian partner, the FTC relied on key provisions of the U.S. SAFE WEB Act, which allows the FTC to receive and share information with foreign counterparts to combat deceptive and unfair practices that cross national borders. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission and the state of Utah are taking action against the operators of Pornhub and other pornography-streaming sites over charges they deceived users by doing little to block",
  "tags": [
    "Consumer Protection",
    "Commissioners",
    "Bureau of Consumer Protection",
    "Entertainment",
    "Privacy and Security",
    "Consumer Privacy",
    "Data Security"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/defendants-im-mastery-academy-scheme-pay-105-million-settle-ftc-allegations",
  "scraped_at": "2025-11-13T22:19:47.591047",
  "title": "Defendants in IM Mastery Academy Scheme to Pay $10.5 Million to Settle FTC Allegations",
  "published_date": "2025-09-04",
  "full_text": "Two defendants will pay a total of $10.5 million to settle Federal Trade Commission and State of Nevada allegations that they used false or baseless earnings claims to persuade people to pay for financial training programs and a multi-level-marketing business venture as part of the IM Mastery scheme. The proposed order against Alex Morton, IM Mastery’s executive vice president of sales, and the order against Brandon Boyd, who was an IM Mastery salesman, follow other recent FTC actions to halt the operation’s deceptive practices. Last month, the FTC and Nevada  obtained a preliminary injunction  against the three companies that executed the  IM Mastery Academy scheme  and the two individuals who have led it, and also obtained $2.5 million  as part of a settlement  with three other defendants involved in the scheme, which had been in operation since at least 2018. In their  complaint , the FTC and Nevada allege that the scheme—which operated most recently as IYOVIA, but has also branded itself as IM Mastery Academy, iMarketsLive, and IM Academy—used false or baseless earning claims to entice consumers to purchase training on investment in financial markets. The scheme has used similar claims to persuade consumers to buy into defendants’ multi-level-marketing business venture, which involves marketing defendants’ training services to others. The defendants focused their deceptive marketing on young people and used social media posts flaunting luxurious and expensive lifestyles, purportedly funded by trading profits and multi-level-marketing commissions. The FTC alleges that Morton and Boyd, who were among the scheme’s highest earning salespeople, have used deceptive earnings claims to recruit new consumers to IML. Boyd, who earned nearly $6 million from the scheme, was featured in some of the training videos instructing salespeople how to recruit new members and advertised as a “Master Instructor”—despite having no trading expertise, investment industry licenses or accreditation. Morton advised top salespeople on how to post deceptive earnings claims online in ways that will evade the company’s compliance program and law enforcement, according to the complaint. The  proposed order against Morton   imposes a $76.2 million judgment, which will be suspended after he pays $10 million. The total amount will be due if Morton is found to have lied about his finances. The proposed order permanently bans Morton from taking part in any multi-level marketing of trading-training services and from offering any good or service with a negative-option feature unless he clearly discloses the terms and obtains consumers’ consent to be charged. The  order against Boyd , which the court entered on August 20, 2025, imposes a $6.3 million judgment, which is suspended following Boyd’s payment of $500,000. Again, the total amount will be due if Boyd is found to have lied about his finances. The order permanently bans Boyd from providing, assisting others in providing, or representing that he can provide education or instruction relating to any trading-training services. Under both orders, Boyd and Morton also are permanently prohibited from: The Commission voted 3-0-1 to approve the stipulated orders, with Commissioner Rebecca Slaughter not participating. The FTC filed the proposed orders in the U.S. District Court for the District of Nevada. NOTE:  Stipulated final orders have the force of law when approved and signed by the District Court judge. The lead staffers on this matter are Tom Biesty, Laura Basford, Ron Brooke, and Josh Doan in the FTC’s Bureau of Consumer Protection. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Two defendants will pay a total of $10.5 million to settle Federal Trade Commission and State of Nevada allegations that they used false or baseless earnings claims to persuade people to pay for fi",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Work-at-Home",
    "Going into Business",
    "deceptive/misleading conduct",
    "Franchises, Business Opportunities, and Investments",
    "Advertising and Marketing",
    "Online Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-takes-action-protect-workers-noncompete-agreements",
  "scraped_at": "2025-11-13T22:19:48.726222",
  "title": "FTC Takes Action to Protect Workers from Noncompete Agreements",
  "published_date": "2025-09-04",
  "full_text": "The Federal Trade Commission today took action to protect American workers from harmful labor practices by ordering pet cremation company Gateway Services, Inc. and its subsidiary to stop enforcing noncompete agreements against their employees. In a complaint  filed against Gateway Services and its subsidiary Gateway US Holdings, Inc., (collectively referred to as Gateway), the FTC alleges that Gateway imposed noncompete agreements on almost all of its employees, which typically prohibited employees from working in the pet cremation service industry anywhere in the U.S. for one year after leaving Gateway. Under a  proposed FTC consent order , Gateway must, among other terms, immediately stop enforcing all existing noncompete agreements. The FTC’s proposed order will free nearly 1,800 employees from these restrictive agreements that limit job mobility and the ability to negotiate better wages and benefits. “The Commission will stand up for workers and ensure that they receive all the benefits that flow from robust competition between employers,” said Daniel Guarnera, Director of the FTC’s Bureau of Competition. “The antitrust laws protect workers from noncompete agreements that harm competition, including by preventing workers from switching to better-paying jobs or starting their own businesses. We will protect workers by enforcing the laws against anticompetitive noncompetes.” The Trump-Vance FTC has prioritized investigating and prosecuting deceptive, unfair, and anticompetitive labor-market practices, including through the creation of a cross-agency  Joint Labor Task Force .  “Under the leadership of Chairman Ferguson, the FTC is working hard every day to marshal resources across the agency to uproot unfair and unreasonable employment agreements that drive down wages and reduce job mobility,” said Kelse Moen, Deputy Director of the Bureau of Competition and co-chair of the Joint Labor Task Force. “The Trump-Vance FTC will never stop fighting for American workers. Rest assured: today’s action will not be the last.” Gateway is the largest pet cremation business in the U.S. with over 100 locations servicing 17,000 veterinary clinics across North America. In 2019, Gateway adopted its noncompete policy for all newly hired employees, regardless of their position or responsibilities, according to the FTC’s complaint. These agreements currently bind employees ranging from highly compensated executives to hourly, facility laborers, who make up a majority of Gateway’s employees. Gateway’s noncompete agreements are anticompetitive because they unfairly alter the bargaining positions between employees and Gateway, the FTC’s complaint alleges. In addition, these agreements suppress competition as they likely impede the entry or expansion of competing pet cremation services businesses, while also preventing or discouraging Gateway employees from opening competing businesses. The FTC’s proposed consent order states, among other terms, that: The Commission vote to issue the complaint and accept the proposed consent agreement for public comment was 3-1, with Commissioner Rebecca Kelly Slaughter dissenting. Chairman Andrew N. Ferguson  issued a statement  joined by Commissioner Melissa Holyoak. Commissioner Slaughter  issued a statement . The public will have 30 days to submit comments on the proposed consent agreement package. Instructions for filing comments appear on the docket. Once processed, they will be posted on  Regulations.gov . NOTE:  The Commission issues an administrative complaint when it has “reason to believe” that the law has been or is being violated, and it appears to the Commission that a proceeding is in the public interest. When the Commission issues a consent order on a final basis, it carries the force of law with respect to future actions. The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "The Federal Trade Commission today took action to protect American workers from harmful labor practices by ordering pet cremation company Gateway Services, Inc.",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Nonmerger",
    "Veterinarians",
    "Noncompete"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/federal-trade-commission-issues-request-information-employee-noncompete-agreements",
  "scraped_at": "2025-11-13T22:19:49.688506",
  "title": "Federal Trade Commission Issues Request for Information on Employee Noncompete Agreements",
  "published_date": "2025-09-04",
  "full_text": "Today the Federal Trade Commission  launched a public inquiry  to better understand the scope, prevalence, and effects of employer noncompete agreements, as well as to gather information to inform possible future enforcement actions. A noncompete agreement is a contractual term between an employer and a worker that typically blocks the worker from working for a competing employer or starting a competing business after the end of the worker’s employment. While noncompete agreements can serve valid purposes in some circumstances, available evidence indicates that they are often subject to abuse. Members of the public including current and former employees restricted by noncompete agreements, and employers facing hiring difficulties due to a rival’s noncompete agreements, are encouraged to share information about the use of noncompete agreements. “We are asking the public to help shine a light on unfair and anticompetitive agreements,” said Kelse Moen, Deputy Director of the Bureau of Competition and co-chair of the agency’s Joint Labor Task Force. “Unreasonable noncompete agreements have proliferated for too long in the dark. With the assistance of the employees and workers most burdened by them, the Trump-Vance FTC intends to uproot the worst offenders and restore fairness to the American labor market. We look forward to closely reviewing every response.” The public will have 60 days to submit comments at  Regulations.gov , no later than November 3, 2025. Once submitted, comments will be posted to  Regulations.gov . Individuals wishing to submit confidential, non-public comments should reference the alternative submission guidelines in the RFI.  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Today the Federal Trade Commission launched a public inquiry to better understand the scope, prevalence, and effects of employer nonc",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Nonmerger",
    "Noncompete"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/online-marketplace-temu-pay-2-million-penalty-alleged-inform-act-violations",
  "scraped_at": "2025-11-13T22:19:50.119824",
  "title": "Online Marketplace Temu to Pay $2 Million Penalty for Alleged INFORM Act Violations",
  "published_date": "2025-09-05",
  "full_text": "Whaleco, Inc., which operates the online marketplace Temu, will pay $2 million to resolve allegations that it violated the INFORM Consumers Act of 2023, by failing to provide consumers with required information and tools to help them avoid and report stolen, counterfeit, or unsafe goods while shopping online. “The INFORM Act is designed to ensure consumers have the information and tools they need to not only report suspicious activity to online marketplaces, but to directly identify and contact high-volume, third party sellers in many cases,” said Christopher Mufarrige, Director of the Federal Trade Commission’s Bureau of Consumer Protection. “Temu, one of the most recognizable online marketplaces, is responsible for complying with the Act. Today’s action serves as a reminder to online marketplaces that violating the INFORM Act can result in serious consequences, including civil penalties.” This is the first action to enforce the  INFORM Act , which requires online marketplaces to disclose a reporting mechanism on the product listings of all high-volume third party sellers that consumers can use to report suspicious activity to the online marketplace either electronically or by telephonic means. The Act also requires online marketplaces to disclose identifying information for many high-volume third party sellers—the name of the seller, its physical address, and contact information to allow consumers to reach the seller directly. According to  the complaint , Temu failed to provide any telephonic means for consumers to report suspicious marketplace activity. When it did provide such a mechanism, the complaint alleges, it was difficult for consumers to access. In addition, Temu failed to provide any reporting mechanism for product listings in its gamified shopping experiences, which allow shoppers to play games, spin wheels, earn coupons, and undertake other activities while browsing and purchasing products, until November 2024, according to the complaint. When Temu eventually added a reporting mechanism, it was not clear and conspicuous as required by law, the complaint alleged. Next, the complaint alleges that for part of the time the Act has been in effect, Temu failed to disclose clearly and conspicuously required information about third party sellers as part of its gamified product listings and for its mobile website. The proposed consent  order announced today  addresses each of the INFORM Act violations alleged in the complaint. The proposed order, if approved by the district court, will require Temu to: The proposed order also includes a $2 million civil penalty against Temu, which must be paid within seven days of the district court’s entry of the stipulated order. The Commission vote to authorize the staff to refer the complaint and proposed consent decree to the Department of Justice was 3-0. The DOJ filed the complaint and proposed consent decree upon referral from the Commission in U.S. District Court for the District of Massachusetts, Eastern Division. NOTE:  The Commission authorizes the filing of a complaint when it has “reason to believe” that the named defendants are violating or are about to violate the law and it appears to the Commission that a proceeding is in the public interest. Consent decrees have the force of law when approved and signed by the District Court judge. The staff attorneys on this matter are Tiffany Woo and Carl Settlemyer of the FTC’s Bureau of Consumer Protection. Learn more about the  INFORM Act  and report violations of the INFORM Act through  the FTC’s special portal for potential INFORM Consumer Act violations . The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Whaleco, Inc., which operates the online marketplace Temu, will pay $2 million to resolve allegations that it violated the INFORM Consumers Act of 2023, by failing to provide consumers with require",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Advertising and Marketing",
    "Online Advertising and Marketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/federal-trade-commission-files-accede-vacatur-non-compete-clause-rule",
  "scraped_at": "2025-11-13T22:19:52.438951",
  "title": "Federal Trade Commission Files to Accede to Vacatur of Non-Compete Clause Rule",
  "published_date": "2025-09-05",
  "full_text": "Today the Federal Trade Commission took steps to dismiss its appeals in Ryan, LLC v. FTC, No. 24-10951 (5th Cir.), and Properties of the Villages v. FTC, No. 24-13102 (11th Cir.), and to accede to the vacatur of the Non-Compete Clause Rule.  At the time the Biden FTC issued the Rule, current Chairman Andrew N. Ferguson and Commissioner Melissa Holyoak  dissented  on the grounds that the FTC lacked the statutory authority to issue the Rule. The district court found that the FTC does lack the authority, and prohibited enforcement of the Rule.  The Commission voted 3-1 to dismiss the appeal and accede to the vacatur. Chairman Andrew N. Ferguson  issued a statement  joined by Commissioner Melissa Holyoak. Commissioner Mark R. Meador issued a concurring  statement . Commissioner Rebecca Slaughter issued a  dissenting statement .   The Federal Trade Commission works to  promote competition , and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Follow the  FTC on social media , read our  blogs  and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "Today the Federal Trade Commission took steps to dismiss its appeals in Ryan, LLC v. FTC, No. 24-10951 (5th Cir.), and Properties of the Villages v. FTC, No.",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Nonmerger",
    "Noncompete"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-publishes-request-public-comment-proposed-modification-hisas-enforcement-rule",
  "scraped_at": "2025-11-13T22:19:54.168552",
  "title": "FTC Publishes Request for Public Comment on Proposed Modification to HISA’s Enforcement Rule",
  "published_date": "2025-09-09",
  "full_text": "The Federal Trade Commission has published a  request for public comment  on the Horseracing Integrity and Safety Authority’s proposed modification of its Enforcement Rule. The request was published in the Federal Register on September 9, 2025. Interested parties may file a comment by September 23, 2025, by following the instructions in the notice. The Horseracing Integrity and Safety Act, which recognized the Authority, includes a requirement that the Authority’s rules (and modifications to those rules, such as this one) must be submitted for approval to the FTC. The Act requires that the FTC, after providing an opportunity for public comment, approve submitted rules if it finds that they are “consistent with” the Act and the FTC’s rules.  The Federal Trade Commission works to  promote competition , and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Follow the  FTC on social media , read our  blogs  and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "The Federal Trade Commission has published a request for public comment on the Horseracing Integrity and Safety Authority’s proposed modif",
  "tags": [
    "FTC Operations",
    "Office of the General Counsel",
    "Horseracing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-launches-inquiry-ai-chatbots-acting-companions",
  "scraped_at": "2025-11-13T22:19:55.417329",
  "title": "FTC Launches Inquiry into AI Chatbots Acting as Companions",
  "published_date": "2025-09-11",
  "full_text": "The Federal Trade Commission is issuing orders to seven companies that provide consumer-facing AI-powered chatbots seeking information on how these firms measure, test, and monitor potentially negative impacts of this technology on children and teens. AI chatbots may use generative artificial intelligence technology to simulate human-like communication and interpersonal relationships with users. AI chatbots can effectively mimic human characteristics, emotions, and intentions, and generally are designed to communicate like a friend or confidant, which may prompt some users, especially children and teens, to trust and form relationships with chatbots. The FTC inquiry seeks to understand what steps, if any, companies have taken to evaluate the safety of their chatbots when acting as companions, to limit the products’ use by and potential negative effects on children and teens, and to apprise users and parents of the risks associated with the products. “Protecting kids online is a top priority for the Trump-Vance FTC, and so is fostering innovation in critical sectors of our economy,” said FTC Chairman Andrew N. Ferguson. “As AI technologies evolve, it is important to consider the effects chatbots can have on children, while also ensuring that the United States maintains its role as a global leader in this new and exciting industry. The study we’re launching today will help us better understand how AI firms are developing their products and the steps they are taking to protect children.” The FTC is issuing the  orders  using its 6(b) authority, which authorizes the Commission to conduct wide-ranging studies that do not have a specific law enforcement purpose. The recipients include: The FTC is interested in particular on the impact of these chatbots on children and what actions companies are taking to mitigate potential negative impacts, limit or restrict children’s or teens’ use of these platforms, or comply with the  Children’s Online Privacy Protection Act Rule . As part of its inquiry, the FTC is seeking information about how the companies: The Commission voted 3-0 to issue the 6(b) orders to the seven companies. Commissioners  Melissa Holyoak  and  Mark R. Meador   issued separate statements. The lead staff on this matter are Alysa Bernstein and Erik Jones in the FTC’s Bureau of Consumer Protection. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission is issuing orders to seven companies that provide consumer-facing AI-powered chatbots seeking information on how these firms measure, test, and monitor potentially nega",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Technology",
    "Privacy and Security",
    "Children's Privacy",
    "Tech",
    "Artificial Intelligence"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/federal-trade-commission-chairman-andrew-n-ferguson-appoints-emma-mittelstaedt-burnham-associate",
  "scraped_at": "2025-11-13T22:19:56.504293",
  "title": "Federal Trade Commission Chairman Andrew N. Ferguson Appoints Emma Mittelstaedt Burnham as Associate Director for Healthcare",
  "published_date": "2025-09-09",
  "full_text": "Federal Trade Commission Chairman Andrew N. Ferguson has appointed Emma Mittelstaedt Burnham as Associate Director for Healthcare in the Bureau of Competition. “I am delighted to appoint Emma as Associate Director for Healthcare in the Bureau of Competition. She is a talented attorney with many years of experience at the Department of Justice as a senior antitrust enforcer,” said FTC Chairman Andrew N. Ferguson. “Emma will be an invaluable champion in the FTC’s ongoing fight to protect Americans’ access to affordable, high-quality healthcare.” Emma has significant experience leading the investigation and prosecution of complex antitrust conduct cases, having spent 11 years as a prosecutor at the U.S. Department of Justice Antitrust Division. Most recently, she served as the Director of Criminal Enforcement, supervising the Antitrust Division’s price-fixing matters throughout the United States. She previously held the positions of Trial Attorney, Counsel to the Assistant Attorney General, Assistant Chief, and Acting Chief. Her prior work as a senior DOJ antitrust official included prosecuting antitrust violations in the healthcare sector. She led the Antitrust Division’s investigation into antitrust cartels in the generic pharmaceutical industry, which resulted in significant corporate prosecutions including the largest criminal penalties ever imposed for domestic cartel offenses and the first use of divestiture in a criminal settlement. Before joining the DOJ Antitrust Division, Emma was a criminal defense associate at law firms in Washington, DC, and Los Angeles. She graduated with honors from the University of Chicago Law School and Georgetown University and clerked for the Honorable Robert W. Gettleman in the Northern District of Illinois. The Federal Trade Commission works to  promote competition , and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Follow the  FTC on social media , read our  blogs  and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "Federal Trade Commission Chairman Andrew N. Ferguson has appointed Emma Mittelstaedt Burnham as Associate Director for Healthcare in the Bureau of Competition.",
  "tags": [
    "Competition",
    "FTC Operations",
    "Bureau of Competition"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-chairman-ferguson-issues-noncompete-warning-letters-healthcare-employers-staffing-companies",
  "scraped_at": "2025-11-13T22:19:56.712083",
  "title": "FTC Chairman Ferguson Issues Noncompete Warning Letters to Healthcare Employers and Staffing Companies",
  "published_date": "2025-09-10",
  "full_text": "Today, Federal Trade Commission Chairman Andrew N. Ferguson  sent letters   to several large healthcare employers and staffing firms urging them to conduct a comprehensive review of their employment agreements—including any noncompetes or other restrictive agreements—to ensure they are appropriately tailored and comply with the law. Many healthcare employers and staffing companies may include unreasonable noncompete agreements in employment contracts for vital roles like nurses, physicians, and other medical professionals. These restrictions can unreasonably limit healthcare professionals’ employment options and thereby limit patients’ choices over who provides their medical care—including, critically, in rural areas where medical services are already stretched thin, the letters state. “Enforcement against unreasonable noncompete agreements remains a top priority for the Federal Trade Commission,” said Kelse Moen, Deputy Director of the Bureau of Competition and co-chair of the agency’s Joint Labor Task Force. “We strongly encourage all employers—not just those receiving letters today—to review their contracts closely, to ensure that any restrictions on employee mobility are in full compliance with the law.” The FTC has authority under Section 5 the FTC Act to investigate unfair methods of competition, including noncompete agreements that are unjustified, overbroad, or otherwise unfair or anticompetitive. The letters follow a Commission  vote  last week to withdraw from its defense of the Biden-Harris administration’s nationwide noncompete ban, which the courts had enjoined on constitutional grounds. In his  statement  announcing the Commission’s withdrawal, Chairman Ferguson made clear that the FTC would stay vigilant “enforcing the antitrust laws aggressively against noncompete agreements” including by “patrolling our markets for specific anticompetitive conduct that hurts American consumers and workers, and taking bad actors to court.” The Chairman’s letter today follows several recent FTC actions to protect workers from noncompete agreements, including the  launch of a public inquiry  to gather input to inform possible future enforcement actions. The FTC also  recently ordered  the nation’s largest pet cremation business to stop enforcing noncompete agreements, freeing nearly 1,800 workers from these restrictive agreements.  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Today, Federal Trade Commission Chairman Andrew N.",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Nonmerger",
    "Health Care",
    "Noncompete"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/citizens-disability-pay-1-million-over-ftc-charges-it-made-tens-millions-illegal-misleading-calls",
  "scraped_at": "2025-11-13T22:19:56.777166",
  "title": "Citizens Disability to Pay $1 Million over FTC Charges that it Made Tens of Millions of Illegal and Misleading Calls to Consumers Nationwide",
  "published_date": "2025-09-30",
  "full_text": "Citizens Disability, LLC and its subsidiary will pay a $1 million penalty to resolve Federal Trade Commission allegations that they made tens of millions of illegal calls to consumers, including to numbers on the Do Not Call (DNC) registry, and that they misrepresented that they were calling consumers in response to inquiries about their eligibility for Social Security Disability Insurance (SSDI) benefits. “Consumers often wonder how telemarketers get their phone numbers, even if they’re on the Do Not Call Registry,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection. “In this case, Citizens Disability used websites offering prizes, coupons, and other services to collect consumers’ personal information and then used that information to make tens of millions of illegal sales calls. The FTC will not tolerate such deceptive conduct.” According to  the complaint , filed by the Department of Justice upon notification and referral from the FTC, Massachusetts-based Citizens Disability, which assists consumers in applying for SSDI benefits, and its subsidiary, CD Media, have used illegal robocalls and illegal calls to numbers on the DNC Registry to sell their services to consumers, typically using third-party lead generators and call centers. The complaint alleges that, between January 2019 and July 2022, the companies caused more than 109 million outbound telemarketing calls to be made, including calls to more than 25.7 million numbers listed on the DNC Registry. The FTC alleged their actions violated the Telemarketing Sales Rule and the FTC Act. The complaint alleges the companies contract with lead generators to obtain lists of consumers for their telemarketers to call. The lists are created via websites that deceptively induce consumers into providing their information through attractive sweepstakes, coupons, and service offers, but fail to disclose their personal contact information will be used for certain telemarketing calls. The complaint further alleges that the defendants have called consumers, many of whom are lower-income or disabled, and falsely stated that they are calling in response to their inquiries about SSDI benefits. For example, some of these calls were made via robocalls that identified the caller as “Amber” or “Audrey,” before representing that “it show[s] here that you recently inquired about your eligibility for Social Security Disability benefits.” The proposed  consent order announced today : It also includes a $2 million civil penalty, which will be partially suspended upon payments totaling $1 million within the year after the order is entered. If the defendants are found to have misrepresented their financial condition, the full amount will become automatically due. The Commission vote to authorize the staff to refer the complaint and proposed consent decree to the Department of Justice was 3-0. The DOJ filed the complaint and proposed consent decree upon referral from the Commission in the U.S. District Court for the District of Massachusetts. NOTE:  The Commission authorizes the filing of a complaint when it has “reason to believe” that the named defendants are violating or are about to violate the law and it appears to the Commission that a proceeding is in the public interest. Consent decrees have the force of law when approved and signed by the District Court judge. The staff attorneys on this matter are Karina Layugan, Matthew Fine, and Jeffrey Tang in the FTC’s Western Region Los Angeles. Staff would like to thank the Social Security Administration and the Better Business Bureau in Eastern Massachusetts, Maine, Rhode Island, and Vermont for their assistance with this matter.  The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Citizens Disability, LLC and its subsidiary will pay a $1 million penalty to resolve Federal Trade Commission allegations that they made tens of millions of illegal calls to consumers, including to",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Bureau of Consumer Protection",
    "Western Region Los Angeles",
    "Do Not Call",
    "deceptive/misleading conduct",
    "Advertising and Marketing",
    "Online Advertising and Marketing",
    "Telemarketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-sues-zillow-redfin-over-illegal-agreement-suppress-rental-advertising-competition",
  "scraped_at": "2025-11-13T22:19:58.301525",
  "title": "FTC Sues Zillow and Redfin Over Illegal Agreement to Suppress Rental Advertising Competition",
  "published_date": "2025-09-30",
  "full_text": "Today, the Federal Trade Commission sued Zillow and Redfin over an unlawful agreement that eliminates Redfin as a competitor in the market for placing advertising of rental housing on internet listing services (ILSs)—the websites that millions of Americans use to find their next rental home. Zillow Group, Inc., and Zillow, Inc., (Zillow) and Redfin Corporation operate two of the nation’s largest rental ILS networks by traffic and revenue, including sites such as Zillow Rentals, Rent.com, and ApartmentGuide.com. The  complaint  alleges that in February 2025, Zillow and Redfin entered into an illegal agreement to dismantle Redfin as a competitor in the ILS advertising market for multifamily rental properties. In exchange for a $100 million payment and other compensation from Zillow, the complaint alleges, Redfin agreed: Zillow and Redfin framed their agreement as a “partnership,” but in reality the arrangement is an end run around competition that insulates Zillow from competing head-to-head on the merits with Redfin, the complaint states. In connection with the agreement, Redfin fired hundreds of employees, then helped Zillow to hire its pick of those terminated workers. “Paying off a competitor to stop competing against you is a violation of federal antitrust laws,” said Daniel Guarnera, Director of the FTC’s Bureau of Competition. “Zillow paid millions of dollars to eliminate Redfin as an independent competitor in an already concentrated advertising market—one that’s critical for renters, property managers, and the health of the overall U.S. housing market. The FTC will do our part to ensure that Americans who are looking for safe, affordable rentals receive all the benefits of robust competition between internet listing services like Zillow and Redfin.” The FTC alleges that this agreement destroys competition for multifamily rental properties advertising on ILSs, harming both property managers seeking to advertise properties for rent and renters searching for a home. The agreement also constitutes an unlawful acquisition in violation of Section 7 of the Clayton Act, the complaint alleges. The FTC alleges that the unlawful agreement will: The complaint seeks to stop Zillow and Redfin from continuing their unlawful agreement and contemplates a potential divestiture of assets or the reconstruction of businesses to restore competition. Throughout this investigation, the FTC worked in close collaboration with the offices of several state attorneys general. The Commission looks forward to ongoing cooperation with the states in this matter. The Commission vote to authorize staff to file a complaint in the U.S. District Court for the Eastern District of Virginia was 3-0.  NOTE:  The Commission issues a complaint when it has “reason to believe” that the law has been or is being violated, and it appears to the Commission that a proceeding is in the public interest. The case will be decided by the court. The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Today, the Federal Trade Commission sued Zillow and Redfin over an unlawful agreement that eliminates Redfin as a competitor in the market for placing advertising of rental housing on internet list",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "Real Estate and Mortgages"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/10/ftc-nevada-sue-tax-debt-relief-scammers-falsely-impersonating-government",
  "scraped_at": "2025-11-13T22:20:00.332275",
  "title": "FTC, State of Nevada Sue to Stop Tax Debt Relief Scammers from Falsely Impersonating the Government, Making False Claims and Threats to Consumers",
  "published_date": "2025-10-17",
  "full_text": "At the Federal Trade Commission’s request, a federal court has  temporarily halted  alleged tax debt relief scammers from falsely impersonating government agencies, including the Internal Revenue Service, deceptively promising tax debt relief, sending threats to consumers about their debts and pocketing tens of millions of consumers’ dollars. The FTC filed a  complaint against American Tax Service (ATS)   and its operators, Terrance Selb and Tyler Bennett, as well as seven affiliated entities. The Commission alleges the company’s operators falsely claimed they could settle taxpayers’ back taxes for “pennies on the dollar” or for only a “fraction” of what taxpayers’ owed, often making these claims before evaluating the taxpayer’s circumstances. “People trying to pay down their tax debt shouldn’t have to worry about fraudsters pocketing their hard-earned money,” said Christopher Mufarrige, FTC’s Bureau of Consumer Protection Director. “The FTC will not hesitate to act to stop companies like ATS that target hard-working Americans with bogus debt relief services.” Since at least 2019 ATS, Selb and Bennett have misled consumers by mailing deceptive and threatening letters that impersonate the government to solicit inbound telemarketing calls. ATS’s operators also made false claims about their tax debt relief services and failed to fulfill their promises, such as refusing to provide refunds to dissatisfied consumers who requested one. The complaint alleges that ATS sales representatives misled consumers about the severity of their tax debt issues to scare them into paying for ATS’s tax debt relief services with some consumers saying that ATS operators falsely claimed that the IRS was investigating them or that the IRS “red flagged” their account or marked it as “high risk.” Once consumers agree to pay for ATS’s services, the operators of the scheme did little, if any, of the promised work and rarely, if ever, obtained the promised results. The ATS operators contacted consumers through telemarketing calls or in response to inbound calls resulting from direct mail and online ads. The FTC alleges the defendants engaged in multiple illegal activities, including: The FTC alleges that ATS’s conduct violated the FTC Act, Gramm-Leach-Bliley Act, the Telemarketing Sales Rule and the Impersonation Rule. The State of Nevada alleges that ATS’s conduct also violated Nevada law. The Commission vote approving the filing of the complaint was 3-0. The FTC filed the complaint in the U.S. District Court for the District of Nevada against American Tax Service LLC, American Tax Solutions, American Tax Solutions LLC, ATS Tax Group LLC, Elite Sales Solutions, GetATaxLawyer.com LLC, TNT Holdings Group LLC, TNT Services Group LLC, TNT Tax Associates Inc., and individual defendants Selb and Bennett. The FTC is grateful for the invaluable assistance of the US Postal Inspection Service in this case. The staff attorneys on this matter are Simon Barth and James Evans in the FTC’s Bureau of Consumer Protection. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "At the Federal Trade Commission’s request, a federal court has temporarily halted alleged tax debt relief scammers from falsely impers",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Advertising and Marketing",
    "Telemarketing"
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-denies-petition-reopen-eqt-quantum-energy-order",
  "scraped_at": "2025-11-13T22:20:01.438903",
  "title": "FTC Denies Petition to Reopen EQT, Quantum Energy Order",
  "published_date": "2025-09-30",
  "full_text": "The Federal Trade Commission denied a petition seeking to reopen and set aside a final consent order involving a $5.2 billion cash-and-stock deal between private equity firm Quantum Energy Partners and natural gas producer EQT Corporation. Following a public comment period, the FTC determined that the petition should be denied since Quantum failed to identify any changes that justify reopening and setting aside the final order.  The FTC’s consent order  resolved antitrust concerns  that alleged the deal would have made Quantum one of EQT’s largest shareholders and given Quantum a seat on EQT’s board of directors. Quantum and EQT are direct competitors in the production and sale of natural gas in the Appalachian Basin, the largest natural gas-producing region in the United States. In addition, the FTC alleged that an existing joint venture between EQT and Quantum, which involved in purchasing mineral rights in the Appalachian Basin, raised concerns regarding anticompetitive information exchange and could harm competition in the acquisition of mineral rights. Under the FTC’s  final 2023 consent order , Quantum is prohibited from occupying an EQT board seat to prevent the formation of an interlocking directorate. The final order also required Quantum to divest its EQT shares, prevented anticompetitive information exchange, unwound the joint venture between the two entities, and imposed additional restraints to protect competition. While Quantum has taken steps to comply with the FTC’s consent order, the FTC’s  order denying the petition states  that Quantum still has obligations under the consent order. Quantum has not met its burden of showing that a change of fact requires reopening the order. In addition, the order denying the petition further states that Quantum has failed to establish it would be in the public interest to set aside the order. The Commission vote to deny the petition to reopen the order was 3-0.  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "The Federal Trade Commission denied a petition seeking to reopen and set aside a final consent order involving a $5.2 billion cash-and-stock deal between private equity firm Quantum Energy Partners",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "Energy",
    "Natural Gas"
  ]
}
]