[
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ed-tech-provider-chegg-pay-75-million-settle-ftc-allegations-concerning-unlawful-cancellation",
  "scraped_at": "2025-11-13T21:51:27.722899",
  "title": "Ed Tech Provider Chegg to Pay $7.5 Million to Settle FTC Allegations Concerning Unlawful Cancellation Practices",
  "published_date": "2025-09-15",
  "full_text": "Chegg Inc. will be required to pay $7.5 million to settle Federal Trade Commission allegations that the education technology provider made it extremely difficult for consumers to cancel recurring subscriptions while also failing to honor consumers’ cancellation requests. For years, Chegg failed to provide consumers, namely students and parents, with a simple mechanism to cancel auto-renewing subscriptions for online learning tools such as homework help and writing assistance tools, according to the FTC’s  complaint . Under a  proposed order  settling the FTC’s charges, Chegg will be required to provide a simple cancellation mechanism for consumers in addition to the $7.5 million payment.  “It harms the American people when companies fail to provide simple mechanisms to cancel recurring charges as Congress required in the Restore Online Shoppers’ Confidence Act,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection. “As part of our effort to reinvigorate the agency’s fraud program, the FTC will continue enforcing ROSCA against online sellers where they violate this important statute.” In its complaint, the FTC alleges that Chegg used unlawful cancellation practices that made it difficult, and in some cases nearly impossible, for consumers to cancel their recurring subscriptions. For example, the complaint alleges that: The FTC alleges that Chegg’s deceptive billing and cancellation practices violate the FTC Act and the Restore Online Shoppers’ Confidence Act (ROSCA), which requires online retailers selling through negative option features to clearly and conspicuously disclose the material terms of the transaction, obtain consumers’ express, informed consent before charging them, and provide simple ways to stop recurring charges. The FTC’s latest action against Chegg follows a  2022 FTC settlement with the company.  The 2022 order required Chegg to bolster its security against data breaches and delete unnecessary data in response to allegations that the company’s lax data security practices exposed sensitive information about millions of its customers and employees. Under the FTC’s proposed order, Chegg will pay $7.5 million, which will be used to provide refunds to consumers impacted by Chegg’s deceptive cancellation practices. The proposed order also requires that Chegg maintain simple cancellation mechanisms for negative option features. The Commission vote authorizing the staff to file the complaint and proposed order was 3-0. The complaint and proposed order were filed in the U.S. District Court for the Northern District of California. NOTE:  The Commission authorizes the filing of a complaint when it has “reason to believe” that the named defendant is violating or is about to violate the law and it appears to the Commission that a proceeding is in the public interest. Stipulated final orders have the force of law when approved and signed by the District Court judge. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Chegg Inc.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Education",
    "Technology",
    "Advertising and Marketing",
    "Online Advertising and Marketing",
    "Payments and Billing"
  ],
  "image_urls": [
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook logo_icon.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook%20logo_icon.png",
      "path": "full/4ed1cb08285350c9cd67ff2316917f25c44b843b.jpg",
      "checksum": "b8e71333dd90a3e1210819f640efc9ad",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
      "path": "full/ed12d98ebef66db254a7232d26fd78e413c70a26.jpg",
      "checksum": "b829e329ed8d9d9d916fa50e8714a1c8",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
      "path": "full/fad4b5e19826ac6b82d91f4119647442e6ce1360.jpg",
      "checksum": "3cb42b886e2dcf28f7af70223832f590",
      "status": "uptodate"
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/three-directors-resign-sevita-board-directors-response-ftcs-ongoing-enforcement-efforts-against",
  "scraped_at": "2025-11-13T21:51:29.318387",
  "title": "Three Directors Resign from Sevita Board of Directors in Response to the FTC’s Ongoing Enforcement Efforts Against Interlocking Directorates",
  "published_date": "2025-09-15",
  "full_text": "The Federal Trade Commission announced today that three individuals have resigned from their positions on the Board of Directors of Sevita Health (Sevita) in response to the Federal Trade Commission’s enforcement of the Clayton Act, which generally prohibits directors and officers from serving simultaneously on the boards of competitors. “We are committed to enforcing the Clayton Act’s prohibition on interlocking directorates, which risk suppressing competition,” said Daniel Guarnera, Director of the FTC’s Bureau of Competition. “We are pleased that the firms involved in this case worked with the FTC to resolve this issue quickly. We encourage all firms to review their board memberships to avoid any overlaps with competitors—including when new board members are added as a result of investments by private equity firms or other new shareholders.” Sevita and Beacon Specialized Living Services, Inc. (Beacon) both provide services, including residential facilities, to individuals with intellectual and developmental disabilities. Despite this, they had common representation on each firm’s board of directors. The resignations made in response to the FTC’s enforcement efforts have now resolved the competition concerns raised by the three individuals serving as directors for both Sevita and Beacon simultaneously. The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "The Federal Trade Commission announced today that three individuals have resigned from their positions on the Board of Directors of Sevita Health (Sevita) in response to the Federal Trade Commissio",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Health Care"
  ],
  "image_urls": [
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook logo_icon.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook%20logo_icon.png",
      "path": "full/4ed1cb08285350c9cd67ff2316917f25c44b843b.jpg",
      "checksum": "b8e71333dd90a3e1210819f640efc9ad",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
      "path": "full/ed12d98ebef66db254a7232d26fd78e413c70a26.jpg",
      "checksum": "b829e329ed8d9d9d916fa50e8714a1c8",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
      "path": "full/fad4b5e19826ac6b82d91f4119647442e6ce1360.jpg",
      "checksum": "3cb42b886e2dcf28f7af70223832f590",
      "status": "uptodate"
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/10/ftc-nevada-sue-tax-debt-relief-scammers-falsely-impersonating-government",
  "scraped_at": "2025-11-13T21:51:29.478481",
  "title": "FTC, State of Nevada Sue to Stop Tax Debt Relief Scammers from Falsely Impersonating the Government, Making False Claims and Threats to Consumers",
  "published_date": "2025-10-17",
  "full_text": "At the Federal Trade Commission’s request, a federal court has  temporarily halted  alleged tax debt relief scammers from falsely impersonating government agencies, including the Internal Revenue Service, deceptively promising tax debt relief, sending threats to consumers about their debts and pocketing tens of millions of consumers’ dollars. The FTC filed a  complaint against American Tax Service (ATS)   and its operators, Terrance Selb and Tyler Bennett, as well as seven affiliated entities. The Commission alleges the company’s operators falsely claimed they could settle taxpayers’ back taxes for “pennies on the dollar” or for only a “fraction” of what taxpayers’ owed, often making these claims before evaluating the taxpayer’s circumstances. “People trying to pay down their tax debt shouldn’t have to worry about fraudsters pocketing their hard-earned money,” said Christopher Mufarrige, FTC’s Bureau of Consumer Protection Director. “The FTC will not hesitate to act to stop companies like ATS that target hard-working Americans with bogus debt relief services.” Since at least 2019 ATS, Selb and Bennett have misled consumers by mailing deceptive and threatening letters that impersonate the government to solicit inbound telemarketing calls. ATS’s operators also made false claims about their tax debt relief services and failed to fulfill their promises, such as refusing to provide refunds to dissatisfied consumers who requested one. The complaint alleges that ATS sales representatives misled consumers about the severity of their tax debt issues to scare them into paying for ATS’s tax debt relief services with some consumers saying that ATS operators falsely claimed that the IRS was investigating them or that the IRS “red flagged” their account or marked it as “high risk.” Once consumers agree to pay for ATS’s services, the operators of the scheme did little, if any, of the promised work and rarely, if ever, obtained the promised results. The ATS operators contacted consumers through telemarketing calls or in response to inbound calls resulting from direct mail and online ads. The FTC alleges the defendants engaged in multiple illegal activities, including: The FTC alleges that ATS’s conduct violated the FTC Act, Gramm-Leach-Bliley Act, the Telemarketing Sales Rule and the Impersonation Rule. The State of Nevada alleges that ATS’s conduct also violated Nevada law. The Commission vote approving the filing of the complaint was 3-0. The FTC filed the complaint in the U.S. District Court for the District of Nevada against American Tax Service LLC, American Tax Solutions, American Tax Solutions LLC, ATS Tax Group LLC, Elite Sales Solutions, GetATaxLawyer.com LLC, TNT Holdings Group LLC, TNT Services Group LLC, TNT Tax Associates Inc., and individual defendants Selb and Bennett. The FTC is grateful for the invaluable assistance of the US Postal Inspection Service in this case. The staff attorneys on this matter are Simon Barth and James Evans in the FTC’s Bureau of Consumer Protection. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "At the Federal Trade Commission’s request, a federal court has temporarily halted alleged tax debt relief scammers from falsely impers",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Imposter",
    "Advertising and Marketing",
    "Telemarketing"
  ],
  "image_urls": [
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook logo_icon.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook%20logo_icon.png",
      "path": "full/4ed1cb08285350c9cd67ff2316917f25c44b843b.jpg",
      "checksum": "b8e71333dd90a3e1210819f640efc9ad",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
      "path": "full/ed12d98ebef66db254a7232d26fd78e413c70a26.jpg",
      "checksum": "b829e329ed8d9d9d916fa50e8714a1c8",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
      "path": "full/fad4b5e19826ac6b82d91f4119647442e6ce1360.jpg",
      "checksum": "3cb42b886e2dcf28f7af70223832f590",
      "status": "uptodate"
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-announces-workshop-noncompete-agreements",
  "scraped_at": "2025-11-13T21:51:30.659677",
  "title": "FTC Announces Workshop on Noncompete Agreements",
  "published_date": "2025-09-17",
  "full_text": "Today the Federal Trade Commission announced it will host a workshop, titled “ Moving Forward: Protecting Workers from Anticompetitive Noncompete Agreements .” The event will be held on October 8, 2025 from 2:00pm to 6:00pm, at the FTC’s Constitution Center. The event is open to the public, in-person or via livestream. A noncompete agreement is a contractual term between an employer and a worker that typically blocks the worker from taking a job with a competing employer or starting a competing business after the end of the worker’s employment. In practice, noncompete agreements are often subject to abuse. The workshop is part of the Trump-Vance FTC’s efforts to highlight the negative impact of noncompete agreements on American workers and put business on notice of its enforcement priorities. The workshop will be hosted by the FTC’s Labor Task Force, which was created by Chairman Andrew N. Ferguson to prioritize rooting out and prosecuting deceptive, unfair, and anticompetitive labor-market practices that harm American workers. It follows a  recent FTC enforcement action  eliminating restrictive and anticompetitive noncompete agreements;  a series of letters  sent to healthcare companies warning them to review and eliminate any anticompetitive noncompete agreements they may have; and a broad  request for information  seeking tips to lead to further enforcement actions. The workshop will include public statements from FTC Commissioners, victims of unfair and anticompetitive noncompete agreements, and leading experts in the field. A full agenda and list of speakers will be available prior to the event. A livestream link will be posted to FTC.gov on the morning of the event.  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Today the Federal Trade Commission announced it will host a workshop, titled “",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Nonmerger",
    "Noncompete"
  ],
  "image_urls": [
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook logo_icon.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook%20logo_icon.png",
      "path": "full/4ed1cb08285350c9cd67ff2316917f25c44b843b.jpg",
      "checksum": "b8e71333dd90a3e1210819f640efc9ad",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
      "path": "full/ed12d98ebef66db254a7232d26fd78e413c70a26.jpg",
      "checksum": "b829e329ed8d9d9d916fa50e8714a1c8",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
      "path": "full/fad4b5e19826ac6b82d91f4119647442e6ce1360.jpg",
      "checksum": "3cb42b886e2dcf28f7af70223832f590",
      "status": "uptodate"
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-sends-money-consumers-harmed-deceptive-business-opportunity-scheme-known-blueprint-wealth",
  "scraped_at": "2025-11-13T21:51:31.788735",
  "title": "FTC Sends Money to Consumers Harmed by Deceptive Business Opportunity Scheme Known as “Blueprint to Wealth”",
  "published_date": "2025-09-17",
  "full_text": "The Federal Trade Commission is sending a total of $666,631 to consumers defrauded by a sprawling business opportunity scheme that operated under the name “Blueprint to Wealth.” In December 2023,  the FTC announced a court order  temporarily halting the operations of the defendants, which the agency alleged ran a business opportunity scheme that took in millions of dollars from consumers with false promises of huge returns by building their own businesses. In its complaint, the FTC alleged the scheme had been operating since 2018 under several names, including “Blueprint to Wealth.” In September 2024, the Commission announced the  last of three settlements  against the defendants which barred them from the illegal conduct described in the complaint. The orders resolving the complaint also required the defendants to pay hundreds of thousands of dollars to provide money to harmed consumers. The FTC is sending payments to 4,208 affected consumers. Check recipients should cash their checks within 90 days, as indicated on the check. PayPal recipients should redeem their PayPal payments within 30 days. Consumers who have questions about their payment should contact the refund administrator, JND Legal Administration, at 1-855-779-3542, or visit the FTC website to  view frequently asked questions  about the refund process. The Commission never requires people to pay money or provide account information to get a refund. The Commission’s  interactive dashboards for refund data  provide a state-by-state breakdown of refunds in FTC cases. In 2024, FTC actions led to more than $339 million in refunds to consumers across the country. The Federal Trade Commission works to promote competition and to  protect and educate consumers .  The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize.  You can  learn more about consumer topics  and report scams, fraud, and bad business practices online at  ReportFraud.ftc.gov . Like the FTC on  Facebook , follow us on  Twitter , get  consumer alerts , read our  blogs , and  subscribe to press releases  for the latest FTC news and resources.",
  "summary": "The Federal Trade Commission is sending a total of $666,631 to consumers defrauded by a sprawling business opportunity scheme that operated under the name “Blueprint to Wealth.”",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Franchises, Business Opportunities, and Investments"
  ],
  "image_urls": [
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook logo_icon.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
    "https://www.ftc.gov/sites/default/files/styles/scaled_sm/public/ftc_gov/images/badge-explore-data-ftc-refunds-resized.jpg?itok=Yc2wmn7d"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook%20logo_icon.png",
      "path": "full/4ed1cb08285350c9cd67ff2316917f25c44b843b.jpg",
      "checksum": "b8e71333dd90a3e1210819f640efc9ad",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
      "path": "full/ed12d98ebef66db254a7232d26fd78e413c70a26.jpg",
      "checksum": "b829e329ed8d9d9d916fa50e8714a1c8",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
      "path": "full/fad4b5e19826ac6b82d91f4119647442e6ce1360.jpg",
      "checksum": "3cb42b886e2dcf28f7af70223832f590",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/sites/default/files/styles/scaled_sm/public/ftc_gov/images/badge-explore-data-ftc-refunds-resized.jpg?itok=Yc2wmn7d",
      "path": "full/6430c96a99d2fe8dee32f2f8f6b342c2f5fec814.jpg",
      "checksum": "b57b12222becd62e66cd54f079d183a5",
      "status": "uptodate"
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-doj-issue-fiscal-year-2024-hart-scott-rodino-annual-report",
  "scraped_at": "2025-11-13T21:51:33.080697",
  "title": "FTC and DOJ Issue Fiscal Year 2024 Hart-Scott-Rodino Annual Report",
  "published_date": "2025-09-17",
  "full_text": "The Federal Trade Commission and the Department of Justice’s (DOJ) Antitrust Division released their  47 th  Annual Hart-Scott-Rodino (HSR) Report . This report summaries the agencies’ merger enforcement efforts and provides fiscal year 2024 data on the Premerger Notification Program, which alerts the agencies to transactions that may substantially lessen competition in violation of federal law. The report explains that in fiscal year 2024, companies notified the agencies of 2,031 transactions under the HSR Act, approximately one-fourth of which were valued at more than $1 billion. The FTC and DOJ took 32 merger enforcement actions to maintain competition in critically important sectors across the American economy, including healthcare, groceries, technology, labor, and manufacturing. The Commission brought 18 of these actions, six of which resulted in administrative or federal court litigation while in the remaining cases the parties abandoned or restructured their proposed deal as a result of antitrust concerns raised. The statistical tables in the report profile HSR filings and investigations during fiscal year 2024. Appendices provide a summary of transactions for the past 10 years, as well as the number of transactions reported and the number of transactions by industry group. The Commission vote to issue the report was 3-0.  The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "The Federal Trade Commission and the Department of Justice’s (DOJ) Antitrust Division released their",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "Hart-Scott-Rodino Act (HSR)"
  ],
  "image_urls": [
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook logo_icon.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook%20logo_icon.png",
      "path": "full/4ed1cb08285350c9cd67ff2316917f25c44b843b.jpg",
      "checksum": "b8e71333dd90a3e1210819f640efc9ad",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
      "path": "full/ed12d98ebef66db254a7232d26fd78e413c70a26.jpg",
      "checksum": "b829e329ed8d9d9d916fa50e8714a1c8",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
      "path": "full/fad4b5e19826ac6b82d91f4119647442e6ce1360.jpg",
      "checksum": "3cb42b886e2dcf28f7af70223832f590",
      "status": "uptodate"
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-recommends-anticompetitive-regulations-deletion-or-revision",
  "scraped_at": "2025-11-13T21:51:34.298848",
  "title": "FTC Recommends Anticompetitive Regulations for Deletion or Revision",
  "published_date": "2025-09-17",
  "full_text": "On Tuesday, Federal Trade Commission Chairman Andrew N. Ferguson  submitted recommendations  for deleting or revising anticompetitive regulations across the entire federal government to the White House’s Office of Management and Budget. This report is a response to President Trump’s Executive Order  on Reducing Anticompetitive Regulatory Barriers . The Executive Order tasked the FTC with finding unnecessary regulations that exclude new market entrants, protect dominant incumbents, and predetermine economic winners and losers, as a first step to repealing them. “President Trump’s Executive Order recognizes that heavy-handed regulations can hurt competition, including by entrenching incumbent firms, raising costs for new entrants, and discouraging innovative new ways to serve customers,” said FTC Bureau of Competition Director Daniel Guarnera. “Competitive markets lower the cost of living, improve the quality of products and services, and drive innovation. Our engagement with citizens across the country and agencies across the federal government has underscored the importance of scrutinizing regulations to ensure that they don’t distort healthy, free-market competition.” Examples of anticompetitive regulations that the Chairman recommends for deletion or modification include: The report is now under review at the Office of Management and Budget. The FTC will continue to work collaboratively with OMB and all of the relevant federal agencies to rescind or revise their regulations as appropriate. The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "On Tuesday, Federal Trade Commission Chairman Andrew N.",
  "tags": [
    "Competition",
    "Commissioners"
  ],
  "image_urls": [
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook logo_icon.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook%20logo_icon.png",
      "path": "full/4ed1cb08285350c9cd67ff2316917f25c44b843b.jpg",
      "checksum": "b8e71333dd90a3e1210819f640efc9ad",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
      "path": "full/ed12d98ebef66db254a7232d26fd78e413c70a26.jpg",
      "checksum": "b829e329ed8d9d9d916fa50e8714a1c8",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
      "path": "full/fad4b5e19826ac6b82d91f4119647442e6ce1360.jpg",
      "checksum": "3cb42b886e2dcf28f7af70223832f590",
      "status": "uptodate"
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/operators-student-loan-forgiveness-scam-will-be-permanently-banned-debt-relief-industry-ordered-turn",
  "scraped_at": "2025-11-13T21:51:37.607533",
  "title": "Operators of Student Loan Forgiveness Scam Will Be Permanently Banned from Debt Relief Industry, Ordered to Turn Over Assets",
  "published_date": "2025-09-11",
  "full_text": "Eric Caldwell and David Hernandez will be permanently banned from the debt relief industry and required to turn over their assets to resolve Federal Trade Commission charges that they helped operate an illegal student loan debt-relief operation. Additionally, Caldwell will be banned from the telemarketing industry, and Hernandez will be prohibited from violating the Telemarketing Sales Rule. In its early 2025 amended  complaint, the FTC alleged that Nevada-based Superior Servicing , along with several other companies, and their operators, Caldwell, Hernandez, and Dennise Merdjanian, pretended to be affiliated with the Department of Education or its loan servicers to convince student loan borrowers about the legitimacy of their student loan debt-relief program. They required borrowers pay upfront fees that they claimed would be applied to consumers’ student loan balances, when, in reality, they were pocketing consumers’ hard-earned money. Individual defendants  Caldwell   and  Hernandez   have agreed to settle the FTC’s charges in proposed orders banning them from engaging in the debt relief industry.  Additionally, Caldwell’s proposed order bans him from engaging in telemarketing, and Hernandez’s proposed order prohibits him from violating the Telemarketing Sales Rule.  Furthermore, the proposed orders prohibit both of them from: The proposed orders impose a monetary judgment of more than $45.9 million that will be partially suspended, due to the defendants’ inability to pay, after they pay more than $1.6 million and turn over approximately $560,000 in personal and business assets. If either defendant is found to have materially misrepresented their finances, the full amount of the monetary judgment would become immediately due. Litigation continues against Merdjanian and the corporate defendants. The FTC has resources on how to avoid student loan debt relief scams at  ftc.gov/StudentLoans . Consumers can get assistance with their student loans for free at  StudentAid.gov . The Commission vote approving the stipulated final orders was 3-0.   The FTC filed the proposed orders in the U.S. District Court for the District of Nevada. Stipulated final orders have the force of law when approved and signed by the District Court Judge. The lead staff attorneys on this matter were Luis Gallegos and Reid Tepfer of the FTC’s Bureau of Consumer Protection assisted by FTC Investigator Kelle Slaughter. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "Eric Caldwell and David Hernandez will be permanently banned from the debt relief industry and required to turn over their assets to resolve Federal Trade Commission charges that they helped operat",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Southwest Region",
    "Bureau of Consumer Protection",
    "Debt Relief",
    "Education",
    "Imposter",
    "deceptive/misleading conduct",
    "Advertising and Marketing",
    "Credit and Finance"
  ],
  "image_urls": [
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook logo_icon.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook%20logo_icon.png",
      "path": "full/4ed1cb08285350c9cd67ff2316917f25c44b843b.jpg",
      "checksum": "b8e71333dd90a3e1210819f640efc9ad",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
      "path": "full/ed12d98ebef66db254a7232d26fd78e413c70a26.jpg",
      "checksum": "b829e329ed8d9d9d916fa50e8714a1c8",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
      "path": "full/fad4b5e19826ac6b82d91f4119647442e6ce1360.jpg",
      "checksum": "3cb42b886e2dcf28f7af70223832f590",
      "status": "uptodate"
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-sues-live-nation-ticketmaster-engaging-illegal-ticket-resale-tactics-deceiving-artists-consumers",
  "scraped_at": "2025-11-13T21:51:37.859912",
  "title": "FTC Sues Live Nation and Ticketmaster for Engaging in Illegal Ticket Resale Tactics and Deceiving Artists and Consumers about Price and Ticket Limits",
  "published_date": "2025-09-18",
  "full_text": "The Federal Trade Commission and seven states sued Live Nation and Ticketmaster for tacitly coordinating with brokers and allowing them to harvest millions of dollars worth of tickets in the primary market. Live Nation and Ticketmaster then sell the illegally harvested tickets at a substantial markup in the secondary market, causing consumers to pay significantly more than the face value of the ticket.  The FTC further alleged in  a complaint   that California-based Ticketmaster LLC and its parent company Live Nation Entertainment, Inc., (collectively “Ticketmaster”) deceived artists and consumers by engaging in bait-and-switch pricing through advertising lower prices for tickets than what consumers must pay to purchase tickets; deceptively claimed to impose strict limits on the number of tickets that consumers could purchase for an event, even though ticket brokers routinely and substantially exceeded those limits; and sold millions of tickets, often at much higher cost to consumers, on its resale platform that those brokers obtained in excess of artists’ ticket limits. “President Donald Trump made it clear in his March Executive Order that the federal government must protect Americans from being ripped off when they buy tickets to live events,” said FTC Chairman Andrew N. Ferguson. “American live entertainment is the best in the world and should be accessible to all of us. It should not cost an arm and a leg to take the family to a baseball game or attend your favorite musician’s show. The Trump-Vance FTC is working hard to ensure that fans have a shot at buying fair-priced tickets, and today’s lawsuit is a monumental step in that direction.” Ticketmaster is the leading provider of tickets for concerts—controlling about 80% or more of major concert venues’ primary ticketing—and it also has a growing share of ticket resales in the secondary market. From 2019 to 2024 alone, consumers spent more than $82.6 billion purchasing tickets from Ticketmaster. The FTC alleges that in public, Ticketmaster maintains that its business model is at odds with brokers that routinely exceed ticket limits. But in private, Ticketmaster acknowledged that its business model and bottom line benefit from brokers preventing ordinary Americans from purchasing tickets to the shows they want to see at the prices artists set. The FTC’s complaint against Ticketmaster alleges that: The FTC alleges that these practices violate the FTC Act’s prohibition on deceptive acts or practices in the marketplace and the  Better Online Ticket Sales Act . The FTC is seeking civil penalties against Ticketmaster and any additional monetary relief that that the court finds appropriate. The Commission vote authorizing the staff to file the complaint was 2-0-1, with Commissioner Melissa Holyoak recused due to her previous work as Utah’s Solicitor General. The complaint was filed in the U.S. District Court for the Central District of California. NOTE:  The Commission files a complaint when it has “reason to believe” that the named defendants are violating or are about to violate the law and it appears to the Commission that a proceeding is in the public interest. The case will be decided by the court. The lead staffers on this matter are Elizabeth C. Scott, Taylor H. Arana, and Claire E.W. Stewart from the FTC’s Midwest Regional Office. The Attorneys General of Virginia, Utah, Florida, Tennessee, Nebraska, Illinois and Colorado joined the FTC in bringing this action. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission and seven states sued Live Nation and Ticketmaster for tacitly coordinating with brokers and allowing them to harvest millions of dollars worth of tickets in the primar",
  "tags": [
    "Consumer Protection",
    "Regional Offices",
    "Midwest Region",
    "Bureau of Consumer Protection",
    "deceptive/misleading conduct",
    "Entertainment",
    "Advertising and Marketing"
  ],
  "image_urls": [
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook logo_icon.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook%20logo_icon.png",
      "path": "full/4ed1cb08285350c9cd67ff2316917f25c44b843b.jpg",
      "checksum": "b8e71333dd90a3e1210819f640efc9ad",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
      "path": "full/ed12d98ebef66db254a7232d26fd78e413c70a26.jpg",
      "checksum": "b829e329ed8d9d9d916fa50e8714a1c8",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
      "path": "full/fad4b5e19826ac6b82d91f4119647442e6ce1360.jpg",
      "checksum": "3cb42b886e2dcf28f7af70223832f590",
      "status": "uptodate"
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-19-states-act-stop-deceptive-cancer-charity-fundraising-scheme",
  "scraped_at": "2025-11-13T21:51:38.997893",
  "title": "FTC and 19 States Act to Stop a Deceptive Cancer Charity Fundraising Scheme",
  "published_date": "2025-09-25",
  "full_text": "The Federal Trade Commission, along with 22 agencies from 19 states, stopped a deceptive charity fundraising scheme and its operators who made false or deceptive claims to U.S. donors. Kars-R-Us.com, Inc. (Kars) and its operators, Michael Irwin and Lisa Frank, solicited charitable donations nationwide on behalf of United Breast Cancer Foundation, Inc. (UBCF), a charity that claims to assist individuals affected by breast cancer, according to a  complaint  filed by the FTC and states. Kars claimed that vehicle donations would allow UBCF to “save lives” by providing free and low-cost breast cancer screenings. But, in reality, only $126,815 or 0.28% of the more than $45 million that Kars raised was used to provide breast cancer screenings, the complaint alleges. Under a  proposed settlement order  reached with the FTC and its state partners, Kars and its operators face restrictions on future fundraising activities and Irwin, Kars’s President and co-owner until 2022, will be permanently banned from fundraising. “This case should send a strong message to fundraisers that the FTC will take action if they misrepresent the truth and exploit the kindness of generous donors for their own gain,” said Christopher Mufarrige, Director of the FTC’s Bureau of Consumer Protection. “We are grateful to our state partners for joining this effort to protect the public from fundraising schemes like this one.” Kars solicited vehicle donations through national and local TV, radio and online ads in English and Spanish, claiming the donations would allow UBCF to “save lives” by providing free and low-cost breast cancer screenings. Kars tugged at donors’ heartstrings to maximize contributions with little regard for truthfulness or accuracy of the claims it made on behalf of UBCF, the complaint alleges. More than 84,000 well-intentioned people donated their vehicles to Kars.   Between 2017 to 2022 Kars raised more than $45.5 million on behalf of UBCF. The complaint alleges that $34.9 million of those raised funds went to pay Kars, its operators, and its vendors. Of the fraction of funds left to UBCF, most were largely used for other purposes, including generous compensation to UBCF’s CEO. Kars, Irwin, and Frank knew or should have known that the breast cancer-related claims they drafted and made on behalf of UBCF were deceptive or lacked substantiation, the complaint alleges. The proposed settlement order imposes restrictions on Kars, Irwin, and Frank, including: Irwin, Frank, and Kars also face a total monetary judgment of $3,882,091, which is partially suspended based on their inability to pay the full amount. If Kars, Frank, and Irwin are found to have lied to the FTC and state partners about their financial status, the full judgment will be immediately payable. The state agencies joining the FTC in this case include the attorneys general of Arkansas, California, Colorado, Connecticut, Delaware, Florida, Georgia, Illinois, Indiana, Maryland, New York, North Carolina, Oklahoma, Oregon, Utah, Virginia, West Virginia, and Wisconsin as well as the secretaries of state of Maryland, North Carolina, and South Carolina; and the Utah Division of Consumer Protection. The Commission vote authorizing the staff to file the complaint and stipulated final orders was 3-0. The FTC filed the complaint and final orders in the U.S. District Court for the Central District of California. Consumers looking for  more information about how to donate safely  and avoid charity scams can find it on the FTC’s website.  The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission, along with 22 agencies from 19 states, stopped a deceptive charity fundraising scheme and its operators who made false or deceptive claims to U.S. donors.",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "Cars",
    "Charity",
    "Advertising and Marketing"
  ],
  "image_urls": [
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook logo_icon.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook%20logo_icon.png",
      "path": "full/4ed1cb08285350c9cd67ff2316917f25c44b843b.jpg",
      "checksum": "b8e71333dd90a3e1210819f640efc9ad",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
      "path": "full/ed12d98ebef66db254a7232d26fd78e413c70a26.jpg",
      "checksum": "b829e329ed8d9d9d916fa50e8714a1c8",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
      "path": "full/fad4b5e19826ac6b82d91f4119647442e6ce1360.jpg",
      "checksum": "3cb42b886e2dcf28f7af70223832f590",
      "status": "uptodate"
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-secures-historic-25-billion-settlement-against-amazon",
  "scraped_at": "2025-11-13T21:51:39.929176",
  "title": "FTC Secures Historic $2.5 Billion Settlement Against Amazon",
  "published_date": "2025-09-25",
  "full_text": "The Federal Trade Commission has secured a historic order with Amazon.com, Inc., as well as Senior Vice President Neil Lindsay and Vice President Jamil Ghani, settling allegations that Amazon enrolled millions of consumers in Prime subscriptions without their consent, and knowingly made it difficult for consumers to cancel. Amazon will be required to pay a $1 billion civil penalty, provide $1.5 billion in refunds back to consumers harmed by their deceptive Prime enrollment practices, and cease unlawful enrollment and cancellation practices for Prime. “Today, the Trump-Vance FTC made history and secured a record-breaking, monumental win for the millions of Americans who are tired of deceptive subscriptions that feel impossible to cancel,” said FTC Chairman Andrew N. Ferguson. “The evidence showed that Amazon used sophisticated subscription traps designed to manipulate consumers into enrolling in Prime, and then made it exceedingly hard for consumers to end their subscription. Today, we are putting billions of dollars back into Americans’ pockets, and making sure Amazon never does this again. The Trump-Vance FTC is committed to fighting back when companies try to cheat ordinary Americans out of their hard-earned pay.” The FTC has  charged Amazon  and several Amazon executives with knowingly misleading millions of consumers into enrolling in Prime, violating the FTC Act and the Restore Online Shoppers’ Confidence Act (ROSCA). The FTC alleged Amazon created confusing and deceptive user interfaces to lead consumers to enroll in Prime without their knowledge. Compounding these deceptive enrollment practices, Amazon also created a complex and difficult process for consumers seeking to cancel their Prime subscription, with the goal of preventing consumers from cancelling Prime. Amazon documents discovered in the lead up to trial showed that Amazon executives and employees knowingly discussed these unlawful enrollment and cancellation issues, with comments like “subscription driving is a bit of a shady world” and leading consumers to unwanted subscriptions is “an unspoken cancer.”  The historic monetary judgment contained in the settlement is only the third ROSCA case in which the FTC has obtained a civil penalty. It includes: Additionally,  the settlement  requires Amazon to stop their unlawful practices and make meaningful changes to the Prime enrollment and cancellation flows by: The Commission vote approving the stipulated final order was 3-0. The FTC filed the proposed order   in the U.S. District Court for the Western District of Washington. NOTE:  Stipulated final orders have the force of law when approved and signed by the District Court judge. The FTC attorneys on this matter include Jonathan Cohen, Evan Mendelson, Olivia Jerjian, Jonathan W. Ware, Sana Chaudhry, Anthony Saunders, Eli Freedman, Colin D. A. MacDonald, Rachel F. Sifuentes, and Jeffrey Tang. The Federal Trade Commission works to promote competition and  protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at  consumer.ftc.gov , or report fraud, scams, and bad business practices at  ReportFraud.ftc.gov . Follow the  FTC on social media , read  consumer alerts  and the  business blog , and  sign up to get the latest FTC news and alerts .",
  "summary": "The Federal Trade Commission has secured a historic order with Amazon.com, Inc., as well as Senior Vice President Neil Lindsay and Vice President Jamil Ghani, settling allegations that Amazon enrol",
  "tags": [
    "Consumer Protection",
    "Bureau of Consumer Protection",
    "deceptive/misleading conduct",
    "Technology",
    "Advertising and Marketing",
    "Online Advertising and Marketing",
    "Advertising and Marketing Basics"
  ],
  "image_urls": [
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook logo_icon.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook%20logo_icon.png",
      "path": "full/4ed1cb08285350c9cd67ff2316917f25c44b843b.jpg",
      "checksum": "b8e71333dd90a3e1210819f640efc9ad",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
      "path": "full/ed12d98ebef66db254a7232d26fd78e413c70a26.jpg",
      "checksum": "b829e329ed8d9d9d916fa50e8714a1c8",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
      "path": "full/fad4b5e19826ac6b82d91f4119647442e6ce1360.jpg",
      "checksum": "3cb42b886e2dcf28f7af70223832f590",
      "status": "uptodate"
    }
  ]
},
{
  "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/ftc-alters-final-consent-order-response-public-comments-preventing-coordination-global-advertising",
  "scraped_at": "2025-11-13T21:51:41.283797",
  "title": "FTC Alters Final Consent Order in Response to Public Comments, Preventing Coordination in Global Advertising Merger",
  "published_date": "2025-09-26",
  "full_text": "Following a public comment period, the Federal Trade Commission has approved a  final order  to settle Federal Trade Commission charges that Omnicom Group Inc.’s $13.5 billion acquisition of The Interpublic Group of Companies, Inc. (IPG) would violate the antitrust laws. The order eliminates Omnicom’s ability to deny advertising dollars to media publishers based on their political or ideological viewpoint, except at the express and individualized direction of Omnicom’s advertiser customers. As announced in  June 2025 , the  complaint  alleged that advertising agencies have coordinated—including through industry associations—on decisions not to advertise on certain websites and applications. Coordination among advertising firms may reduce ad revenues for particular media publishers, forcing those publishers to reduce the amount of content they can offer to their own consumers and their investment in their sites. In response to comments received during the designated public comment period, the Commission modified the proposed order.  The final order further clarifies the order’s scope and imposes a compliance monitor. The commission vote approving the final order was 2-0-1, with Commissioner Mark R. Meador recused.   The Federal Trade Commission works to  promote competition , and to protect and educate consumers. The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about  how competition benefits consumers ,  file an antitrust complaint , or  comment on a proposed merger . For the latest news and resources,  follow the FTC on social media ,  subscribe to press releases , and  read our blog .",
  "summary": "Following a public comment period, the Federal Trade Commission has approved a final order to settle Federal Trade Commission char",
  "tags": [
    "Competition",
    "Bureau of Competition",
    "Merger",
    "coordinated interaction"
  ],
  "image_urls": [
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook logo_icon.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
    "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png"
  ],
  "images": [
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/5296499_fb_facebook_facebook%20logo_icon.png",
      "path": "full/4ed1cb08285350c9cd67ff2316917f25c44b843b.jpg",
      "checksum": "b8e71333dd90a3e1210819f640efc9ad",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/x-twitter-black-logo.png",
      "path": "full/ed12d98ebef66db254a7232d26fd78e413c70a26.jpg",
      "checksum": "b829e329ed8d9d9d916fa50e8714a1c8",
      "status": "uptodate"
    },
    {
      "url": "https://www.ftc.gov/themes/custom/ftc_uswds/img/social-icons/317750_linkedin_icon.png",
      "path": "full/fad4b5e19826ac6b82d91f4119647442e6ce1360.jpg",
      "checksum": "3cb42b886e2dcf28f7af70223832f590",
      "status": "uptodate"
    }
  ]
}
]