{"title": "FTC, State of Nevada Sue to Stop Tax Debt Relief Scammers from Falsely Impersonating the Government, Making False Claims and Threats to Consumers", "url": "https://www.ftc.gov/news-events/news/press-releases/2025/10/ftc-nevada-sue-tax-debt-relief-scammers-falsely-impersonating-government", "published": "2025-06-17T18:00:00Z", "body": "At the Federal Trade Commission’s request, a federal court has temporarily halted alleged tax debt relief scammers from falsely impersonating government agencies, including the Internal Revenue Service, deceptively promising tax debt relief, sending threats to consumers about their debts and pocketing tens of millions of consumers’ dollars.\n\nThe FTC filed a complaint against American Tax Service (ATS) and its operators, Terrance Selb and Tyler Bennett, as well as seven affiliated entities. The Commission alleges the company’s operators falsely claimed they could settle taxpayers’ back taxes for “pennies on the dollar” or for only a “fraction” of what taxpayers’ owed, often making these claims before evaluating the taxpayer’s circumstances.\n\n“People trying to pay down their tax debt shouldn’t have to worry about fraudsters pocketing their hard-earned money,” said Christopher Mufarrige, FTC’s Bureau of Consumer Protection Director. “The FTC will not hesitate to act to stop companies like ATS that target hard-working Americans with bogus debt relief services.”\n\nSince at least 2019 ATS, Selb and Bennett have misled consumers by mailing deceptive and threatening letters that impersonate the government to solicit inbound telemarketing calls. ATS’s operators also made false claims about their tax debt relief services and failed to fulfill their promises, such as refusing to provide refunds to dissatisfied consumers who requested one.\n\nThe complaint alleges that ATS sales representatives misled consumers about the severity of their tax debt issues to scare them into paying for ATS’s tax debt relief services with some consumers saying that ATS operators falsely claimed that the IRS was investigating them or that the IRS “red flagged” their account or marked it as “high risk.” Once consumers agree to pay for ATS’s services, the operators of the scheme did little, if any, of the promised work and rarely, if ever, obtained the promised results.\n\nThe ATS operators contacted consumers through telemarketing calls or in response to inbound calls resulting from direct mail and online ads. The FTC alleges the defendants engaged in multiple illegal activities, including:\n\nThe FTC alleges that ATS’s conduct violated the FTC Act, Gramm-Leach-Bliley Act, the Telemarketing Sales Rule and the Impersonation Rule. The State of Nevada alleges that ATS’s conduct also violated Nevada law.\n\nThe Commission vote approving the filing of the complaint was 3-0. The FTC filed the complaint in the U.S. District Court for the District of Nevada against American Tax Service LLC, American Tax Solutions, American Tax Solutions LLC, ATS Tax Group LLC, Elite Sales Solutions, GetATaxLawyer.com LLC, TNT Holdings Group LLC, TNT Services Group LLC, TNT Tax Associates Inc., and individual defendants Selb and Bennett.\n\nThe FTC is grateful for the invaluable assistance of the US Postal Inspection Service in this case.\n\nThe staff attorneys on this matter are Simon Barth and James Evans in the FTC’s Bureau of Consumer Protection.\n\nThe Federal Trade Commission works to promote competition and protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at consumer.ftc.gov , or report fraud, scams, and bad business practices at ReportFraud.ftc.gov . Follow the FTC on social media , read consumer alerts and the business blog , and sign up to get the latest FTC news and alerts .", "source": "FTC Press Releases"}
{"title": "FTC, State of Nevada Sue to Stop Tax Debt Relief Scammers from Falsely Impersonating the Government, Making False Claims and Threats to Consumers", "url": "https://www.ftc.gov/news-events/news/press-releases/2025/10/ftc-nevada-sue-tax-debt-relief-scammers-falsely-impersonating-government", "published": "2025-06-17T18:00:00Z", "body": "At the Federal Trade Commission’s request, a federal court has temporarily halted alleged tax debt relief scammers from falsely impersonating government agencies, including the Internal Revenue Service, deceptively promising tax debt relief, sending threats to consumers about their debts and pocketing tens of millions of consumers’ dollars.\n\nThe FTC filed a complaint against American Tax Service (ATS) and its operators, Terrance Selb and Tyler Bennett, as well as seven affiliated entities. The Commission alleges the company’s operators falsely claimed they could settle taxpayers’ back taxes for “pennies on the dollar” or for only a “fraction” of what taxpayers’ owed, often making these claims before evaluating the taxpayer’s circumstances.\n\n“People trying to pay down their tax debt shouldn’t have to worry about fraudsters pocketing their hard-earned money,” said Christopher Mufarrige, FTC’s Bureau of Consumer Protection Director. “The FTC will not hesitate to act to stop companies like ATS that target hard-working Americans with bogus debt relief services.”\n\nSince at least 2019 ATS, Selb and Bennett have misled consumers by mailing deceptive and threatening letters that impersonate the government to solicit inbound telemarketing calls. ATS’s operators also made false claims about their tax debt relief services and failed to fulfill their promises, such as refusing to provide refunds to dissatisfied consumers who requested one.\n\nThe complaint alleges that ATS sales representatives misled consumers about the severity of their tax debt issues to scare them into paying for ATS’s tax debt relief services with some consumers saying that ATS operators falsely claimed that the IRS was investigating them or that the IRS “red flagged” their account or marked it as “high risk.” Once consumers agree to pay for ATS’s services, the operators of the scheme did little, if any, of the promised work and rarely, if ever, obtained the promised results.\n\nThe ATS operators contacted consumers through telemarketing calls or in response to inbound calls resulting from direct mail and online ads. The FTC alleges the defendants engaged in multiple illegal activities, including:\n\nThe FTC alleges that ATS’s conduct violated the FTC Act, Gramm-Leach-Bliley Act, the Telemarketing Sales Rule and the Impersonation Rule. The State of Nevada alleges that ATS’s conduct also violated Nevada law.\n\nThe Commission vote approving the filing of the complaint was 3-0. The FTC filed the complaint in the U.S. District Court for the District of Nevada against American Tax Service LLC, American Tax Solutions, American Tax Solutions LLC, ATS Tax Group LLC, Elite Sales Solutions, GetATaxLawyer.com LLC, TNT Holdings Group LLC, TNT Services Group LLC, TNT Tax Associates Inc., and individual defendants Selb and Bennett.\n\nThe FTC is grateful for the invaluable assistance of the US Postal Inspection Service in this case.\n\nThe staff attorneys on this matter are Simon Barth and James Evans in the FTC’s Bureau of Consumer Protection.\n\nThe Federal Trade Commission works to promote competition and protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at consumer.ftc.gov , or report fraud, scams, and bad business practices at ReportFraud.ftc.gov . Follow the FTC on social media , read consumer alerts and the business blog , and sign up to get the latest FTC news and alerts .", "source": "FTC Press Releases"}
{"title": "Operators of Student Loan Forgiveness Scam Will Be Permanently Banned from Debt Relief Industry, Ordered to Turn Over Assets", "url": "https://www.ftc.gov/news-events/news/press-releases/2025/09/operators-student-loan-forgiveness-scam-will-be-permanently-banned-debt-relief-industry-ordered-turn", "published": "2025-06-17T18:00:00Z", "body": "Eric Caldwell and David Hernandez will be permanently banned from the debt relief industry and required to turn over their assets to resolve Federal Trade Commission charges that they helped operate an illegal student loan debt-relief operation. Additionally, Caldwell will be banned from the telemarketing industry, and Hernandez will be prohibited from violating the Telemarketing Sales Rule.\n\nIn its early 2025 amended complaint, the FTC alleged that Nevada-based Superior Servicing , along with several other companies, and their operators, Caldwell, Hernandez, and Dennise Merdjanian, pretended to be affiliated with the Department of Education or its loan servicers to convince student loan borrowers about the legitimacy of their student loan debt-relief program. They required borrowers pay upfront fees that they claimed would be applied to consumers’ student loan balances, when, in reality, they were pocketing consumers’ hard-earned money.\n\nIndividual defendants Caldwell and Hernandez have agreed to settle the FTC’s charges in proposed orders banning them from engaging in the debt relief industry.  Additionally, Caldwell’s proposed order bans him from engaging in telemarketing, and Hernandez’s proposed order prohibits him from violating the Telemarketing Sales Rule.  Furthermore, the proposed orders prohibit both of them from:\n\nThe proposed orders impose a monetary judgment of more than $45.9 million that will be partially suspended, due to the defendants’ inability to pay, after they pay more than $1.6 million and turn over approximately $560,000 in personal and business assets. If either defendant is found to have materially misrepresented their finances, the full amount of the monetary judgment would become immediately due.\n\nLitigation continues against Merdjanian and the corporate defendants.\n\nThe FTC has resources on how to avoid student loan debt relief scams at ftc.gov/StudentLoans . Consumers can get assistance with their student loans for free at StudentAid.gov .\n\nThe Commission vote approving the stipulated final orders was 3-0. The FTC filed the proposed orders in the U.S. District Court for the District of Nevada. Stipulated final orders have the force of law when approved and signed by the District Court Judge.\n\nThe lead staff attorneys on this matter were Luis Gallegos and Reid Tepfer of the FTC’s Bureau of Consumer Protection assisted by FTC Investigator Kelle Slaughter.\n\nThe Federal Trade Commission works to promote competition and protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at consumer.ftc.gov , or report fraud, scams, and bad business practices at ReportFraud.ftc.gov . Follow the FTC on social media , read consumer alerts and the business blog , and sign up to get the latest FTC news and alerts .", "source": "FTC Press Releases"}
{"title": "FTC Data Show a More Than Four-Fold Increase in Reports of Impersonation Scammers Stealing Tens and Even Hundreds of Thousands from Older Adults", "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-data-show-more-four-fold-increase-reports-impersonation-scammers-stealing-tens-even-hundreds", "published": "2025-06-17T18:00:00Z", "body": "New analysis from the Federal Trade Commission shows a more than four-fold increase since 2020 in reports from older adults who say they lost $10,000 or more—sometimes their entire life savings—to scammers who impersonate trusted government agencies or businesses to convince consumers to transfer money to protect it, when in reality the scammers want to steal it.\n\nThe FTC’s latest Consumer Protection Data Spotlight shows a huge jump in losses reported by people 60 and over to these types of impersonation scams in the last four years. Most notably, combined losses reported by older adults who lost more than $100,000 increased eight-fold, from $55 million in 2020 to $445 million in 2024. While younger consumers also have reported these scams, older adults were much more likely to report these extraordinarily high losses.\n\nThe scams generally involve someone contacting consumers to alert them to a fake and urgent problem and then proceeding to try to persuade them to transfer their money to “keep it safe” or for some other false reason. In reality, the money is being sent to the scammers.\n\nThe lies these scammers tell generally take three forms:\n\nIronically, some scammers even pretend to be with the FTC and tell people to transfer money out of their accounts, deposit cash into Bitcoin ATMS, and even hand off stacks of cash or gold to couriers—actions the FTC would never ask people to do. Regardless of the fake story, the goal is generally the same: to get your money. To avoid such scams, the FTC recommends:\n\nThe Federal Trade Commission works to promote competition and protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. Learn more about consumer topics at consumer.ftc.gov , or report fraud, scams, and bad business practices at ReportFraud.ftc.gov . Follow the FTC on social media , read consumer alerts and the business blog , and sign up to get the latest FTC news and alerts .", "source": "FTC Press Releases"}
{"title": "FTC Sends Money to Student Loan Borrowers Harmed by Debt Relief Scam", "url": "https://www.ftc.gov/news-events/news/press-releases/2025/08/ftc-sends-money-student-loan-borrowers-harmed-debt-relief-scam", "published": "2025-06-17T18:00:00Z", "body": "The Federal Trade Commission is sending a total of $743,230 to student loan borrowers harmed by a debt relief scam that falsely promised loan forgiveness and bilked students out of millions.\n\nIn its complaint against BCO Consulting Services Inc., SLA Consulting Services Inc. and their owners Gianni Olilang, Brandon Clores, Kishan Bhakta, and Allan Radam , the FTC alleged the operators lured students seeking to reduce their loans into paying hundreds to thousands of dollars in illegal upfront fees. The defendants falsely told student loan borrowers that they were affiliated with the Department of Education and would take over servicing for students’ loans. The defendants convinced borrowers into believing that they were enrolled in a legitimate loan repayment program, that their loans would be forgiven in whole or in part, and that most or all of their payments to the companies would be applied to their loan balances. In reality, the defendants were pocketing students’ payments, according to the FTC’s complaint.\n\nIn early October 2023, BCO Consulting, SLA Consulting Services, and their owners were permanently banned from the debt relief industry and were ordered to turn over their assets as part of a settlement with the FTC.\n\nThe FTC is sending checks to 6,269 affected consumers. Recipients should cash their checks within 90 days, as indicated on the check. Consumers who have questions about their payment should contact the refund administrator, Analytics, at 844-656-5198, or visit the FTC website to view frequently asked questions about the refund process. The Commission never requires people to pay money or provide account information to get a refund.\n\nThe Commission’s interactive dashboards for refund data provide a state-by-state breakdown of refunds in FTC cases. In 2024, FTC actions led to more than $339 million in refunds to consumers across the country.\n\nThe Federal Trade Commission works to promote competition and to protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about consumer topics and report scams, fraud, and bad business practices online at ReportFraud.ftc.gov . Like the FTC on Facebook , follow us on Twitter , get consumer alerts , read our blogs , and subscribe to press releases for the latest FTC news and resources.", "source": "FTC Press Releases"}
{"title": "FTC Sends Money to Consumers Harmed by Student Loan Forgiveness Scam", "url": "https://www.ftc.gov/news-events/news/press-releases/2025/07/ftc-sends-money-consumers-harmed-student-loan-forgiveness-scam", "published": "2025-06-17T18:00:00Z", "body": "The Federal Trade Commission is sending more than $356,900 in refunds to consumers harmed by scammers who lured struggling student loan borrowers into signing up for a program that promised loan forgiveness that did not exist.\n\nIn the FTC’s complaint against SL Finance LLC and its owners Michael Castillo and Christian Castillo , the agency charges that the defendants pretended to be affiliated with the U.S. Department of Education, charged illegal junk fees, and lured students with repayment programs and loan forgiveness that did not exist. The complaint also notes that the defendants falsely claimed that their program was part of the CARES Act or a similar COVID-19 relief program.\n\nAs part of a settlement announced in October 2023, the Castillo brothers agreed to surrender their assets, which the FTC is using to provide refunds to consumers. The settlement order also permanently bans them from offering debt relief services of any kind.\n\nThe FTC is sending checks to 7,150 affected consumers. Recipients should cash their checks within 90 days, as indicated on the check. Consumers who have questions about their payment should contact the refund administrator, Analytics, at 833-588-3361, or visit the FTC website to view frequently asked questions about the refund process. The Commission never requires people to pay money or provide account information to get a refund.\n\nThe Commission’s interactive dashboards for refund data provide a state-by-state breakdown of refunds in FTC cases. In 2024, FTC actions led to more than $339 million in refunds to consumers across the country.\n\nThe Federal Trade Commission works to promote competition and to protect and educate consumers . The FTC will never demand money, make threats, tell you to transfer money, or promise you a prize. You can learn more about consumer topics and report scams, fraud, and bad business practices online at ReportFraud.ftc.gov . Like the FTC on Facebook , follow us on Twitter , get consumer alerts , read our blogs , and subscribe to press releases for the latest FTC news and resources.", "source": "FTC Press Releases"}
