{"title": "Who’s eligible for a refund from Amazon?", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/whos-eligible-refund-amazon", "published": "2025-09-30T17:00:00Z", "body": "You might have heard that, last week, Amazon agreed to pay $2.5 billion to settle the FTC’s charges that it enrolled millions of people in Prime subscriptions without their consent – and then made it hard for those unwilling Prime subscribers to cancel. Since $1.5 billion of that amount goes back to consumers, you might be wondering: who gets it? How? And what do I need to do?\nLast question, first: right now, do nothing. The refunds are automatic and will go out by December 25, 2025.\nNow for the answers to those other questions. If you meet all three of these requirements, you may be eligible for an automatic refund of your Prime membership fees, up to $51:\nOne more important thing. Scammers often use the names of well-known companies and big FTC settlements to contact people to “help” with your account or refund. How do you know it’s a scam? Because the FTC will never contact you about this refund. And no one from the FTC or Amazon will ask you for money to get a refund. And only scammers say they can get you special access or a guaranteed refund.\nIf you get an unexpected call, text, or email from someone who claims to be the FTC or Amazon, it’s probably a scam. Tell the FTC at ReportFraud.ftc.gov . And learn more about these refunds at ftc.gov/Amazon .\nMore\nMás"}
{"title": "Free resources for learning money management and how to spot and avoid scams", "url": "https://consumer.ftc.gov/consumer-alerts/2025/08/free-resources-learning-money-management-how-spot-avoid-scams", "published": "2025-09-30T17:00:00Z", "body": "Do you know someone who might need to brush up on their money management skills? Or learn to spot and avoid scams? Back-to-school season is a good time to get to work on learning. Whether you're a student, a parent, or just looking to sharpen your skills, you can learn how to protect your money and personal information. The FTC’s consumer.gov has free, reliable information in plain language to help you get started.\nAt consumer.gov , you’ll find step-by-step guidance on everyday money choices — from making a budget to using credit to avoiding scams. Everything is written in clear language and designed for real-life situations. Want to know what’s covered?\nHere’s what you’ll find:\nExplore consumer.gov and share it with your community. Each article has social media icons at the bottom to make sharing easy. To keep up with the latest from the FTC, including the latest scams, sign up to get Consumer Alerts at ftc.gov/ConsumerAlerts .\nMore\nMás"}
