{"title": "First Research Published from Physician 6(b) Study", "url": "https://www.ftc.gov/enforcement/competition-matters/2025/06/first-research-published-physician-6b-study", "published": "2025-06-17T18:00:00Z", "body": "We are excited to announce the publication of the first peer-reviewed journal article coming out of the FTC’s Physician 6(b) study .\nThe paper, published in the May 2025 issue of Health Affairs Scholar, provides an overview of the merger activity within 15 states between 2015 and 2020 (inclusive).\nThe study identifies approximately 2,000 physician mergers during that period and characterizes the mergers in several ways, including:\nThis study builds on a strong tradition of Bureau of Economics research that informs the Commission and public about competition in healthcare markets. We look forward to disseminating more research based on the Physician 6(b) study data in the future.\nThe paper is available at: Physician mergers involve 38% of doctors, substantial health system participation, and frequent serial acquisition"}
{"title": "The FTC Is on the Front Lines of Tech Innovation & Regulation", "url": "https://www.ftc.gov/policy/advocacy-research/tech-at-ftc/2025/01/ftc-front-lines-tech-innovation-regulation", "published": "2025-06-17T18:00:00Z", "body": "The FTC has been hard at work over the past few years. Part of the agency's mission has been to build internal muscles to better anticipate how existing and emerging technologies can harm consumers and competition. This is why the FTC established the Office of Technology (OT), a first in the agency's 110-year history. OT's work has become an indelible part of the agency, an acknowledgment of how deeply technology is ingrained across the economy, not just sequestered to \"big tech.\"\nAt the core of this work are the people who make it possible. Thank you my OT colleagues, [1] the FTC career staff, [2] leadership, [3] and countless communities [4] who have and will continue to support the FTC's mission.\nTaking a moment to reflect, here are some tech-related programmatic advances that staff across the agency [5] have contributed to.\nThis work and our team are a testament to the power of public service. There's no key performance indicator or line item on an income statement that is as meaningful as tangibly improving and protecting the lives of the American people. The FTC is one of the rare places that has the mission, authorities, and talented staff to hold outsized corporate power to account and enforce the law. While this is just a snapshot of the agency's longstanding commitment to its mission, it highlights how mighty the FTC can be. Here's to the work ahead.\n1 Thank you to the brilliant, relentlessly scrappy, and talented colleagues, past and present, who built the Office of Technology and team CTO, who have made the (allegedly) impossible possible. As adaptable and resourceful as raccoons, you have navigated unfamiliar and complex situations and can turn meager scraps into a banquet to benefit the American people.\n2 Thank you to the Bureaus and Office career staff for establishing and standing up the team and for helping to integrate our team in initiatives and matters across the agency.\n3 This includes the Chair, Commissioners, Bureau and Office directors, division managers, and staff leads.\n4 This includes the many academics, researchers, practitioners, investigative journalists, and civil society advocates whose engagement and invaluable contributions have positively impacted the agency's work.\n5 This includes the many dedicated staff technologists, investigators, attorneys, economists, and analysts who work on cross-agency initiatives."}
{"title": "FTC, State of Nevada Sue to Stop Tax Debt Relief Scammers from Falsely Impersonating the Government, Making False Claims and Threats to Consumers", "url": "https://www.ftc.gov/news-events/news/press-releases/2025/10/ftc-nevada-sue-tax-debt-relief-scammers-falsely-impersonating-government", "published": "2025-06-17T18:00:00Z", "body": "At the Federal Trade Commission’s request, a federal court has temporarily halted alleged tax debt relief scammers from falsely impersonating government agencies, including the Internal Revenue Service, deceptively promising tax debt relief, sending threats to consumers about their debts and pocketing tens of millions of consumers’ dollars.\nThe FTC filed a complaint against American Tax Service (ATS) and its operators, Terrance Selb and Tyler Bennett, as well as seven affiliated entities. The Commission alleges the company’s operators falsely claimed they could settle taxpayers’ back taxes for “pennies on the dollar” or for only a “fraction” of what taxpayers’ owed, often making these claims before evaluating the taxpayer’s circumstances.\n“People trying to pay down their tax debt shouldn’t have to worry about fraudsters pocketing their hard-earned money,” said Christopher Mufarrige, FTC’s Bureau of Consumer Protection Director. “The FTC will not hesitate to act to stop companies like ATS that target hard-working Americans with bogus debt relief services.”\nSince at least 2019 ATS, Selb and Bennett have misled consumers by mailing deceptive and threatening letters that impersonate the government to solicit inbound telemarketing calls. ATS’s operators also made false claims about their tax debt relief services and failed to fulfill their promises, such as refusing to provide refunds to dissatisfied consumers who requested one.\nThe complaint alleges that ATS sales representatives misled consumers about the severity of their tax debt issues to scare them into paying for ATS’s tax debt relief services with some consumers saying that ATS operators falsely claimed that the IRS was investigating them or that the IRS “red flagged” their account or marked it as “high risk.” Once consumers agree to pay for ATS’s services, the operators of the scheme did little, if any, of the promised work and rarely, if ever, obtained the promised results.\nThe ATS operators contacted consumers through telemarketing calls or in response to inbound calls resulting from direct mail and online ads. The FTC alleges the defendants engaged in multiple illegal activities, including:\nThe FTC alleges that ATS’s conduct violated the FTC Act, Gramm-Leach-Bliley Act, the Telemarketing Sales Rule and the Impersonation Rule. The State of Nevada alleges that ATS’s conduct also violated Nevada law.\nThe Commission vote approving the filing of the complaint was 3-0. The FTC filed the complaint in the U.S. District Court for the District of Nevada against American Tax Service LLC, American Tax Solutions, American Tax Solutions LLC, ATS Tax Group LLC, Elite Sales Solutions, GetATaxLawyer.com LLC, TNT Holdings Group LLC, TNT Services Group LLC, TNT Tax Associates Inc., and individual defendants Selb and Bennett.\nThe FTC is grateful for the invaluable assistance of the US Postal Inspection Service in this case.\nThe staff attorneys on this matter are Simon Barth and James Evans in the FTC’s Bureau of Consumer Protection."}
{"title": "Eighteenth Annual Microeconomics Conference", "url": "https://www.ftc.gov/news-events/events/2025/11/eighteenth-annual-microeconomics-conference", "published": "2025-06-17T18:00:00Z", "body": "The Federal Trade Commission's Bureau of Economics and the Tobin Center for Economic Policy at Yale University will host the 18th Annual FTC Microeconomics Conference on November 13 and 14, 2025 in Washington, D.C. This event will bring together scholars working in areas related to the FTC’s antitrust, consumer protection, and public policy missions. This will be an in-person event with a live stream for those who want to view remotely.\nThe scientific committee for the conference is:\nOrganizers: Samuel Kleiner (FTC) and Eric Spurlino (FTC)\nStaff Contact: Stephanie Aaron\nThis conference is sponsored by the Federal Trade Commission’s Bureau of Economics and the Tobin Center for Economic Policy at Yale University.\nTo register, please fill out the registration form with your name, email, and affiliation. You will receive a confirmation email when your registration is complete. We will use your email address to contact you with information about the conference and will share your name and email address with the conference co-sponsors. The FTC Act and other laws we administer permit the collection of your pre-registration contact information and the comments you file to consider and use in this proceeding as appropriate. For additional information, including routine uses permitted by the Privacy Act, see the Commission’s system for mailing lists . For more details, please see the FTC Privacy Policy .\nThe conference is free and open to the public. Please arrive early with enough time to go through security. The security processing will include a metal detector and X-ray screening of all hand carried items. You must have a valid government issued photo ID (government badge, license, passport, etc.). The conference will follow the AEA’s code of professional conduct , and requires presenters to adhere to the Bureau of Economics' disclosure policies . These disclosures will be included in the presenters’ bios."}
{"title": "Playing it Safe: Explore the FTC's Top Video Game Cases", "url": "https://www.ftc.gov/news-events/features/gaming", "published": "2025-06-17T18:00:00Z", "body": "Classic video games have been around for a while. But in recent years with the growth of online gaming, in-app purchases and information sharing, these games come with new issues regarding privacy, competition and online safety, particularly for children. Learn about the FTC's notable video game cases and what our agency is doing to keep the public safe."}
{"title": "FTC Refunds to Consumers", "url": "https://public.tableau.com/app/profile/federal.trade.commission/viz/Refunds_15797958402020/RefundsbyCase", "published": "", "body": ""}
