{"title": "Who’s eligible for a refund from Amazon?", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/whos-eligible-refund-amazon", "published": "2025-09-30T17:00:00Z", "body": "You might have heard that, last week, Amazon agreed to pay $2.5 billion to settle the FTC’s charges that it enrolled millions of people in Prime subscriptions without their consent – and then made it hard for those unwilling Prime subscribers to cancel. Since $1.5 billion of that amount goes back to consumers, you might be wondering: who gets it? How? And what do I need to do?\nLast question, first: right now, do nothing. The refunds are automatic and will go out by December 25, 2025.\nNow for the answers to those other questions. If you meet all three of these requirements, you may be eligible for an automatic refund of your Prime membership fees, up to $51:\nOne more important thing. Scammers often use the names of well-known companies and big FTC settlements to contact people to “help” with your account or refund. How do you know it’s a scam? Because the FTC will never contact you about this refund. And no one from the FTC or Amazon will ask you for money to get a refund. And only scammers say they can get you special access or a guaranteed refund.\nIf you get an unexpected call, text, or email from someone who claims to be the FTC or Amazon, it’s probably a scam. Tell the FTC at ReportFraud.ftc.gov . And learn more about these refunds at ftc.gov/Amazon .\nMore\nMás"}
{"title": "Free resources for learning money management and how to spot and avoid scams", "url": "https://consumer.ftc.gov/consumer-alerts/2025/08/free-resources-learning-money-management-how-spot-avoid-scams", "published": "2025-09-30T17:00:00Z", "body": "Do you know someone who might need to brush up on their money management skills? Or learn to spot and avoid scams? Back-to-school season is a good time to get to work on learning. Whether you're a student, a parent, or just looking to sharpen your skills, you can learn how to protect your money and personal information. The FTC’s consumer.gov has free, reliable information in plain language to help you get started.\nAt consumer.gov , you’ll find step-by-step guidance on everyday money choices — from making a budget to using credit to avoiding scams. Everything is written in clear language and designed for real-life situations. Want to know what’s covered?\nHere’s what you’ll find:\nExplore consumer.gov and share it with your community. Each article has social media icons at the bottom to make sharing easy. To keep up with the latest from the FTC, including the latest scams, sign up to get Consumer Alerts at ftc.gov/ConsumerAlerts .\nMore\nMás"}
{"title": "How to spot a job scam", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/how-spot-job-scam", "published": "2025-09-30T17:00:00Z", "body": "Every day, people you know are seeing phony business opportunities, work-at-home scams, shady employment agencies, and scammy multi-level marketing schemes. Job seekers don’t have the time or resources to waste on fake opportunities, but there are some ways to spot these scams. Watch this video as FTC Chairman Andrew Ferguson explains.\nJob Scams Warning with FTC Chairman Andrew Ferguson\nShare this video using the links in the player above or use the YouTube version .\nProtecting American workers from these kinds of practices is a priority for the FTC — in fact, that’s why the Chairman launched a Labor Task Force to keep the agency’s focus on these issues. And reports to the FTC show that these scams are alive and well. Check out this dashboard to see what reports and losses look like. And if you spot a job scam, tell the FTC: ReportFraud.ftc.gov .\nMore\nMás"}
{"title": "When sharing your info online leads to unwanted and unlawful telemarketing calls", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/when-sharing-your-info-online-leads-unwanted-and-unlawful-telemarketing-calls", "published": "2025-09-30T17:00:00Z", "body": "Do you get a lot of calls trying to sell you products or services you never asked for? Sometimes telemarketing calls are random. Other times, companies trick you into sharing your information so they can sell it to the telemarketers that call you (without your permission). If you’re on the Do Not Call Registry , these calls are illegal. So, how can you cut down on the number of unwanted telemarketing calls you get?\nIf you share your info with websites offering coupons, sweepstakes, or quotes for products like insurance or warranties, the site owners might collect and sell it to different telemarketers. That’s when the calls start from telemarketers — making calls you never agreed to receive and selling products you didn’t ask for. And that’s when the law violations can start adding up too.\nToday the FTC announced a settlement with Citizens Disability , a company selling Social Security disability advocacy services primarily through telemarketing calls. The FTC charged that the company bought people’s information (which came from websites offering things like coupons and sweepstakes) and used it to make millions of illegal telemarketing calls, including robocalls. The FTC also charged that the company falsely told millions of people it was calling in response to the person’s recent inquiry about their eligibility for Social Security disability benefits.\nTo help you cut down on unwanted telemarketing calls and avoid scams:\nFor more advice on how to stop unwanted calls, visit ftc.gov/calls .\nMore\nMás"}
{"title": "When sharing your info online leads to unwanted and unlawful telemarketing calls", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/when-sharing-your-info-online-leads-unwanted-and-unlawful-telemarketing-calls", "published": "2025-09-30T17:00:00Z", "body": "Do you get a lot of calls trying to sell you products or services you never asked for? Sometimes telemarketing calls are random. Other times, companies trick you into sharing your information so they can sell it to the telemarketers that call you (without your permission). If you’re on the Do Not Call Registry , these calls are illegal. So, how can you cut down on the number of unwanted telemarketing calls you get?\nIf you share your info with websites offering coupons, sweepstakes, or quotes for products like insurance or warranties, the site owners might collect and sell it to different telemarketers. That’s when the calls start from telemarketers — making calls you never agreed to receive and selling products you didn’t ask for. And that’s when the law violations can start adding up too.\nToday the FTC announced a settlement with Citizens Disability , a company selling Social Security disability advocacy services primarily through telemarketing calls. The FTC charged that the company bought people’s information (which came from websites offering things like coupons and sweepstakes) and used it to make millions of illegal telemarketing calls, including robocalls. The FTC also charged that the company falsely told millions of people it was calling in response to the person’s recent inquiry about their eligibility for Social Security disability benefits.\nTo help you cut down on unwanted telemarketing calls and avoid scams:\nFor more advice on how to stop unwanted calls, visit ftc.gov/calls .\nMore\nMás"}
{"title": "How To Avoid a Scam", "url": "https://consumer.ftc.gov/articles/how-avoid-scam", "published": "2025-09-30T21:00:00Z", "body": "The FTC will never threaten you, say you must transfer your money to “protect it,” or tell you to withdraw cash or buy gold and give it to someone. That’s a scam.\nReport it at ReportFraud.ftc.gov\n1. Scammers PRETEND to be from an organization you know.\nScammers often pretend to be contacting you on behalf of the government. They might use a real name, like the FTC, Social Security Administration, IRS, or Medicare , or make up a name that sounds official. Some pretend to be from a business you know, like a utility company , a tech company , or even a charity asking for donations.\nThey use technology to change the phone number that appears on your caller ID. So the name and number you see might not be real.\n2. Scammers say there’s a PROBLEM or a PRIZE.\nThey might say you’re in trouble with the government . Or you owe money . Or someone in your family had an emergency . Or that there’s a virus on your computer .\nSome scammers say there’s a problem with one of your accounts and that you need to verify some information.\nOthers will lie and say you won money in a lottery or sweepstakes but have to pay a fee to get it.\n3. Scammers PRESSURE you to act immediately.\nScammers want you to act before you have time to think. If you’re on the phone , they might tell you not to hang up so you can’t check out their story.\nThey might threaten to arrest you, sue you, take away your driver’s or business license, or deport you. They might say your computer is about to be corrupted.\n4. Scammers tell you to PAY in a specific way.\nThey often insist that you can only pay by using cryptocurrency , wiring money through a company like MoneyGram or Western Union, using a payment app , or putting money on a gift card and then giving them the numbers on the back of the card.\nSome will send you a check (that will later turn out to be fake), then tell you to deposit it and send them money.\nBlock unwanted calls and text messages. Take steps to block unwanted calls and to filter unwanted text messages .\nDon’t give your personal or financial information in response to a request that you didn’t expect. Honest organizations won’t call, email, or text to ask for your personal information, like your Social Security, bank account, or credit card numbers.\nIf you get an email or text message from a company you do business with and you think it’s real, it’s still best not to click on any links. Instead, contact them using a website you know is trustworthy. Or look up their phone number. Don’t call a number they gave you or the number from your caller ID.\nResist the pressure to act immediately. Honest businesses will give you time to make a decision. Anyone who pressures you to pay or give them your personal information is a scammer.\nKnow how scammers tell you to pay. Never pay someone who insists that you can only pay with cryptocurrency , a wire transfer service like Western Union or MoneyGram, a payment app , or a gift card . And never deposit a check and send money back to someone.\nStop and talk to someone you trust. Before you do anything else, tell someone — a friend, a family member, a neighbor — what happened. Talking about it could help you realize it’s a scam.\nIf you were scammed or think you saw a scam, tell the FTC at ReportFraud.ftc.gov ."}
{"title": "What To Do If You Were Scammed", "url": "https://consumer.ftc.gov/articles/what-do-if-you-were-scammed", "published": "2025-09-30T21:00:00Z", "body": "Find out what to do if you paid someone you think is a scammer, or if you gave a scammer your personal information or access to your computer or phone.\nThe FTC will never threaten you, say you must transfer your money to “protect it,” or tell you to withdraw cash or buy gold and give it to someone. That’s a scam.\nReport it at ReportFraud.ftc.gov\nScammers can be very convincing. They call, email, and send us text messages trying to get our money or sensitive personal information — like our Social Security or account numbers. And they're good at what they do. Here’s what to do if you paid someone you think is a scammer or gave them your personal information or access to your computer or phone. If you paid a scammer, your money might be gone already. No matter how you paid, it’s always worth asking the company you used to send the money if there’s a way to get it back.\nContact the wire transfer company . Tell them it was a fraudulent transfer. Ask them to reverse the wire transfer and give you your money back.\nIf you sent cash by U.S. mail, contact the U.S. Postal Inspection Service at 877-876-2455 and ask them to intercept the package. To learn more about this process, visit USPS Package Intercept: The Basics .\nIf you used another delivery service, contact them as soon as possible.\nContact your service provider to take back control of your phone number. Once you do, change your account password.\nAlso check your credit card, bank, and other financial accounts for unauthorized charges or changes. If you see any, report them to the company or institution. Then go to IdentityTheft.gov to see what steps you should take.\nWhen you report a scam, the FTC can use the information to build cases against scammers, spot trends, educate the public, and share data about what is happening in your community. If you experienced a scam — or even spotted one, report it to the FTC at ReportFraud.ftc.gov .\nCheck out what’s going on in your state or metro area by visiting ftc.gov/exploredata ."}
{"title": "Report Fraud, Scams, and Bad Business Practices", "url": "https://reportfraud.ftc.gov", "published": "", "body": "English Due to the government shutdown, we are unable to offer this website service. We will resume normal operations when the government is funded.\nInformation about consumer protection topics can be found at: Consumer.ftc.gov\nLearn what to do if you were scammed.\nEspa ñol Debido al cierre del gobierno, no podemos ofrecer este servicio de sitio web. Reanudaremos las operaciones normales cuando el gobierno est éfinanciado.\nLa informaci ón sobre temas de protecci ón al consumidor se puede encontrar en: consumidor.ftc.gov\nAprenda qu éhacer si fue estafado."}
{"title": "When sharing your info online leads to unwanted and unlawful telemarketing calls", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/when-sharing-your-info-online-leads-unwanted-and-unlawful-telemarketing-calls", "published": "2025-09-30T17:00:00Z", "body": "Do you get a lot of calls trying to sell you products or services you never asked for? Sometimes telemarketing calls are random. Other times, companies trick you into sharing your information so they can sell it to the telemarketers that call you (without your permission). If you’re on the Do Not Call Registry , these calls are illegal. So, how can you cut down on the number of unwanted telemarketing calls you get?\nIf you share your info with websites offering coupons, sweepstakes, or quotes for products like insurance or warranties, the site owners might collect and sell it to different telemarketers. That’s when the calls start from telemarketers — making calls you never agreed to receive and selling products you didn’t ask for. And that’s when the law violations can start adding up too.\nToday the FTC announced a settlement with Citizens Disability , a company selling Social Security disability advocacy services primarily through telemarketing calls. The FTC charged that the company bought people’s information (which came from websites offering things like coupons and sweepstakes) and used it to make millions of illegal telemarketing calls, including robocalls. The FTC also charged that the company falsely told millions of people it was calling in response to the person’s recent inquiry about their eligibility for Social Security disability benefits.\nTo help you cut down on unwanted telemarketing calls and avoid scams:\nFor more advice on how to stop unwanted calls, visit ftc.gov/calls .\nMore\nMás"}
{"title": "This Medicare Open Enrollment season, learn how to protect yourself from scams", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/medicare-open-enrollment-season-learn-how-protect-yourself-scams", "published": "2025-09-30T17:00:00Z", "body": "Every year, scammers get more active around Medicare Open Enrollment Period, trying to get your money, information, or both. As you consider your health coverage and prescription options during this period (October 15-December 7), learn to spot the scams.\nFirst, know that scammers often impersonate Medicare and contact you unexpectedly. They might sound professional and even have some of your personal information. They’ll say you need a “new” or “updated” Medicare card and ask for your Medicare, bank account, or credit card number. But real Medicare cards are free and mailed to you automatically. And true Medicare representatives won’t call, text, or email you out of the blue to ask for your numbers or a payment.\nHere are some ways to protect yourself from Medicare scams during Open Enrollment — and year-round:\nReport Medicare impersonators and other Medicare scams at 1-800-MEDICARE. Then tell the FTC at ReportFraud.ftc.gov .\nFor additional help to prevent, detect, and report potential Medicare fraud, errors, and abuse, contact your local Senior Medicare Patrol .\nMore\nMás"}
