{"title": "Who’s eligible for a refund from Amazon?", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/whos-eligible-refund-amazon", "published": "2025-09-30T17:00:00Z", "body": "You might have heard that, last week, Amazon agreed to pay $2.5 billion to settle the FTC’s charges that it enrolled millions of people in Prime subscriptions without their consent – and then made it hard for those unwilling Prime subscribers to cancel. Since $1.5 billion of that amount goes back to consumers, you might be wondering: who gets it? How? And what do I need to do?\nLast question, first: right now, do nothing. The refunds are automatic and will go out by December 25, 2025.\nNow for the answers to those other questions. If you meet all three of these requirements, you may be eligible for an automatic refund of your Prime membership fees, up to $51:\nOne more important thing. Scammers often use the names of well-known companies and big FTC settlements to contact people to “help” with your account or refund. How do you know it’s a scam? Because the FTC will never contact you about this refund. And no one from the FTC or Amazon will ask you for money to get a refund. And only scammers say they can get you special access or a guaranteed refund.\nIf you get an unexpected call, text, or email from someone who claims to be the FTC or Amazon, it’s probably a scam. Tell the FTC at ReportFraud.ftc.gov . And learn more about these refunds at ftc.gov/Amazon .\nMore\nMás"}
{"title": "Free resources for learning money management and how to spot and avoid scams", "url": "https://consumer.ftc.gov/consumer-alerts/2025/08/free-resources-learning-money-management-how-spot-avoid-scams", "published": "2025-09-30T17:00:00Z", "body": "Do you know someone who might need to brush up on their money management skills? Or learn to spot and avoid scams? Back-to-school season is a good time to get to work on learning. Whether you're a student, a parent, or just looking to sharpen your skills, you can learn how to protect your money and personal information. The FTC’s consumer.gov has free, reliable information in plain language to help you get started.\nAt consumer.gov , you’ll find step-by-step guidance on everyday money choices — from making a budget to using credit to avoiding scams. Everything is written in clear language and designed for real-life situations. Want to know what’s covered?\nHere’s what you’ll find:\nExplore consumer.gov and share it with your community. Each article has social media icons at the bottom to make sharing easy. To keep up with the latest from the FTC, including the latest scams, sign up to get Consumer Alerts at ftc.gov/ConsumerAlerts .\nMore\nMás"}
{"title": "How to spot a job scam", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/how-spot-job-scam", "published": "2025-09-30T17:00:00Z", "body": "Every day, people you know are seeing phony business opportunities, work-at-home scams, shady employment agencies, and scammy multi-level marketing schemes. Job seekers don’t have the time or resources to waste on fake opportunities, but there are some ways to spot these scams. Watch this video as FTC Chairman Andrew Ferguson explains.\nJob Scams Warning with FTC Chairman Andrew Ferguson\nShare this video using the links in the player above or use the YouTube version .\nProtecting American workers from these kinds of practices is a priority for the FTC — in fact, that’s why the Chairman launched a Labor Task Force to keep the agency’s focus on these issues. And reports to the FTC show that these scams are alive and well. Check out this dashboard to see what reports and losses look like. And if you spot a job scam, tell the FTC: ReportFraud.ftc.gov .\nMore\nMás"}
{"title": "When sharing your info online leads to unwanted and unlawful telemarketing calls", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/when-sharing-your-info-online-leads-unwanted-and-unlawful-telemarketing-calls", "published": "2025-09-30T17:00:00Z", "body": "Do you get a lot of calls trying to sell you products or services you never asked for? Sometimes telemarketing calls are random. Other times, companies trick you into sharing your information so they can sell it to the telemarketers that call you (without your permission). If you’re on the Do Not Call Registry , these calls are illegal. So, how can you cut down on the number of unwanted telemarketing calls you get?\nIf you share your info with websites offering coupons, sweepstakes, or quotes for products like insurance or warranties, the site owners might collect and sell it to different telemarketers. That’s when the calls start from telemarketers — making calls you never agreed to receive and selling products you didn’t ask for. And that’s when the law violations can start adding up too.\nToday the FTC announced a settlement with Citizens Disability , a company selling Social Security disability advocacy services primarily through telemarketing calls. The FTC charged that the company bought people’s information (which came from websites offering things like coupons and sweepstakes) and used it to make millions of illegal telemarketing calls, including robocalls. The FTC also charged that the company falsely told millions of people it was calling in response to the person’s recent inquiry about their eligibility for Social Security disability benefits.\nTo help you cut down on unwanted telemarketing calls and avoid scams:\nFor more advice on how to stop unwanted calls, visit ftc.gov/calls .\nMore\nMás"}
{"title": "When sharing your info online leads to unwanted and unlawful telemarketing calls", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/when-sharing-your-info-online-leads-unwanted-and-unlawful-telemarketing-calls", "published": "2025-09-30T17:00:00Z", "body": "Do you get a lot of calls trying to sell you products or services you never asked for? Sometimes telemarketing calls are random. Other times, companies trick you into sharing your information so they can sell it to the telemarketers that call you (without your permission). If you’re on the Do Not Call Registry , these calls are illegal. So, how can you cut down on the number of unwanted telemarketing calls you get?\nIf you share your info with websites offering coupons, sweepstakes, or quotes for products like insurance or warranties, the site owners might collect and sell it to different telemarketers. That’s when the calls start from telemarketers — making calls you never agreed to receive and selling products you didn’t ask for. And that’s when the law violations can start adding up too.\nToday the FTC announced a settlement with Citizens Disability , a company selling Social Security disability advocacy services primarily through telemarketing calls. The FTC charged that the company bought people’s information (which came from websites offering things like coupons and sweepstakes) and used it to make millions of illegal telemarketing calls, including robocalls. The FTC also charged that the company falsely told millions of people it was calling in response to the person’s recent inquiry about their eligibility for Social Security disability benefits.\nTo help you cut down on unwanted telemarketing calls and avoid scams:\nFor more advice on how to stop unwanted calls, visit ftc.gov/calls .\nMore\nMás"}
{"title": "How To Avoid a Scam", "url": "https://consumer.ftc.gov/articles/how-avoid-scam", "published": "2025-09-30T21:00:00Z", "body": "The FTC will never threaten you, say you must transfer your money to “protect it,” or tell you to withdraw cash or buy gold and give it to someone. That’s a scam.\nReport it at ReportFraud.ftc.gov\n1. Scammers PRETEND to be from an organization you know.\nScammers often pretend to be contacting you on behalf of the government. They might use a real name, like the FTC, Social Security Administration, IRS, or Medicare , or make up a name that sounds official. Some pretend to be from a business you know, like a utility company , a tech company , or even a charity asking for donations.\nThey use technology to change the phone number that appears on your caller ID. So the name and number you see might not be real.\n2. Scammers say there’s a PROBLEM or a PRIZE.\nThey might say you’re in trouble with the government . Or you owe money . Or someone in your family had an emergency . Or that there’s a virus on your computer .\nSome scammers say there’s a problem with one of your accounts and that you need to verify some information.\nOthers will lie and say you won money in a lottery or sweepstakes but have to pay a fee to get it.\n3. Scammers PRESSURE you to act immediately.\nScammers want you to act before you have time to think. If you’re on the phone , they might tell you not to hang up so you can’t check out their story.\nThey might threaten to arrest you, sue you, take away your driver’s or business license, or deport you. They might say your computer is about to be corrupted.\n4. Scammers tell you to PAY in a specific way.\nThey often insist that you can only pay by using cryptocurrency , wiring money through a company like MoneyGram or Western Union, using a payment app , or putting money on a gift card and then giving them the numbers on the back of the card.\nSome will send you a check (that will later turn out to be fake), then tell you to deposit it and send them money.\nBlock unwanted calls and text messages. Take steps to block unwanted calls and to filter unwanted text messages .\nDon’t give your personal or financial information in response to a request that you didn’t expect. Honest organizations won’t call, email, or text to ask for your personal information, like your Social Security, bank account, or credit card numbers.\nIf you get an email or text message from a company you do business with and you think it’s real, it’s still best not to click on any links. Instead, contact them using a website you know is trustworthy. Or look up their phone number. Don’t call a number they gave you or the number from your caller ID.\nResist the pressure to act immediately. Honest businesses will give you time to make a decision. Anyone who pressures you to pay or give them your personal information is a scammer.\nKnow how scammers tell you to pay. Never pay someone who insists that you can only pay with cryptocurrency , a wire transfer service like Western Union or MoneyGram, a payment app , or a gift card . And never deposit a check and send money back to someone.\nStop and talk to someone you trust. Before you do anything else, tell someone — a friend, a family member, a neighbor — what happened. Talking about it could help you realize it’s a scam.\nIf you were scammed or think you saw a scam, tell the FTC at ReportFraud.ftc.gov ."}
{"title": "What To Do If You Were Scammed", "url": "https://consumer.ftc.gov/articles/what-do-if-you-were-scammed", "published": "2025-09-30T21:00:00Z", "body": "Find out what to do if you paid someone you think is a scammer, or if you gave a scammer your personal information or access to your computer or phone.\nThe FTC will never threaten you, say you must transfer your money to “protect it,” or tell you to withdraw cash or buy gold and give it to someone. That’s a scam.\nReport it at ReportFraud.ftc.gov\nScammers can be very convincing. They call, email, and send us text messages trying to get our money or sensitive personal information — like our Social Security or account numbers. And they're good at what they do. Here’s what to do if you paid someone you think is a scammer or gave them your personal information or access to your computer or phone. If you paid a scammer, your money might be gone already. No matter how you paid, it’s always worth asking the company you used to send the money if there’s a way to get it back.\nContact the wire transfer company . Tell them it was a fraudulent transfer. Ask them to reverse the wire transfer and give you your money back.\nIf you sent cash by U.S. mail, contact the U.S. Postal Inspection Service at 877-876-2455 and ask them to intercept the package. To learn more about this process, visit USPS Package Intercept: The Basics .\nIf you used another delivery service, contact them as soon as possible.\nContact your service provider to take back control of your phone number. Once you do, change your account password.\nAlso check your credit card, bank, and other financial accounts for unauthorized charges or changes. If you see any, report them to the company or institution. Then go to IdentityTheft.gov to see what steps you should take.\nWhen you report a scam, the FTC can use the information to build cases against scammers, spot trends, educate the public, and share data about what is happening in your community. If you experienced a scam — or even spotted one, report it to the FTC at ReportFraud.ftc.gov .\nCheck out what’s going on in your state or metro area by visiting ftc.gov/exploredata ."}
{"title": "Report Fraud, Scams, and Bad Business Practices", "url": "https://reportfraud.ftc.gov", "published": "", "body": "English Due to the government shutdown, we are unable to offer this website service. We will resume normal operations when the government is funded.\nInformation about consumer protection topics can be found at: Consumer.ftc.gov\nLearn what to do if you were scammed.\nEspa ñol Debido al cierre del gobierno, no podemos ofrecer este servicio de sitio web. Reanudaremos las operaciones normales cuando el gobierno est éfinanciado.\nLa informaci ón sobre temas de protecci ón al consumidor se puede encontrar en: consumidor.ftc.gov\nAprenda qu éhacer si fue estafado."}
{"title": "When sharing your info online leads to unwanted and unlawful telemarketing calls", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/when-sharing-your-info-online-leads-unwanted-and-unlawful-telemarketing-calls", "published": "2025-09-30T17:00:00Z", "body": "Do you get a lot of calls trying to sell you products or services you never asked for? Sometimes telemarketing calls are random. Other times, companies trick you into sharing your information so they can sell it to the telemarketers that call you (without your permission). If you’re on the Do Not Call Registry , these calls are illegal. So, how can you cut down on the number of unwanted telemarketing calls you get?\nIf you share your info with websites offering coupons, sweepstakes, or quotes for products like insurance or warranties, the site owners might collect and sell it to different telemarketers. That’s when the calls start from telemarketers — making calls you never agreed to receive and selling products you didn’t ask for. And that’s when the law violations can start adding up too.\nToday the FTC announced a settlement with Citizens Disability , a company selling Social Security disability advocacy services primarily through telemarketing calls. The FTC charged that the company bought people’s information (which came from websites offering things like coupons and sweepstakes) and used it to make millions of illegal telemarketing calls, including robocalls. The FTC also charged that the company falsely told millions of people it was calling in response to the person’s recent inquiry about their eligibility for Social Security disability benefits.\nTo help you cut down on unwanted telemarketing calls and avoid scams:\nFor more advice on how to stop unwanted calls, visit ftc.gov/calls .\nMore\nMás"}
{"title": "This Medicare Open Enrollment season, learn how to protect yourself from scams", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/medicare-open-enrollment-season-learn-how-protect-yourself-scams", "published": "2025-09-30T17:00:00Z", "body": "Every year, scammers get more active around Medicare Open Enrollment Period, trying to get your money, information, or both. As you consider your health coverage and prescription options during this period (October 15-December 7), learn to spot the scams.\nFirst, know that scammers often impersonate Medicare and contact you unexpectedly. They might sound professional and even have some of your personal information. They’ll say you need a “new” or “updated” Medicare card and ask for your Medicare, bank account, or credit card number. But real Medicare cards are free and mailed to you automatically. And true Medicare representatives won’t call, text, or email you out of the blue to ask for your numbers or a payment.\nHere are some ways to protect yourself from Medicare scams during Open Enrollment — and year-round:\nReport Medicare impersonators and other Medicare scams at 1-800-MEDICARE. Then tell the FTC at ReportFraud.ftc.gov .\nFor additional help to prevent, detect, and report potential Medicare fraud, errors, and abuse, contact your local Senior Medicare Patrol .\nMore\nMás"}
{"title": "How To Spot, Avoid, and Report Tech Support Scams", "url": "https://consumer.ftc.gov/articles/how-spot-avoid-and-report-tech-support-scams", "published": "2025-09-30T21:00:00Z", "body": "The FTC will never threaten you, say you must transfer your money to “protect it,” or tell you to withdraw cash or buy gold and give it to someone. That’s a scam.\nReport it at ReportFraud.ftc.gov\nTech support scammers use different tactics to trick you into believing there’s a virus or other issue with your computer.\nTech support scams often start with a bogus warning about a problem with your computer. It could be a fake pop-up warning that looks like it’s from a well-known company and urges you to call a phone number to get help. Other tech support scams might start with a call or text message from a scammer who pretends they’re a computer technician from a well-known company.\n[Listen to an FTC undercover call with a tech support scammer .]\nTech support scammers might also try to get their websites to show up in online search results for tech support or run their own display ads online. The scammers are hoping you’ll call the phone number to get help.\nIf one of these tech support impersonators gets you on the phone, they ask for remote access to your computer and pretend to scan it for viruses. They claim to find a malicious program and offer to remove it for a fee.\nThey often insist that you pay with gift cards, a wire transfer, a bank transfer, cryptocurrency, or a payment app. They want you to pay in one of these ways because it’s like using cash — once you pay, it’s hard to get your money back.\nSometimes, the fake tech support specialist with remote access to your computer pretends to scan it for viruses and claims to discover that someone hacked your accounts. Or that your name is linked to serious crimes, like money laundering or drug trafficking.\nThat’s when the tech support impersonator transfers you to someone who supposedly works for the government and can help you. That’s a lie. This person is a scammer who may give you a badge number or open a case number. Both are fake. How can you know? Because of what comes next. He says your money is at risk and you have to protect it immediately. He might say to\nAnd that’s how you know it’s a scam. Because someone who works for the government will never say you must transfer your money to “protect it.”\nSomeone who works for the government will never tell you to put your money in a federal safety locker. There’s no such thing.\nSomeone who works for the government will never demand payment. Not in cash. Not in gold.\nIn another type of scheme, scammers send notices about automatic renewals for tech support subscriptions. You might get an email or text message that says you were charged hundreds of dollars to renew your tech support subscription. To get your attention, the scammers use the names of well-known companies like Geek Squad, McAfee, and Norton.\nThe message says you must call a phone number within 24 hours if you want to dispute the charge. If you call, the scammers ask for remote access to your computer. They take you to a spoofed website that looks real and tell you to enter your bank or credit card information to process the refund. After you do that, they claim there was an error in the amount entered. They say they refunded you too much money and insist you pay them back with gift cards, a wire transfer, a bank transfer, cryptocurrency, or a payment app.\nIf you get a message about a tech support subscription renewal and you think it’s real, contact the company directly using a phone number you know is real. Do not use the number included in the message.\nAlso check your credit card or bank account for an unauthorized transaction for a tech support subscription. If you see one, report it to your credit card company or bank and ask them to reverse it and give you back your money. If you don’t see a transaction for a tech support subscription, that tells you the message was a scam. Ignore and delete it.\nMost tech support scams rely on elaborate stories, threats, and pressure to con you into giving up your financial information or your hard-earned money. But remembering these two things will help you avoid a tech support scam:\nNot sure if it’s a scam? Talk to someone you trust — a friend, a family member, a neighbor. Talking about it could help you realize it's a scam.\nIf you think there may be a problem with your computer, update your computer’s security software and run a scan. If you need help fixing a problem, go to someone you know and trust. Many software companies offer support online or by phone. Stores that sell computer equipment also offer technical support in person.\nRead What To Do if You Were Scammed for specific steps to take if you\nIf you gave your username and password to a tech support scammer, change your password right away. If you use the same password for other accounts or sites, change it there, too. Create a new password that is strong.\nIf a tech support scammer contacts you, tell the FTC at ReportFraud.ftc.gov .\nWhen you report a scam, the FTC uses the information to build cases against scammers. Are you skeptical that reporting scams will make a difference? This video shows how your story helps the FTC stop scammers."}
{"title": "What To Know Before Donating To Help First Responders, Active Duty Military, Veterans, and Their Families", "url": "https://consumer.ftc.gov/articles/what-know-donating-help-first-responders-active-duty-military-veterans-and-their-families", "published": "2025-09-30T21:00:00Z", "body": "Do you get asked to donate to your local first responders, like firefighters or police officers? Or see appeals asking you to help veterans? Many charities raise funds to help these groups, so before you respond, make sure you’re donating to one that will use your gift wisely. Learn about the rules charities have to follow and how to avoid donating to a fake charity.\nMany legitimate charities support local firefighters and police, active duty military, veterans, or their families. But other charities lie about what they do with donations or how much they spend on programs. And some are outright scams.\nTo avoid donating to a fake charity:\nMany charities that help first responders, veterans, active duty military, or their families pay fundraisers to call donors or potential donors. Fundraising calls are allowed even if your number is on the National Do Not Call Registry . If you want fundraisers to stop calling, ask them to put you on the charity’s do not call list. If you get a second call from that charity, report it to the FTC . When a charity’s fundraiser calls to ask you for a donation, they have to follow some rules:\nIf a fundraiser breaks any of these rules, that might be a sign of their dishonesty. Consider finding another way to donate to the cause you care about.\nFour Questions To Ask a Fundraiser\nAsk these questions whenever someone says they’re raising funds for a charity that helps first responders, active duty military, veterans, or their families.\nOrganizations that help veterans, first responders, and military families often use direct mail to create awareness and fundraise. Getting a charitable solicitation in the mail gives you time to research the organization.\nWhen you get a donation request in the mail:\nMany organizations also solicit donations online and on social media. To help you give safely:\nRead Donating Through Crowdfunding and Fundraising Platforms for more advice on what to look for if you’re considering donating to a crowdfunding campaign or online charitable fundraising platform.\nBefore you give money to someone who says they’re raising funds for a charity that helps first responders, active duty military, veterans, or their families:\nRead Before Giving to a Charity for more.\nReport charity scams to\nGive as much information as you can in your report, including the name of the fundraiser who contacted you, the name, phone number, website, and address of the charity, and any other details the fundraiser gave about the charity."}
{"title": "Before Giving to a Charity", "url": "https://consumer.ftc.gov/articles/giving-charity", "published": "2025-09-30T21:00:00Z", "body": "To make sure your donations count, do some research before you give to a charity. Here are some things to do to learn more about a charity and avoid donating to a scam.\nIf someone calls, asking you to donate, ask important questions:\nRules callers should follow\nFundraising calls are allowed even if your number is on the National Do Not Call Registry . If you want fundraisers to stop calling, ask them to put you on the charity’s do not call list.\nWhen a charity’s fundraiser calls to ask you for a donation, they should follow some rules:\nIf a fundraiser breaks any of these rules, that might be a sign of their dishonesty. Consider finding another way to donate to the cause you care about.\nIf you’re ready to donate\nAfter you’ve donated\nIf you sent money to a scammer, read What To Do if You Paid a Scammer for advice on how to try to recover your money.\nYou might have seen social media posts from people asking for donations. Pay attention to who’s asking and who’s getting the money. Don’t assume these requests are legitimate, or that hyperlinks are accurate just because a friend posted it. It’s faster and safer to donate directly to the charity’s website.\nRead Donating Through Crowdfunding and Fundraising Platforms for more advice on what to look for if you’re considering donating through a crowdfunding site or an online charitable fundraising platform.\nNon-cash donations to a charity are called gifts-in-kind. Sometimes gifts-in-kind can be large ticket items, like a car or medical equipment that’s not being used, but they can also be used clothing or household goods.\nWhen a charity uses and reports these donations properly, gifts-in-kind can be an important part of the charity’s programs. But a dishonest charity might mark up the value of donated goods to make their organization appear more financially successful than it really is.\nWhen you research the charity, pay attention to how the organization spends its cash, not just the value of gifts-in-kind. If a charity is using gifts-in-kind to inflate its operations, but then spends most of its cash to pay executives or cover operating expenses, you may want to consider donating to a different organization.\nReport scams to\nGive as much information as you can in your report, including the name of the fundraiser who contacted you, the name, phone number, website, and address of the charity, and any other details the fundraiser gave about the charity."}
{"title": "Donating Through Crowdfunding and Fundraising Platforms", "url": "https://consumer.ftc.gov/articles/donating-through-crowdfunding-and-fundraising-platforms", "published": "2025-09-30T21:00:00Z", "body": "Someone has probably asked you to give money to charities, causes, and people in need through crowdfunding sites or online charitable fundraising platforms. Here’s how to avoid donating to a scammer.\nCrowdfunding is a way to raise funds online, person-to-person. Online platforms like GoFundMe, Kickstarter, and Indiegogo let people create crowdfunding campaigns. They’re easy to set up, and the organizers get the funds quickly. Here are a few things to know:\nHow to avoid donating to a crowdfunding scam\nThe safest way to give through a crowdfunding campaign is to donate to campaigns organized by people you know and trust. To be sure your money goes to the person or cause you want to support, before you donate:\nCrowdfunding campaigns to fund a business project or invention\nPeople also use crowdfunding campaigns to fund a project or invention. The organizer might ask for small contributions — $10, $50, $100 — which can quickly add up to thousands of dollars in funding. In other cases, the goal is to get individual investors to give large amounts of money, perhaps in exchange for a reward once the project is completed — like getting a prototype of the new gadget, or some other incentive.\nBut a dishonest person might lie about the project or product and its development timeline. And they might lie about the rewards donors will get once the product is finished.\nIf someone asks you to give money to a crowdfunding campaign to fund a business project or invention:\nCrowdfunding campaigns for medical treatments\nIf the crowdfunding campaign is for medical treatments, don’t assume the treatments are safe or have been tested. Some medical treatments promoted through crowdfunding are unproven and ineffective and could even cause serious harm to people who try them.\nAn online fundraising platform, or online giving portal, is a website that lets you donate to charities. Companies like eBay, Amazon, Facebook, Instagram, Lyft, and others have online fundraising platforms their members can use.\nWhen you donate through an online fundraising platform, your money may not go directly to the charity you chose. Another company — maybe the platform or some other intermediary — may get your money first, take some of it as a fee, and then pass on the rest to the charity. Also, it may take time for the charity to get the money. That could be an issue if you’re donating to help people with immediate needs, like people affected by a natural disaster.\nThe best online fundraising platforms will have clear, easy-to-find information on their websites about:\nIf these details aren’t clear, consider taking your donation elsewhere. You can always donate directly to the charity you want to support, through the charity’s own website.\nIf you spot a crowdfunding scam, first report it to the crowdfunding platform. Here are links to report to some of those companies:\nThen, report the campaign organizer to:\nIf you spot a problem with a local charity listed on an online fundraising platform that serves your community, tell your state’s charities regulator ."}
{"title": "How to spot a job scam", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/how-spot-job-scam", "published": "2025-09-30T17:00:00Z", "body": "Every day, people you know are seeing phony business opportunities, work-at-home scams, shady employment agencies, and scammy multi-level marketing schemes. Job seekers don’t have the time or resources to waste on fake opportunities, but there are some ways to spot these scams. Watch this video as FTC Chairman Andrew Ferguson explains.\nJob Scams Warning with FTC Chairman Andrew Ferguson\nShare this video using the links in the player above or use the YouTube version .\nProtecting American workers from these kinds of practices is a priority for the FTC — in fact, that’s why the Chairman launched a Labor Task Force to keep the agency’s focus on these issues. And reports to the FTC show that these scams are alive and well. Check out this dashboard to see what reports and losses look like. And if you spot a job scam, tell the FTC: ReportFraud.ftc.gov .\nMore\nMás"}
{"title": "No, that’s not an FTC commissioner on the phone", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/no-thats-not-ftc-commissioner-phone", "published": "2025-09-30T17:00:00Z", "body": "Scammers like to pretend to be someone official to try to get your money. And who could be more official than the FTC chairman and commissioners, some of the nation’s leading fraud fighters? But here’s something important to know: nobody who works at the FTC will ever, EVER tell you to move your money to protect it. We won’t insist that you cash out your 401(k) or savings account and give that money to someone else.\nBut every week, the FTC gets reports from panicked people who wound up on the phone with “someone from the FTC” who told them just that. And then told them to keep it a secret. All with the goal of stealing as much money as they possibly could.\nSo spread the word: FTC staff won’t ever tell you to move or give someone your money, for any reason. Not Chairman Andrew Ferguson. Not Commissioner Melissa Holyoak. Not Commissioner Mark Meador.\nWatch this video, the first in a series from all the commissioners, so they can tell you for themselves — and then please share it. You definitely know someone who can benefit from this message.\nHow to Spot Imposters Scams\nShare this video using the links in the player above or use the YouTube version .\nOh, and if anybody EVER tells you not to do some research, or says to keep the call a secret, that’s ALWAYS a scam.\nMore\nMás"}
{"title": "Scammers are impersonating the United States Patent and Trademark Office", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/scammers-are-impersonating-united-states-patent-and-trademark-office", "published": "2025-09-30T17:00:00Z", "body": "If you own a business or know someone who does, you know how important a trademark is for protecting your intellectual property. Scammers do, too, and they’re impersonating the United States Patent and Trademark Office (USPTO) to steal your money. Here’s how the scam works.\nYou get an “urgent” call, text, or email that looks like it’s from the USPTO. It may even use the name of a real USPTO employee, like a trademark examining attorney. They say you need to pay by phone — or by clicking a link in the text or email — to complete your application before someone else registers the same trademark. Or they say your trademark was just approved or needs renewal and to pay them immediately. They might say to pay with a credit or debit card, or with a wire transfer , payment app , or gift card . But in any of those cases, it’s not actually the USPTO reaching out. It’s a scammer who tried to look real by faking caller ID, using the name of a real USPTO employee, or using an official-looking USPTO seal.\nTo help you avoid a scam like this:\nLearn more about government impersonation scams at ftc.gov/imposters . And if you get a call, text, or email like this, tell the FTC at ReportFraud.ftc.gov .\nMore\nMás"}
{"title": "Ignore unexpected calls about loans you didn’t apply for", "url": "https://consumer.ftc.gov/consumer-alerts/2025/09/ignore-unexpected-calls-about-loans-you-didnt-apply", "published": "2025-09-30T17:00:00Z", "body": "A voicemail from an unknown caller reminding you about a $52,000 loan that you didn’t apply for can throw you off balance. Which explains why scammers send them — hoping you’ll respond first and think later. You might already know how to spot phone scams , but in case you need a refresher, here’s how to spot this one.\nSome phone scams start with an unexpected call saying you’re “prequalified” for a loan. (You’re not.) The caller wants you to give them personal information like your Social Security or bank account numbers or birth date over the phone. They might say the application is almost finished and just needs a few more details from you. (Not true.) Or say things like “I hope you don’t miss out” or “no pressure.” (Those are pressure tactics.) In a voicemail, the caller might offer to take you off the call list…if you them call back. (Another pressure tactic.)\nScammers often make these seemingly urgent calls multiple times a day from different numbers to try and wear you down. But don’t respond — not even to “opt out.” If you’re getting calls like these on your cell phone:\nReport unwanted calls to the FTC at ReportFraud.ftc.gov . Be sure to include the number on your caller ID and any number you’re told to call back.\nWatch this video on how to stop calls on your cell phone\nMore\nMás"}
{"title": "Avoid Scams When You Travel", "url": "https://consumer.ftc.gov/articles/avoid-scams-when-you-travel", "published": "2025-09-30T21:00:00Z", "body": "You’ve probably seen ads online for “free” vacations. Or you may have gotten emails, calls, or text messages saying you’ve won a vacation, even though you never entered a contest. If you respond to these offers, you’ll quickly learn that you have to pay some fees and taxes first — so your “free” vacation isn’t really free. A legitimate company won’t ask you to pay for a free prize.\nYou might get robocalls offering you vacation deals at a discounted price. Robocalls from companies trying to sell you something are illegal unless the companies got written permission, directly from you, to call you that way. If someone is already breaking the law by robocalling you without permission, there’s a good chance it’s a scam. At the very least, it’s a company you don’t want to do business with.\nYou might see sites that claim to be able to help you get an international travel visa, passport, or other documents. Some sites are legitimate businesses, while others are just copycats of official websites belonging to the U.S. Department of State or other government organizations. These imposter sites charge you high fees, including fees for services that are free on the U.S. Department of State's website. For example, they might tell you to pay to get special access or improve your chances of winning the \"visa lottery,\" but there is no special access, and nobody can increase your chances of winning.\nAn International Driving Permit (IDP) translates your government-issued driver’s license into 10 languages. Scammers create websites to sell fake IDPs, or try to sell them to you in person or some other way. If you buy a fake IDP, you’ll be paying for a worthless document. But, even worse, you also could face legal problems or travel delays if you’re detained for using it to drive in a foreign country. The U.S. Department of State authorizes only two organizations to issue IDPs in the United States: the American Automobile Association (AAA) and the American Automobile Touring Alliance (AATA).\nThese days, it’s easy to connect directly with property owners who advertise their vacation homes online. But scammers are also trying to get your rental booking . For example, they hijack real rental listings and advertise them as their own, so when you show up for your vacation, you find out that other people are also booked for the same property. You have no place to stay, and your money is gone. Other scammers don’t bother with real rentals — they make up listings for places that aren’t really for rent or don’t exist. Searching online for the rental property’s address, plus the name of the property owner or rental company listed, can help you avoid losing time and money to a rental listing scam. If other ads come up for the same address, it’s probably a scam — especially if the ads list a different owner or rental company name. Check the rental company’s website to see if the property is listed there, too. If it isn’t, the listing is likely a scam.\nYou may get a flyer in the mail, see an ad, or hear from someone in your community about an offer to travel by private plane to some place you’d like to go. The offer may even include lodging and sightseeing tours. You think you’re signing up for a charter flight and vacation package, but after you pay, you find out it’s all a scam. The U.S. Department of Transportation’s (DOT) Special Authorities Division maintains a list of approved public charter flights . If the charter filing is not approved by DOT before the package is sold, you’re probably dealing with a dishonest charter operator.\nMaybe you weren’t thinking about selling your timeshare — but suddenly, someone calls and tells you they’re a real estate agent and have an interested buyer. They might have information about you and your property, so the offer seems credible. Then, the so-called timeshare expert asks you to pay upfront to finalize the deal — but it might be a scam. Timeshares are hard to sell and only a scammer will tell you they already have a buyer or can find one fast.\nIf you think you may have been targeted by a travel scam, report it to"}
{"title": "That social media ad with super low prices on well-known brands could be a scam", "url": "https://consumer.ftc.gov/consumer-alerts/2025/08/social-media-ad-super-low-prices-well-known-brands-could-be-scam", "published": "2025-09-30T17:00:00Z", "body": "See an eye-catching “deal” on your social for a brand-name product at a big discount? Don’t click — it could be a scam. Here’s what to know.\nScammers sometimes impersonate real companies on social media, advertising big discounts on brand-name products. Clicking on a scammy ad can take you to a fake website that’s designed to steal your money or information, like your Social Security or bank account number. If you pay, you might get a cheap fake or nothing at all. If you give your personal information, the scammer might steal your identity.\nTo avoid responding to scammy ads on social media:\nAlready paid a scammer? Read What To Do if You Were Scammed to find out what to do next. And tell the FTC at ReportFraud.ftc.gov . If you’re worried about identity theft, go to IdentityTheft.gov .\nMore\nMás"}
